{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with decorative balloons and gifts indicating a birthday celebration.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored tank top - dark pants - brown, shoulder-length hair - expression shifts from surprised to animated and concerned\nChandler Bing: dark t-shirt - dark pants - dark, short hair - expression: concerned, then smirking\nPhoebe Buffay: dark patterned dress - long blonde hair - expression: concerned, then animated\nMonica Geller: light-colored sweater - patterned skirt - dark, shoulder-length hair - expression: concerned, then smiling\nJoey Tribbiani: blue plaid shirt over a collared shirt - light-colored pants - dark, styled hair - expression: distressed, then animated\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands and gestures animatedly while speaking to Monica, who is seated and listening. Chandler sits on the couch, looking concerned and occasionally smirking. Joey stands near the center of the room, initially holding his head in distress, then gesturing toward Rachel as she holds a balloon. Phoebe stands near the coffee table, looking concerned. The group is gathered in a living room decorated for a birthday, with balloons and gifts visible.\n\n### **OBJECTS AND PROPS:**\n- Balloons: various colors and designs (including one with",
    "subtitles": "This is unbelievable. I mean, this is unbelievable. I know. This is really, really huge. No, it's not. It's small, it's tiny, it's petite, it's wee. Uh-uh. I don't think any of our lives will ever be the same ever again. Is there a mute button on this woman? I think this is so great! I mean, you and Ross! - Did you have any idea? - No, none. My first night in the city, he mentioned asking me out... ...but nothing ever happened, so I just... What else did he say? Does he want to go out with me? Given that he's desperately in love with you... ...he wouldn't mind getting a cup of coffee or something. Ross? All this time? - I've gotta talk to him. - He's in China! The country. Wait, his flight doesn't leave for 45 minutes. What about the time difference? From here to the airport?",
    "episode": "1x24 - The One Where Rachel Finds Out",
    "chunk": "chunk_00011",
    "start_chunk": "00:10:03.269",
    "end_chunk": "00:11:01.409"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with decorative balloons and party decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored tank top - dark-colored pants - brown, shoulder-length hair - concerned, animated expression\nMonica Geller: light-colored sweater - patterned skirt - dark, shoulder-length hair - serious, concerned expression\nChandler Bing: blue shirt - dark vest - dark, styled hair - surprised, animated expression\nPhoebe Buffay: black floral dress - blonde, long straight hair - serious, concerned expression\nJoey Tribbiani: dark shirt - unclear pants - dark, styled hair - surprised, concerned expression\nRoss Geller: dark shirt - unclear pants - dark, styled hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel enters the apartment, visibly upset, holding a piece of paper and gesturing as she speaks to Monica. Monica stands holding the paper, looking concerned. Chandler and Joey react with surprise as Rachel walks around the room. Phoebe enters holding a photo, showing it to Rachel while speaking. Rachel, now wearing a beige jacket, confronts Phoebe. The group gathers around a small table with snacks. The scene cuts to an airport, where Rachel and Phoebe are at a check-in counter, with Ross and Chandler nearby.\n\n### **OBJECTS AND PROPS:**\n- Balloons: various colors (in the living room)\n- Lamp: woven shade (on table)\n- Table: round, wooden, with snacks and",
    "subtitles": "What about the time difference? From here to the airport? Yes! - You're never gonna make it! - I've got to try. What are you gonna say to him? I don't know. CHANDLER: Maybe you shouldn't go. Right, because if you're gonna break his heart, that can wait. Yeah, but if it's good news, tell him now. Maybe I'll know when I see him. Here, look. All right, does this help? No. All I know is, I cannot wait a week. This is just too big. I've just got to talk to him. I've got... - I'll see you later. - I love you! Deal with me first! [SPEAKING IN FOREIGN LANGUAGE] All right. [SHOUTS IN FOREIGN LANGUAGE] Ross! Ross.",
    "episode": "1x24 - The One Where Rachel Finds Out",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:58.824",
    "end_chunk": "00:12:01.886"
  },
  "chunk_3": {
    "caption": " ### **SCENE SETTING:**\nAirport terminal — nighttime, artificial lighting\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - dark shirt - dark, short hair - concerned expression\nRachel Green: light-colored jacket - dark pants - shoulder-length brown hair - animated expression\nUnidentified person: dark jacket - dark pants - dark hair - neutral expression\nUnidentified person: light-colored jacket - dark pants - dark hair - neutral expression\nUnidentified person: dark jacket - dark pants - dark hair - neutral expression\nUnidentified person: dark jacket - dark pants - dark hair - neutral expression\n### **ACTIONS AND INTERACTIONS:**\nRachel Green is animatedly talking to Ross Geller, gesturing with her hands as she speaks. Ross Geller appears concerned and is holding a boarding pass. Other passengers are standing around them, some looking at the interaction, while others are engaged in their own activities. Rachel Green moves closer to Ross Geller as she speaks, and Ross Geller turns to face her.\n### **OBJECTS AND PROPS:**\nBoarding pass: white (held by Ross Geller)\nPiano: dark wood (in foreground)\nLuggage: various colors (in background)\nAirport terminal signage: unclear (in background)\n### **DIALOGUE CONTEXT:**\nRachel Green discusses a message from Ross Geller with Ross Geller. The conversation has a tense tone",
    "subtitles": "Ross! Ross. Excuse me, pardon me. - Hi. Your boarding pass? - Hi. No, I need to talk to my friend. Sorry, you're not allowed on the jetway unless you have a boarding pass. He just went on. He's right there, in the blue jacket! Can I just...? I'm sorry. Federal regulations! All right, um, then could you please just give him a message for me? Please? This is very important. All right. What's the message? Uh... I don't know. [SPEAKING IN FOREIGN LANGUAGE] Excuse me! Sir! Excuse me! Sir? - I have a message for you. - What? It's from Rachel. She loved the present. She'll see you when you get back. What? Toby, I don't know what she's talking about. There's no Rachel! Don't give me that deep freeze! [MELANIE MOANS] Oh, Joey, Joey, Joey!",
    "episode": "1x24 - The One Where Rachel Finds Out",
    "chunk": "chunk_00013",
    "start_chunk": "00:11:59.260",
    "end_chunk": "00:13:02.280"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nA bedroom at night, dimly lit with warm ambient light, likely from a bedside lamp. The setting includes a bed with pillows and a dark comforter, and a wooden door is visible in the background.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: shirtless - dark-colored pants - dark, styled hair - smiling and animated\nPhoebe Buffay: wearing a white lace top - light-colored pants - blonde, shoulder-length hair - smiling and engaged\n\n### **ACTIONS AND INTERACTIONS:**\nJoey and Phoebe are lying in bed together, shirtless and covered by a comforter. They are affectionately interacting, with Joey leaning over Phoebe, kissing her, and holding her close. Phoebe responds by smiling, touching Joey’s face, and engaging in conversation with him. Their interaction is intimate and affectionate, with both characters appearing happy and relaxed.\n\n### **OBJECTS AND PROPS:**\n- Bed: with pillows and a dark comforter\n- Wooden door: visible in the background\n- Jewelry: Phoebe is wearing a bracelet and earrings\n\n### **DIALOGUE CONTEXT:**\nJoey discusses his unexpected generosity with Phoebe, who is surprised and amused by his character. The conversation has a lighthearted and affectionate tone, with Joey appearing animated and Phoebe reacting with smiles and laughter.\n\n### **TEMPORAL NOTES:**\nNone observed — characters remain in bed throughout the clip, with no significant movement or position changes.",
    "subtitles": "Oh, Joey, Joey, Joey! I think I blacked out there for a minute. It was nothing. Well, now we gotta find something fun for you! [LAUGHING] Ahh, you know what? Forget about me. Let's, uh... Let's give you another turn. Me, again? Sure. Why not? Boy! Somebody's gonna get a big fruit basket tomorrow! I gotta tell you, you are nothing like I thought you would be. How do you mean? I just had you pegged as one of those guys who are always, \"Me, me, me!\" - Ha, ha. - But you... ...you're a giver. You're, like, the most generous man I ever met.",
    "episode": "1x24 - The One Where Rachel Finds Out",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:58.527",
    "end_chunk": "00:14:02.048"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — evening, warm artificial lighting with decorative balloons and party decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored tank top - unclear lower clothing - shoulder-length brown hair - animated, expressive\nMonica Geller: light-colored sweater - patterned skirt - dark, shoulder-length hair - smiling, engaged\nPhoebe Buffay: dark-colored dress with floral pattern - long blonde hair - concerned, arms crossed\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands at the table, gesturing with her hands as she speaks to Monica, who holds a piece of wrapping paper and responds with a smile. Phoebe stands nearby with her arms crossed, looking on with a concerned expression. Monica then moves toward Phoebe and they share a hug, while Rachel watches them.\n\n### **OBJECTS AND PROPS:**\n- Cake: white with yellow frosting (on table)\n- Coffee mugs: various colors (on table)\n- Balloons: colorful (in background)\n- Refrigerator: white, with photos and magnets (against wall)\n- Flowers: orange and red (in vase near refrigerator)\n- Wooden table: round, with chairs\n\n### **DIALOGUE CONTEXT:**\nMonica discusses wrapping paper with Rachel, suggesting they save it despite it being torn. Rachel expresses uncertainty about dating Ross, and Monica encourages her, joking that they’d be like “friends-in-law.” The conversation",
    "subtitles": "You're, like, the most generous man I ever met. I mean, you're practically a woman. So, uh, Rach, do you want to save this wrapping paper? It's only a little torn. Are you gonna go for it with Ross, or should I throw it out? I don't know. Thought about it all of the way there... ...and I thought about it all the way back and, uh... You know, it's Ross! You know what I mean? It's Ross. - Sure! - Sure. I don't know. This is just my initial gut feeling... ...but I'm thinking... ...it'd be really great. Oh, my God, me too! Oh, we'd be like friends-in-law! The best part is you already know everything about him. It's like starting on the 15th date. But it would be like starting on the 15th date.",
    "episode": "1x24 - The One Where Rachel Finds Out",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:59.630",
    "end_chunk": "00:15:03.318"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in Monica's apartment living room during an evening birthday celebration, then shift to an airport terminal, and finally to a bedroom before returning to Monica's apartment.\n\n**KEY CHARACTERS**\n*   **Rachel Green:** Upset, animated, and confronting, then concerned about dating Ross.\n*   **Ross Geller:** Concerned and holding a boarding pass.\n*   **Monica Geller:** Concerned, then supportive and smiling.\n*   **Chandler Bing:** Concerned, then surprised and animated.\n*   **Phoebe Buffay:** Concerned, then animated and affectionate with Joey, later concerned in Monica's apartment.\n*   **Joey Tribbiani:** Distressed, then animated and affectionately intimate with Phoebe.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Monica's apartment during a birthday celebration where Rachel appears upset while holding a piece of paper. Chandler, Phoebe, Monica, and Joey react with concern and surprise. As Rachel confronts Phoebe with the paper, the scene shifts abruptly to an airport terminal at night, where Rachel is animatedly discussing a message from Ross with him, who appears concerned. Simultaneously, or shortly after, Joey and Phoebe are depicted in a bedroom, sharing an intimate and affectionate moment, discussing his generosity in a lighthearted tone. The narrative then returns to Monica's apartment, where Rachel is still expressing uncertainty about dating Ross to Monica, who encourages her, while Phoebe looks on with concern before Monica hugs her.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Rachel is clearly upset about something involving Ross, leading to a confrontation at the airport. Meanwhile, Joey and Phoebe are shown in an intimate and affectionate relationship. Monica encourages Rachel about dating Ross.\n*   **Emotional Tone:** The initial scene in Monica's apartment is tinged with surprise and concern regarding Rachel's distress. The airport scene is tense, while the bedroom scene is intimate and lighthearted. The final return to Monica's apartment brings back themes of emotional support and relationship advice.\n*   **Plot Setup or Payoff:** The airport scene is a significant moment where Rachel directly confronts Ross about a message, indicating a critical point in their relationship. The Joey and Phoebe bedroom scene establishes their romantic connection.\n*   **Notable Transitions between Locations or Conversations:** The abrupt shift from Monica's apartment party to the airport highlights the urgency of Rachel's situation with Ross. The subsequent shift to the bedroom provides a contrast in emotional tone before returning to the ongoing conversations in Monica's apartment."
}