{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen and living area — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - serious, then animated expression\nRachel Green: light-colored cable-knit sweater - dark pants - brown, shoulder-length hair - concerned, then animated\nPhoebe Buffay: patterned top - dark pants - long, blonde hair - surprised, then amused\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Rachel stand near the kitchen table, preparing food and talking animatedly, with Monica gesturing emphatically. Phoebe sits at the table, holding a beer bottle, reacting with surprise and amusement to their conversation. Monica briefly walks to the refrigerator and returns with a bottle, continuing the discussion.\n\n### **OBJECTS AND PROPS:**\n- Beer bottles: dark-colored (on table)\n- Carrots: being peeled (in hands)\n- Refrigerator: white, with magnets and photos (behind Monica)\n- Kitchen table: wooden, with food items and bottles\n- Lamp: lit, on side table (background)\n- Tulips: in vase (on counter)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses past bad boyfriends with Rachel, referencing Pete Carney and Howard, while Phoebe reacts with surprise and amusement. The conversation has a casual, slightly humorous tone",
    "subtitles": "Okay, Roger was creepy, but he was nothing compared to Pete Carney. - Which one was he? - Pete the Weeper? Remember the guy that used to cry every time we had sex? [MIMICS SOBBING] \"Oh, was it good for you?\" Well, I'd take a little crying any day over Howard, the \"I win\" guy. \"I win. I win.\" I went out with him for two months. I didn't get to win once. How do we end up with these jerks? We're good people. I don't know. I think we're like some kind of magnets. I know I am. That's why I can't wear a digital watch. There's more beer, right? Oh. You know my friend Abby who shaves her head? She says to break the bad-boyfriend cycle... ...you can do a cleansing ritual. Pheebs, this woman is voluntarily bald.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00006",
    "start_chunk": "00:05:00.258",
    "end_chunk": "00:06:00.650"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — evening, warm artificial lighting\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: patterned top - unclear lower clothing - long, blonde, wavy hair - animated, expressive\nMonica Geller: dark-colored sweater - unclear lower clothing - dark, shoulder-length hair - serious, focused\nRachel Green: white, off-the-shoulder sweater - unclear lower clothing - brown, shoulder-length hair - concerned, listening\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe stands at the kitchen table, gesturing animatedly while talking to Monica and Rachel, who stand near the table listening. Rachel holds a small object in her hands and looks down thoughtfully. Monica stands beside Rachel, listening intently with a serious expression. The scene cuts to a restaurant where Ross and Monica are seated at a table, kissing. Ross is seen talking to Monica, who listens with a smile. Chandler sits at another table, looking on with a thoughtful expression.\n\n### **OBJECTS AND PROPS:**\n- Bottles: dark-colored (on table)\n- Bowl: blue (on table)\n- Chairs: wooden (around table)\n- Refrigerator: white (in background)\n- Tulips: purple (in vase on counter)\n- Pot: white (on stove)\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses a ritual involving burning items with Monica and Rachel. The conversation has a casual, slightly humorous tone, with Phoebe appearing animated and Monica and Rachel reacting with concern and thoughtfulness.\n\n### **TEMPORAL NOTES:**\nScene transitions from Monica’s apartment kitchen to a",
    "subtitles": "Pheebs, this woman is voluntarily bald. Yeah. So we can do it tomorrow night, you guys. It's Valentine's Day. It's perfect. Okay, well, what kind of ritual? Okay, we can, um, burn the stuff they gave us. Or? Or we can chant and dance around naked, you know, with sticks. - Burning's good. - Burning's good. RACHEL: I've got stuff to burn. [CLASSICAL MUSIC PLAYING OVER SPEAKERS] You know... ...ever since I was little, I've been able to pick up quarters with my toes. Yeah? Good for you. Uh, quarters or rolls of quarters? By the way, Chandler, I cut you out of all of my pictures.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:57.023",
    "end_chunk": "00:07:02.421"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nAn upscale restaurant with dark green walls and ornate decor — evening, dim ambient lighting with accent lights.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored jacket - dark pants - dark, styled hair - expression shifts from amused to serious\nUnidentified person: light-colored top - dark pants - long, dark curly hair - animated expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing sits at a table with a woman, smiling and talking as she gestures animatedly. He then stands up and walks away, engaging in a tense conversation with another man who approaches him. The woman remains seated, continuing to speak and gesture while Chandler is away.\n\n### **OBJECTS AND PROPS:**\n- Tablecloth: red (on table)\n- Wine glasses: multiple (on table)\n- Flower arrangement: white and pink (in basket on table)\n- Bottle: dark-colored (in basket on table)\n- Chairs: red upholstered (around table)\n\n### **DIALOGUE CONTEXT:**\nChandler Bing discusses being cut out of pictures with the woman, who suggests making puppets from his head. The conversation turns tense as Chandler stands up and confronts another man, who appears to be discussing something serious with him. The tone is initially playful but shifts to serious and confrontational.\n\n### **TEMPORAL NOTES:**\nChandler Bing stands up and walks away from the table\nChandler Bing engages in a conversation with another man\nThe woman remains seated and continues talking throughout the clip",
    "subtitles": "By the way, Chandler, I cut you out of all of my pictures. So if you want, I have a bag with just your heads. That's okay. Are you sure? Because you could make little puppets out of them. And you could use them in your Theater of Cruelty. We can't do that. What? What can't you do? Uh, can I talk to you for a second? Over there? Uh, we might be leaving now. Tell me it's you and me \"we.\" She said she wants to slather my body with stuff and then lick it off. I'm not even sure what slathering is. But I definitely want to be a part of it. Okay, you cannot do this to me. You're right. I'm sorry. You're right.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:58.626",
    "end_chunk": "00:08:01.730"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nAn upscale restaurant with dark green walls, ornate gold trim, and red tablecloths — evening, dim ambient lighting with accent lamps.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored jacket - dark vest and tie - dark, medium-length hair - serious expression\nChandler Bing: light-colored shirt - dark pants - dark, medium-length hair - animated expression\nUnidentified person: dark top - dark hair - smiling expression (visible in background)\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler stand and talk animatedly, gesturing with their hands. Ross then walks through the restaurant, stopping at tables to interact with patrons before sitting down at a table with a woman. The woman, seated at the table, has her arms crossed and speaks while looking at Ross. Chandler sits at the table, listening and reacting to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Red tablecloths (on tables)\n- Wine glasses (on tables)\n- Vases with lilies (on tables)\n- Menu (on table)\n- Basket with wine bottle (on table)\n- Chairs (red upholstered)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses dinner plans with Chandler, who expresses frustration about the night. The conversation has a joking tone, with Ross appearing serious and Chandler reacting with amusement. The woman at the table speaks to Ross, appearing concerned or annoyed.\n\n### **TEMPORAL NOTES:**\nRoss walks from standing position to sitting position at a table.\nChandler sits down at the table.\nThe woman at the table crosses her arms and speaks.",
    "subtitles": "You're right. I'm sorry. You're right. Uh, can we have three chocolate mousses to go, please? I'm out of here. Here's my credit card. Dinner's on me. I'm sorry, Chandler. I hope she throws up on you. Thanks. - So... - Just us. Ugh, what a crappy night. Although I have enjoyed the fact that your shirt's been sticking out... ...of your zipper since you came back from the bathroom. [LAUGHS] Excuse me. How you doing? So do we have the best friends, or what? Joey's not a friend. He's... ...a stupid man who left us his credit card.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:59.437",
    "end_chunk": "00:09:02.958"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nAn upscale restaurant — evening, warm ambient lighting with decorative wall art and floral centerpieces.\n\n### **CHARACTERS PRESENT:**\n- Monica Geller: light-colored cardigan - dark top - dark, curly hair - smiling and animated\n- Chandler Bing: dark green jacket over plaid shirt - dark pants - dark, wavy hair - initially serious, then animated while speaking\n- Unidentified person: dark suit - dark hair - partially visible, seated at table\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits at a table, gesturing as she speaks to Chandler, who is seated across from her. Chandler responds, holding up a credit card and gesturing with it. Monica laughs in response. A waiter approaches their table. The scene cuts to Chandler sleeping in bed, with Monica leaning over him, playfully touching his face and neck, causing him to wake up with a startled expression. Monica smiles at him. The scene ends with Monica standing outside an apartment door, knocking.\n\n### **OBJECTS AND PROPS:**\n- Wine bottle: in wicker basket (on table)\n- Glasses: wine and water (on table)\n- Plates: with food (on table)\n- Red tablecloth: covering table\n- White pillows: on bed\n- Bookshelf: with books (in background)\n- Apartment door: green, with number 19 (in hallway)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a credit card and a drink with Chandler. The conversation has a playful, joking tone, with Monica appearing animated and Chandler reacting with surprise and amusement. Monica laughs as Chandler holds up the card.\n\n### **TEMPORAL NOTES:**\n- Chandler stands up and gestures while speaking\n- Monica laughs and gestures\n- Scene cuts to Chandler sleeping in bed\n- Monica leans over Chandler and touches his face\n- Scene cuts to Monica standing outside an apartment door and knocking",
    "subtitles": "...a stupid man who left us his credit card. Another drink? Some dessert? A big-screen TV? I will go for that drink. You got it. Good woman. A bottle of your most overpriced champagne. - Each. - That's right. Each. Oh. And a, uh, Rob Roy. I've always wanted to know. Happy Valentine's Day. Oh, I miss you already.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00010",
    "start_chunk": "00:08:59.664",
    "end_chunk": "00:09:58.888"
  },
  "summary": "**SCENE OVERVIEW**\nThe events primarily take place in Monica's apartment kitchen and living area, and then shift to an upscale restaurant setting. The time is evening.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Preparing food, discussing past boyfriends, later at a restaurant, and playfully waking Chandler.\n*   **Rachel Green:** Participating in the conversation at Monica's apartment, appearing concerned and thoughtful.\n*   **Phoebe Buffay:** Reacting with surprise and amusement to conversations at Monica's, and discussing a ritual.\n*   **Chandler Bing:** At a restaurant, first interacting playfully with a woman, then engaging in a tense conversation with another man, later dining with Monica, and finally waking up startled in bed.\n*   **Ross Geller:** Seen at a restaurant, kissing Monica, and later discussing dinner plans with Chandler.\n*   **Unidentified Woman:** Interacting with Chandler at a restaurant.\n*   **Unidentified Man:** Engaging in a tense conversation with Chandler at a restaurant.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode begins in Monica's apartment kitchen, where Monica and Rachel are preparing food and animatedly discussing Monica's past bad boyfriends, with Phoebe chiming in with surprise and amusement. Phoebe also describes a ritual involving burning items, to which Monica and Rachel react thoughtfully. The scene then transitions to an upscale restaurant. Chandler is initially seen having a playful conversation with a woman, but it turns tense when another man approaches him for a serious discussion. Meanwhile, Ross is seen kissing Monica at the restaurant. Later, Ross discusses dinner plans with Chandler, who expresses frustration about the evening. Finally, Monica and Chandler are dining together at the restaurant, engaged in a playful conversation about a credit card, which leads to Monica playfully waking Chandler in bed later. The sequence concludes with Monica standing outside an apartment door, knocking.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Dynamics:** The episode explores interpersonal conversations and interactions, from casual discussions about past relationships and rituals to more tense confrontations. The developing romance between Monica and Chandler is also highlighted.\n*   **Emotional Tone:** The tone shifts from casual and humorous in the apartment scenes to playful, tense, and confrontational in the restaurant, before returning to playful and intimate in the final scenes.\n*   **Plot Setup:** The initial conversations about past relationships and Phoebe's ritual set up potential future plot points. The tense interaction between Chandler and the other man hints at underlying conflict.\n*   **Transitions:** The narrative transitions from the domestic setting of Monica's apartment to the more public and potentially dramatic setting of a restaurant, and finally to a private bedroom and an external doorway, suggesting a progression of events and relationships."
}