{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA Japanese-style restaurant — evening, warm ambient lighting with decorative wall art and wooden paneling.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit jacket - white shirt - red patterned tie - dark, short hair - animated expression\nCarol Willet: red dress - blonde, shoulder-length hair - smiling expression\nUnidentified person: light-colored top - dark hair - smiling expression\nUnidentified person: dark-colored top - dark hair - smiling expression\nUnidentified person: dark-colored top - dark hair - smiling expression\nUnidentified person: dark-colored top - dark hair - smiling expression\nUnidentified person: dark-colored top - dark hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits at a counter, gesturing with his hands while speaking to a woman in a white top. Carol Willet stands up from her seat and walks toward the group, smiling. Ross Geller stands up and gestures toward Carol Willet, inviting her to join them. Carol Willet sits down at the counter, smiling and interacting with the group. The group continues to eat and converse, with Ross Geller and the woman in the white top engaging in conversation.\n\n### **OBJECTS AND PROPS:**\n- Food bowls: various colors (on table)\n- Glasses: various colors (on table)\n- White figurine: on table\n- Wooden counter: central feature\n- Decorative wall art: on walls\n- Red door: visible in background\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses inviting Carol Willet",
    "subtitles": "...which is funny because that wasn't even my major. [LAUGHS] Now, that is funny. Hey, do you think...? Would it be too weird if I invited Carol over to join us? Because she's alone now. And pregnant. And sad. - I guess. - Are you sure? Thanks. Carol. Wanna come over and join us? Oh, no. I'm fine. Come on, stand up. These people will scooch down. Come on. Come over here. You guys will scooch, won't you? Let's try scooching. Come on. ROSS: Come on. CAROL: Thank you. Uh, Kristen Riggs, this is Carol Willet. - Carol, Kristen. - How do you do? Um... Oh, uh, Carol teaches sixth grade.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:59.189",
    "end_chunk": "00:16:01.417"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nA Japanese-style restaurant with a teppanyaki grill — evening, warm ambient lighting with decorative wall art and wooden paneling.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit - red tie - dark hair - animated expression\nRachel Green: light-colored top - dark pants - long brown hair - smiling\nUnidentified person: red dress - blonde hair in ponytail - smiling\nUnidentified person: light-colored shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person: dark shirt - dark pants - dark hair - smiling\nUnidentified person",
    "subtitles": "Um... Oh, uh, Carol teaches sixth grade. And, uh, Kristen... Kristen does something... ...that, funnily enough... ...wasn't even her major. FIREMAN 1: What do we got there? A piece of silk boxer shorts... ...some greeting cards... ...what looks like a half-charred picture of... Wow, that guy's hairier than the chief. You know, it's a really funny story how this happened. It's all right. Don't explain. It's not the first boyfriend bonfire we've seen get out of control. - You're our third call tonight. - Really? Sure. Valentine's is our busiest night of the year. I brought you something.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:59.083",
    "end_chunk": "00:17:00.226"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with background patrons.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark-colored shirt - blue jeans - dark, curly hair - smiling, animated\nUnidentified person: dark-colored top - unclear lower clothing - dark, curly hair - smiling, leaning on Joey\n\n### **ACTIONS AND INTERACTIONS:**\nJoey Tribbiani and an unidentified woman sit on the orange couch, laughing and interacting closely as he holds and examines a small packet. The woman leans into him, smiling and gesturing as they talk. Joey becomes more animated, gesturing with his hands while speaking, and the woman responds with expressive hand movements and facial reactions.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center)\n- Wooden coffee table (in front of couch)\n- Green mug (on table)\n- Magazine: \"GQ\" (on table)\n- Ashtray (on table)\n- Leopard-print scarf (worn by unidentified woman)\n\n### **DIALOGUE CONTEXT:**\nJoey Tribbiani discusses candy hearts with the unidentified woman. The conversation has a playful, lighthearted tone, with Joey appearing animated and the woman reacting by smiling and leaning into him.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "I brought you something. Is it loaded? Oh, little candy hearts. \"Chan and Jan forever.\" I had them made special. Okay, Janice. Janice. Hey, Janice. Look, there's no way for me to tell you this. At least, there's no new way for me to tell you this. I just don't think things are gonna work out. That's fine. - It is? - Mm-hm. Because I know that this isn't the end. Oh, no. You see, actually, it is. No, it isn't. Because you won't let that happen.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:58.684",
    "end_chunk": "00:17:59.827"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm interior lighting with visible bar area and furniture.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored shirt with red/white geometric pattern - dark pants - dark, medium-length hair - animated, expressive\nUnidentified person: red sweater with leopard-print vest - dark top - dark, curly hair - animated, expressive\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing and an unidentified person are seated on the orange couch, engaged in an animated conversation. The unidentified person gestures emphatically while speaking, and Chandler listens intently, occasionally responding with gestures. At the end of the clip, Chandler stands up abruptly and walks away from the couch toward the bar area.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Bar area with bottles and decor (background)\n- Table with flowers and decor (behind couch)\n- Menu board (behind bar)\n\n### **DIALOGUE CONTEXT:**\nThe unidentified person discusses a romantic theme with Chandler Bing, referencing their recurring relationship patterns. The conversation has a playful, teasing tone, with the unidentified person appearing animated and Chandler reacting with surprise and exasperation. The unidentified person's gestures and facial expressions suggest a dramatic or exaggerated point, while Chandler's expressions shift from listening to frustration.\n\n### **TEMPORAL NOTES:**\nChandler Bing stands up and walks toward the bar area.",
    "subtitles": "Don't you know it yet? You love me, Chandler Bing. Oh, no, I don't. Then why do you think we keep ending up together? New Year's, who invited who? Valentine's, who asked who into whose bed? - I did, but... - You seek me out. Something deep in your soul calls out to me like a foghorn. Janice. Janice. You want me. You need me. You can't live without me. And you know it. You just don't know you know it. See you. Call me.",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00019",
    "start_chunk": "00:18:00.079",
    "end_chunk": "00:18:57.510"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nA Japanese-style restaurant with wooden paneling and decorative wall masks — evening, warm interior lighting.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit jacket - white shirt - red and grey striped tie - dark, short hair - expression: animated, concerned\nPhoebe Buffay: red dress - blonde hair tied back - expression: smiling, engaged\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Phoebe are seated at a wooden counter, eating from small bowls. Ross gestures with his hands while talking, and Phoebe responds, occasionally touching his face. Ross briefly leans forward, then sits back, continuing the conversation. Phoebe smiles and laughs at his expressions.\n\n### **OBJECTS AND PROPS:**\n- Bowls: green ceramic (on counter)\n- Cups: dark-colored (on counter)\n- Wooden counter (center)\n- Decorative wall masks (background)\n- Vase with flowers (background)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a past date with Phoebe, expressing concern about his performance. Phoebe responds with amusement, teasing him about his awkwardness. The conversation has a lighthearted, joking tone, with Ross appearing flustered and Phoebe reacting with laughter and playful gestures.\n\n### **TEMPORAL NOTES:**\nRoss leans forward and then sits back in his chair. Phoebe touches Ross's face and then leans back, smiling.",
    "subtitles": "It's not true. I never called your mother a wolverine. You did so. I swear. I swear to... How long has she been in the bathroom? Uh, I don't think she's in the bathroom. Her coat is gone. Well, maybe it's cold in there. Maybe I screwed up the first date I had in nine years. - That could be it. - Oh, God. You know, this is still pretty hot. Mushroom. Smile. They won't all be like this. Some might even stay through dinner. - I'm sorry. That's not funny. - No, it's just... Well, you know the whole getting-on-with-your-life thing? Well, do I have to?",
    "episode": "1x14 - The One with the Candy Hearts",
    "chunk": "chunk_00020",
    "start_chunk": "00:19:06.103",
    "end_chunk": "00:20:01.032"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in two distinct locations: a Japanese-style restaurant and Central Perk coffee shop, all occurring in the evening. The scene shifts between these locations.\n\n**KEY CHARACTERS**\n- Ross Geller: Involved in conversations, initially at a restaurant and later with Phoebe. Appears animated, concerned, and flustered at different points.\n- Phoebe Buffay: Engaged in a lighthearted conversation with Ross at a restaurant.\n- Joey Tribbiani: Interacting playfully with an unidentified woman at Central Perk.\n- Chandler Bing: Engaged in a teasing conversation at Central Perk, ending with him abruptly leaving.\n- Unidentified individuals: Present in various social settings, some interacting with the main characters.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative begins in a Japanese-style restaurant where Ross Geller is seen in animated conversation, initially with a woman and then joined by Carol Willet. He is discussing inviting Carol. Later, in the same restaurant setting, Ross is seen talking to Phoebe Buffay, where he expresses concern about a past date and his performance, to which Phoebe responds with amusement and teasing. Meanwhile, at Central Perk, Joey Tribbiani is in a lighthearted, playful conversation with an unidentified woman, examining a small packet. Concurrently, Chandler Bing is engaged in a teasing conversation with another unidentified person about recurring romantic relationship patterns, which escalates to the point where Chandler abruptly stands up and walks away.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Dynamics:** Ross discusses inviting Carol, hinting at his ongoing relationship with her. Joey and an unidentified woman share a playful, intimate moment. Chandler's interaction with an unidentified woman highlights recurring romantic patterns and his frustration with them.\n*   **Emotional Tone:** The conversations range from lighthearted and playful (Joey, Phoebe with Ross, Chandler's initial interaction) to concerned and flustered (Ross discussing his date with Phoebe).\n*   **Transitions:** The scene shifts from the Japanese restaurant to Central Perk, and within Central Perk, Chandler transitions from a conversation to abruptly leaving.\n*   **Dialogue Focus:** The dialogue centers around romantic relationships, past dates, and recurring patterns, with a mix of teasing, concern, and playful banter."
}