{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, bright natural lighting from windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - dark shirt - dark, short hair - animated expression\nChandler Bing: light-colored shirt - dark pants - brown, short hair - smiling expression\nJoey Tribbiani: light-colored shirt - dark vest - dark, medium-length hair - smiling expression\nRachel Green: dark-colored t-shirt - plaid skirt - brown, shoulder-length hair - focused expression\nMonica Geller: white blouse - black skirt - dark, shoulder-length hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler are engaged in an animated conversation, gesturing emphatically while standing near the counter. Joey enters from the side, holding a cup, and joins the group. Rachel is seen in the background, wiping down a table with a cloth. Monica enters from the doorway, smiling, and approaches Rachel. The group appears to be in a lively, social setting, with Ross and Chandler continuing their discussion while the others react or move around the space.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with newspapers and a mug)\n- Refrigerator (white, with magnets)\n- Brick wall decor (background)\n- Neon sign (on wall)\n- Flower arrangement (on table)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a sports betting opportunity with Chandler, mentioning a potential win in San Diego. The conversation has a joking, competitive tone, with Ross appearing excited and Chandler reacting with amusement. Monica and Rachel are present but not directly involved in the conversation, with Monica smiling as she enters the scene.\n\n### **TEMPORAL NOTES:**\nRachel moves from the kitchen area to the table, wiping it down.\nMonica enters the frame from the doorway and walks toward Rachel.\nRoss and Chandler continue their conversation while standing near the counter.",
    "subtitles": "...you got to give the little guy something. Otherwise, it's just cruel! [PANTING] He got into San Diego! - What? - Yeah. We were coming back from our walk, and the phone was ringing... - He's in! - He's in? Ah! Did you hear that, Marcel? San Diego! San Diego! Yeah! You're making a mistake. San Diego's well and good... ...but if you give him to me, I'll start him against a blind rabbit... ...and give you 20 percent of the gate. Yo-ho! Where have you been? Monica and I just crashed an embassy party. Are you drunk? No!",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:58.355",
    "end_chunk": "00:15:59.248"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — daytime, natural window light\n\n### **CHARACTERS PRESENT:**\nMonica Geller: white button-up shirt - black overalls - dark, shoulder-length hair - animated\nRachel Green: black t-shirt - plaid skirt - brown, shoulder-length hair - concerned\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, wearing overalls, gestures animatedly while talking to Rachel, who stands near the refrigerator looking concerned. Monica moves around the kitchen, at one point bending over the sink, then stands up and continues speaking with expressive hand movements. Rachel listens, occasionally shifting her position and looking at Monica with a worried expression.\n\n### **OBJECTS AND PROPS:**\n- White refrigerator (with magnets) (center-right)\n- Blue kitchen cabinets (left)\n- Wooden countertop (kitchen)\n- Flower arrangement (on shelf)\n- Microwave (left)\n- Yellow pitcher (left)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses her plans to go to the Big Apple Circus with Rachel, who expresses concern about her job. The conversation has a tense tone, with Monica appearing animated and Rachel reacting with worry and disbelief.\n\n### **TEMPORAL NOTES:**\nRachel moves from facing away to standing near the refrigerator\nMonica bends over the sink and then stands up\nMonica moves from the sink area to the living room area",
    "subtitles": "I'm lying. I am so drunk! Oh, God! Ugh. Great. You know what? You could have called. I've been up here. I've been worried... Monica. Monica? Water rules! Yes. Yes, it does. The restaurant called. They want to know if you're showing up. Nope! I'm going to the Big Apple Circus today. What are you doing? You're gonna lose your job. This is not you! No, it is me! I'm not just the person who needs to fluff the pillows... ...and pay the bills as soon as they come in! You know, when I'm with her, I'm so much more than that! I'm... I'm Monana! [PHONE RINGING]",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00017",
    "start_chunk": "00:16:03.003",
    "end_chunk": "00:17:01.269"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — daytime, bright natural light from windows\nThe scene transitions to a prison visitation room — indoor, artificial lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored t-shirt - dark pants - brown, shoulder-length hair - concerned expression\nMonica Geller: white collared shirt - dark pants with suspenders - dark, shoulder-length hair - expression shifts from concerned to shocked to serious\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands in the kitchen, talking on a cordless phone while holding a kitchen towel, then walks toward the living room. Monica, initially in the living room, answers the phone, her expression shifting from surprised to distressed as she listens. She then hangs up and walks toward the kitchen, looking concerned. The scene cuts to Monica visiting a woman in a prison visitation room, where she sits across from the inmate, who is wearing a blue prison uniform and holding a phone receiver. Monica appears calm and composed during the visit, while the inmate speaks animatedly.\n\n### **OBJECTS AND PROPS:**\n- Cordless phone: silver (held by Rachel)\n- Kitchen towel: white with orange stripes (held by Rachel)\n- Flower vase: white, with pink and yellow flowers (on kitchen counter)\n- Prison visitation phone: silver, oval-shaped (on table between Monica and inmate)\n- Prison uniform: blue (worn by inmate)\n- Sign: \"NEW YORK CITY DEPARTMENT OF CORRECTION RIKERS ISLAND CORRECTIONAL COMPLEX\" (visible outside prison)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses a phone call with Monica, who is arrested and being visited in prison. The conversation has a tense tone, with Rachel appearing concerned and Monica looking serious and composed. The inmate speaks animatedly during the visit, while Monica listens calmly.\n\n### **TEMPORAL NOTES:**\nRachel moves from the kitchen to the living room\nMonica moves from the living room to the kitchen\nScene transitions from Monica’s apartment to a prison visitation room\nMonica sits down in the prison visitation room",
    "subtitles": "[PHONE RINGING] Ahem, hello? Yes, she is. Hold on a second, please. Ahem, Monana, it's for you. The credit card people. Hello? Yes? Oh, my God! Thanks. What? They've arrested Monica. - Hi. - Hey. How are you? I'm not too bad. Fortunately, blue's my color. How did you know I was here? Because... ...I'm Monica Geller. It was my credit card you were using. That I was not expecting.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:58.475",
    "end_chunk": "00:18:02.246"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nVisitation room at a correctional facility — indoor, artificial lighting\n\n### **CHARACTERS PRESENT:**\nUnidentified person: dark-colored shirt - curly hair - serious expression\nUnidentified person: dark-colored blazer over white shirt - dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nTwo individuals sit across from each other at a table, engaged in a conversation. The person in the dark blazer gestures with their hands while speaking, and the other person listens, occasionally responding. Both individuals appear to be emotionally invested in the conversation, with the person in the blazer showing concern and the other person appearing serious and reflective.\n\n### **OBJECTS AND PROPS:**\nMetallic intercom device: silver (on table between them)\nWooden table (center)\nDark-colored chairs (occupied by both individuals)\nSign on wall: text visible (rules for visitors)\n\n### **DIALOGUE CONTEXT:**\nThe person in the dark blazer discusses a personal matter with the other individual, expressing concern about their well-being and future. The conversation has a serious and emotional tone, with the speaker appearing concerned and the listener reacting with seriousness and reflection.\n\n### **TEMPORAL NOTES:**\nNo significant changes in position or action occur during the clip.",
    "subtitles": "That I was not expecting. I want you to know, I didn't turn you in. Oh. - Thanks. - No, thank you. You have given me so much. If it wasn't for you, I'd never have gotten... ...to sing \"Memories\" at the Winter Garden Theater. Actually, you only got to sing \"Memo...\" I can't believe you're in here. What am I gonna do without you? Who's gonna crash the embassy parties with me? Who's gonna take me to the Big Apple Circus? Monica, I started my day by peeing in front of 25 other women... ...and you're worried about who will take you to the Big Apple Circus? Well, not worried, you know, just wondering. There's nothing to wonder about. You'll go back to being who you were because that's who you are. - Not necessarily. - Yes, necessarily. I don't know what it is. Maybe it's the Amish thing.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:59.870",
    "end_chunk": "00:18:58.469"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nA dance studio with mirrors and a wooden floor — daytime, bright artificial lighting. The scene transitions to an airport terminal with a modern, curved building and yellow taxis — daytime, natural and artificial lighting.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling and animated\nRachel Green: dark-colored top - light-colored pants - dark, curly hair - smiling and engaged\nPhoebe Buffay: grey hoodie - black leggings - dark, shoulder-length hair - smiling and gesturing\nUnidentified person: blue shirt - curly hair - smiling and talking\nUnidentified person: dark-colored shirt - light-colored pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUnidentified person: dark-colored shirt - dark pants - short, dark hair - smiling and dancing\nUn",
    "subtitles": "Um, I'm not actually Amish. Really? Then why are you like that? You by the door, in or out? In! You in the back, you're getting it wrong! At least I'm doing it! WOMAN [OVER PA]: This is the final boarding call for Flight 67 to San Diego... ...boarding at Gate 42A. Okay, goodbye, little monkey guy.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00020",
    "start_chunk": "00:19:01.723",
    "end_chunk": "00:20:01.532"
  },
  "summary": "**SCENE OVERVIEW**\nThe scene begins in Monica's apartment and transitions to a prison visitation room, then shifts to a dance studio and finally an airport terminal.\n\n**KEY CHARACTERS**\n- Monica Geller: Initially animated, becomes concerned, then serious and composed.\n- Rachel Green: Concerned and worried, later smiling and engaged.\n- Ross Geller: Animated and excited.\n- Chandler Bing: Amused.\n- Joey Tribbiani: Present.\n- Phoebe Buffay: Smiling and gesturing.\n- Unidentified Inmate: Speaks animatedly.\n- Unidentified Visitor(s): Engaged in serious, emotional conversations.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens with Ross excitedly discussing a sports betting opportunity with Chandler at Central Perk, while Joey arrives and Monica and Rachel are also present. The scene then shifts to Monica's apartment kitchen, where Monica animatedly tells Rachel about her plans to attend the Big Apple Circus, but Rachel expresses concern about her job. A phone call interrupts them; Rachel is on the phone initially, then Monica takes it and reacts with shock and distress, leading to a scene at a prison visitation room. Monica visits an inmate, appearing calm and composed while the inmate speaks animatedly. Later, in a visitation room, an unidentified person expresses concern to another individual about their well-being. The scene then shifts to a dance studio where Monica, Rachel, and Phoebe are seen with other people, followed by a transition to an airport terminal.\n\n**IMPORTANT CONTEXT OR THEMES**\n- Initial lighthearted banter between Ross and Chandler at Central Perk.\n- Growing tension as Rachel expresses concern over Monica's job while discussing circus plans.\n- A significant plot twist with Monica's arrest and subsequent prison visit.\n- A serious and emotional conversation between unidentified individuals in a correctional facility.\n- A shift to a more upbeat atmosphere with dancing in a studio, followed by a transition to an airport.\n- The juxtaposition of a serious legal issue with seemingly unrelated activities (circus, dancing, travel)."
}