{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nAn airport terminal or animal center lobby — daytime, bright artificial lighting with large windows showing an airplane outside.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: grey coat - red shirt - dark, short hair - serious, concerned expression\nRachel Green: beige jacket - dark pants - brown, shoulder-length hair - concerned, holding a teddy bear\nChandler Bing: dark sweater - dark pants - brown, medium-length hair - serious, concerned expression\nJoey Tribbiani: dark sweater - dark pants - brown, medium-length hair - serious, concerned expression\nPhoebe Buffay: grey jacket - dark pants - blonde, shoulder-length hair - concerned, standing near Ross\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - concerned, holding a teddy bear\n\n### **ACTIONS AND INTERACTIONS:**\nRoss stands at a podium holding a small monkey, looking down at it with a serious expression. Rachel approaches him, holding a teddy bear, and offers it to the monkey. Chandler places a hand on Ross's shoulder, appearing to comfort him. Joey stands nearby, looking concerned. Phoebe stands behind Ross, watching the interaction. Monica stands near Rachel, also holding a teddy bear and looking at Ross.\n\n### **OBJECTS AND PROPS:**\n- Monkey: black and white fur (on podium)\n- Teddy bear: brown with red bow (held by Rachel)\n- Podium: wooden (Ross is standing at)\n- Airplane: visible through large windows in background\n- Sign: \"No Smoking Beyond This Point\" (on wall)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the monkey with Rachel, who offers it a teddy bear. The conversation has a serious tone, with Ross appearing concerned and Rachel looking worried. Chandler and Joey stand nearby, reacting with concern. Phoebe watches from behind Ross.\n\n### **TEMPORAL NOTES:**\nRachel approaches Ross and offers the teddy bear.\nChandler places his hand on Ross's shoulder.\nJoey steps forward and places his hand on Ross's shoulder.\nRoss looks down at the monkey and then at Rachel.",
    "subtitles": "Okay, goodbye, little monkey guy. - I wrote you this poem. - Aw. Okay, but don't eat it till you get on the plane. - Thank you, Aunt Phoebe. - Aww. Okay, bye, champ. There's gonna be a lot of babes in San Diego... ...but remember, there's also a lot to learn. I don't know what to say, Ross. Uh, it's a monkey. Just say what you feel, Joey. Marcel, I'm hungry. ROSS: That was good. - Marcel, this is for you. - Oh. It's, uh, just, you know, something to, um... ...do on the plane. If you don't mind, I'd like a moment, just me and him. - Sure. - Of course. Absolutely.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00021",
    "start_chunk": "00:19:59.156",
    "end_chunk": "00:21:02.385"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nAirport terminal gate area — daytime, bright artificial lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light gray blazer - dark pants - dark, short hair - serious expression\nMonica Geller: dark-colored sweater - brown skirt - dark, shoulder-length hair - concerned expression\nRachel Green: light-colored jacket - dark pants - blonde, shoulder-length hair - concerned expression\nChandler Bing: dark sweater - light-colored shirt - dark, short hair - serious expression\nPhoebe Buffay: light-colored jacket - red skirt - blonde, shoulder-length hair - concerned expression\nJoey Tribbiani: dark sweater - light-colored shirt - dark, short hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits on a bench, petting a capuchin monkey named Marcel, who is perched on his lap. He speaks to the monkey, appearing emotional as he prepares to leave. Monica, Rachel, Chandler, Phoebe, and Joey stand nearby, watching with concerned expressions. Phoebe approaches Ross with a pet carrier labeled \"LIVE ANIMALS\" and places it on the floor beside him. Ross continues to interact with Marcel, who climbs onto his leg, prompting Ross to gently ask the monkey to stop.\n\n### **OBJECTS AND PROPS:**\n- Capuchin monkey: black and white fur (on Ross's lap)\n- Pet carrier: white with red grid, labeled \"LIVE ANIMALS\" (on floor)\n- Airport gate sign: visible in background\n- Gray bench: Ross is sitting on it\n- Airport seating: multiple gray chairs visible\n- Airplane mural: visible through window\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses his emotional farewell to Marcel, the capuchin monkey, with the group. The conversation has a sentimental tone, with Ross appearing emotional and the others reacting with concern. Ross asks the monkey to stop humping his leg, indicating a mix of affection and exasperation.\n\n### **TEMPORAL NOTES:**\nPhoebe Buffay enters the frame and places the pet carrier on the floor.\nRoss Geller sits down on the bench and begins petting the monkey.\nMarcel climbs onto Ross's leg, prompting Ross to ask the monkey to stop.",
    "subtitles": "- Sure. - Of course. Absolutely. ALL: Oh. Marcel, come here. Come here. Come here. Well, buddy... ...this is it. There's just a couple of things I wanted to say. I'm really gonna miss you. You know? And I'm never gonna forget about you. You've been more than just a pet to me. You've been more like a... Okay. Marcel, would you...? Marcel, would you leave my leg alone? Would you just stop humping me for two seconds? Marc... Would you...? Okay, would you just take him away? Just take him.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00022",
    "start_chunk": "00:20:59.383",
    "end_chunk": "00:21:47.430"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nA theater stage with red velvet curtains — daytime, bright stage lighting\n\n### **CHARACTERS PRESENT:**\nChandler Bing: plaid shirt - dark pants - brown, medium-length hair - smiling\nUnidentified person: dark-colored top - dark pants - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing stands center stage, smiling and gesturing as if performing or speaking to an audience. An unidentified person stands to his left, looking toward him with a serious expression. The scene appears to be a stage performance or audition, with credits rolling over the visuals.\n\n### **OBJECTS AND PROPS:**\n- Red velvet curtains (background)\n- Stage floor (light gray)\n- Text overlays (credits rolling)\n\n### **DIALOGUE CONTEXT:**\nThe subtitles indicate a casting call for the role of Mercutio, with a character named Holden McGroin auditioning. The tone is casual and theatrical, with Chandler appearing cheerful and engaged in the performance. The unidentified person appears to be listening or observing the audition.\n\n### **TEMPORAL NOTES:**\nChandler Bing moves slightly while speaking, gesturing with his hands. The unidentified person remains relatively still, maintaining a serious expression.",
    "subtitles": "O! That I were a glove upon that hand... ...that I might touch thy cheek. WOMAN: That's fine. Thank you. MAN: Next. Hi. Uh, I'll be reading for the role of Mercutio. MAN: Name? - Holden McGroin.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00023",
    "start_chunk": "00:22:09.369",
    "end_chunk": "00:22:31.474"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in an airport terminal lobby and then transition to an airport gate area, both during the daytime. The scene then shifts to a theater stage with red velvet curtains.\n\n**KEY CHARACTERS**\n*   **Ross Geller:** Emotional and concerned about parting with his monkey, Marcel.\n*   **Rachel Green:** Concerned and supportive of Ross.\n*   **Chandler Bing:** Supportive and comforting of Ross, later seen in a theatrical context.\n*   **Joey Tribbiani:** Concerned and supportive.\n*   **Phoebe Buffay:** Concerned and provides a pet carrier.\n*   **Monica Geller:** Concerned and supportive.\n*   **Marcel:** A capuchin monkey, the focus of Ross's emotional farewell.\n\n**MERGED NARRATIVE SUMMARY**\nIn an airport terminal, Ross is visibly upset as he prepares to say goodbye to his monkey, Marcel. His friends, Rachel, Chandler, Joey, Phoebe, and Monica, gather around him, offering comfort and support. Rachel and Monica hold teddy bears, attempting to soothe Ross and Marcel. Phoebe brings a pet carrier labeled \"LIVE ANIMALS.\" Ross sits with Marcel on his lap at the gate, petting him and expressing his emotional farewell, even gently asking the monkey to stop a playful gesture. Later, the scene shifts to a theater stage where Chandler is smiling and gesturing, seemingly performing or auditioning for a role as credits roll, suggesting a separate storyline or a different character's experience.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship developments:** The strong bond between Ross and his monkey, Marcel, is highlighted through his emotional farewell, with his friends providing a supportive presence.\n*   **Emotional tone:** The initial scenes are marked by sadness and sentimentality due to Ross's impending separation from Marcel, contrasting with a more lighthearted, theatrical tone in the later scene involving Chandler.\n*   **Plot setup or payoff:** This sequence sets up the departure of Marcel, a significant event for Ross, while the theater scene suggests a potential new development or comedic subplot for Chandler.\n*   **Notable transitions between locations or conversations:** The clear transition from the emotional airport farewell to the theatrical setting for Chandler indicates a shift in focus or narrative thread within the episode."
}