{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with a lamp visible in the kitchen area.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored checkered shirt - dark pants - short, dark hair - animated, speaking expressively\nRachel Green: dark cardigan over white t-shirt with red heart - red plaid pants - dark, shoulder-length hair - smiling, listening\nChandler Bing: light-colored shirt - dark pants - short, brown hair - relaxed, seated\nJoey Tribbiani: dark shirt - light-colored pants - dark, medium-length hair - smiling, seated\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - animated, gesturing while speaking\nUnidentified person: dark sweater - light pants - dark hair - standing, arms crossed\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on a stool, gesturing emphatically while speaking to Monica, who is seated nearby and responds with animated hand gestures. Rachel sits on the couch next to Chandler, smiling and listening to the conversation. Joey sits on the couch, smiling and looking toward the group. Monica moves to the kitchen area and begins buttering a large sandwich while talking to another person seated at the table. The group remains seated throughout, engaged in conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden coffee table (with magazines)\n- Brick wall decor (background)\n- Kitchen table (with sandwich and butter dish)\n- Lamp (on in kitchen area)\n- Refrigerator (white, with magnets)\n- Blue cabinets (kitchen)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a woman they encountered, describing her as \"astounding\" and \"amazing,\" while Monica reacts with disbelief and gestures. The conversation has a joking, lighthearted tone, with Ross appearing animated and Monica responding with exaggerated gestures and expressions. Rachel and Chandler listen with smiles, indicating amusement at the story.\n\n### **TEMPORAL NOTES:**\nMonica moves from the living room to the kitchen area.\nMonica begins buttering a sandwich at the kitchen table.\nRoss continues speaking while seated on the stool.",
    "subtitles": "- Hey. CHANDLER: Hey. - Hi. - We found the girl! - What? - Did you call the cops? Nope. We took her to lunch. Ah. Your own brand of vigilante justice. Are you insane? This woman stole from you! She stole! She's a stealer! After you're with this woman for 10 minutes, you forget all that. I mean, she's this astounding person... ...with this amazing spirit! Yeah, which she probably stole from some cheerleader! - Take off their hats. - Popes in a Volkswagen! Mm-hm. I love that joke. - No way! No way did you do this! - Monana was very brave. It was so wild. We told them we were the Gunnersons in room 615... ...only to find out the Boston Celtics had the entire sixth floor! So when they caught on to the fact that we're short and have breasts...",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00011",
    "start_chunk": "00:10:00.933",
    "end_chunk": "00:11:02.786"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — evening, warm artificial lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored ribbed shirt - dark pants - medium-length brown hair - smiling and animated\nUnidentified person: dark-colored patterned shirt - dark hair - smiling while spreading butter on bread\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits at a wooden table, smiling and talking to an unidentified woman who is spreading butter on a long sandwich. The unidentified woman gestures animatedly while speaking. Rachel stands up and walks toward a purple door, then turns back to look at the unidentified woman. The unidentified woman continues spreading butter on the sandwich while talking to Rachel.\n\n### **OBJECTS AND PROPS:**\n- Wooden table (center)\n- Long sandwich (on table)\n- Small bowl (on table)\n- Refrigerator (with magnets and photos)\n- Blue cabinets (background)\n- Microwave (background)\n\n### **DIALOGUE CONTEXT:**\nThe unidentified woman discusses auditioning for a Broadway show with Rachel. The conversation has a casual and joking tone, with the unidentified woman appearing animated and Rachel reacting with smiles and laughter.\n\n### **TEMPORAL NOTES:**\nRachel stands up and walks toward the purple door.",
    "subtitles": "So when they caught on to the fact that we're short and have breasts... They threw us out. I was thrown out of a hotel! Me! Go, Monana! Well, you ladies are not the only ones living the dream. I get to go pour coffee for people I don't know. Don't wait up. Oh, by the way... ...tomorrow we're auditioning for a Broadway show. Excuse me? There's an open call for Cats. I'm thinking we go down there, sing \"Memories\"... ...and make complete fools of ourselves. What do you say? No, no, no. Remember who you're dealing with here. Ha. I'm not like you. I can't even stand in front of a tap class. That's because of your Amish background. - What? - Well, you're Pennsylvania Dutch, right? Right. Till I bought a blow dryer. Then I was shunned.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:59.283",
    "end_chunk": "00:11:58.842"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — daytime, bright natural light\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored jacket - black top - curly blonde hair - animated\nUnidentified person: dark-colored shirt with white pattern - dark hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green sits at the kitchen table, gesturing expressively while talking to an unidentified person across from her. The unidentified person listens, smiling and occasionally responding. Both are seated throughout the scene, focused on their conversation.\n\n### **OBJECTS AND PROPS:**\n- Wooden table (center of frame)\n- Sandwich (on plate)\n- Bowl (on table)\n- Refrigerator (with magnets, visible in background)\n- Stove and kitchen counter (visible in background)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses a movie with the unidentified person. The conversation has a casual, joking tone, with Rachel appearing animated and the unidentified person reacting by smiling and nodding.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "I was just like you. And then one day, I saw a movie that changed my life. - Did you ever see Dead Poets Society? - Uh-huh. I thought that movie was so incredibly... ...boring! I mean, that thing at the end where the kid... ...kills himself because he can't be in the play? What was that? It's like, \"Kid, wait a year. Leave home, do some community theater!\" I walked out of there, and I thought: \"Now, that's two hours of my life that I'm never getting back!\" And that scared me more than all the other crap I was afraid to do. Wow. Then I would definitely not recommend Mrs. Doubtfire. [LAUGHING] Oh, God. We didn't get into Scranton. That was our safety zoo.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00013",
    "start_chunk": "00:12:00.678",
    "end_chunk": "00:13:01.946"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible purple walls and wooden furniture.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: white shirt - brown vest - dark, short hair - concerned expression\nRachel Green: dark-colored top - dark pants - shoulder-length brown hair - serious expression\nPhoebe Buffay: light-colored top - patterned pants - long blonde hair - relaxed expression\nChandler Bing: light-colored shirt - dark pants - short brown hair - animated expression\nJoey Tribbiani: maroon sweater - dark pants - short dark hair - surprised expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on the floor holding a piece of paper, speaking animatedly while gesturing with his hands. Rachel sits beside him, listening with a serious expression and occasionally looking away. Phoebe sits on the couch, looking at her phone. Chandler sits on the couch, reacting with surprise and gesturing. Joey enters the room from the doorway, looking surprised and gesturing as he speaks.\n\n### **OBJECTS AND PROPS:**\n- Wooden coffee table (center)\n- White couch (with patterned pillows)\n- Fern plant (in corner)\n- Television (on wooden cabinet)\n- Monkey (on floor near Ross)\n- Phone (in Phoebe’s hand)\n- Blue cabinets (in kitchen area)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a letter or document with Rachel, who appears skeptical. The conversation has a tense tone, with Ross appearing concerned and Rachel reacting with seriousness. Joey enters and reacts with surprise to the situation.\n\n### **TEMPORAL NOTES:**\nJoey enters the room from the doorway.\nPhoebe shifts her position on the couch.\nRoss gestures with his hands while speaking.\nChandler leans forward and gestures during the conversation.",
    "subtitles": "That was our safety zoo. They take, like, dogs and cows. See? I don't know who this is harder on, me or him. I'd say that chair's taking the brunt of it. ROSS: Marcel. Marcel. Marcel, no. Good boy! See? How can nobody want him? Somebody will. You know there already is a Joseph Stalin? You're kidding! Apparently, he was this Russian dictator who slaughtered all these people! - You'd think you would've known that! - You'd think I would've. Phoebe, what do you think a good stage name for me would be? [CLEARS THROAT]",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:58.861",
    "end_chunk": "00:14:00.839"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with visible window light\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - dark pants - short, dark hair - serious, focused expression\nRachel Green: light-colored top - patterned pants - long, blonde hair - concerned, listening expression\nChandler Bing: dark-colored shirt - dark pants - short, brown hair - relaxed, smiling expression\nJoey Tribbiani: light-colored shirt - dark pants - short, brown hair - animated, gesturing expression\nUnidentified person: dark shirt - dark pants - short, dark hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss stands near the counter, gesturing as he speaks to Joey, who is seated and animatedly responding. Rachel sits on the couch, listening intently with a concerned expression. Chandler leans back in his chair, smiling and observing the conversation. Joey gestures with his hands while talking, appearing enthusiastic. The group is engaged in a lively discussion, with Ross and Joey taking turns speaking.\n\n### **OBJECTS AND PROPS:**\nCoffee mugs: various colors (on table)\nOrange couch (center of frame)\nBrick wall decor (background)\nMenu board (behind counter)\nFloral arrangement (on table)\nWooden table (near counter)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a \"zoo\" or \"interactive wildlife experience\" with Joey, asking questions about an animal named Marcel. The conversation has a casual, slightly humorous tone, with Ross appearing serious and Joey animatedly responding. Rachel listens with concern, while Chandler observes with a relaxed smile.\n\n### **TEMPORAL NOTES:**\nRoss moves from standing near the counter to walking toward the door\nJoey gestures with hands while speaking\nRachel shifts her position slightly while listening\nChandler leans back and smiles throughout the conversation",
    "subtitles": "[CLEARS THROAT] Flame Boy! Where exactly is your zoo? Well, it's technically not a zoo per se. It's, uh, more of an interactive wildlife experience. Let me ask you some questions about... Is it, uh, Marcel? - Yes. - Yes. Uh... Does he, uh, fight with other animals? No, no. He's very docile. Hmm. Even if he were cornered? Well, I don't know. Why? Um, how is he at handling small objects? He can hold a banana, if that's what you mean. What about a hammer or a small blade? [STAMMERS] Why would he need a blade? If he's up against a jungle cat or an animal with horns... ...you got to give the little guy something.",
    "episode": "1x21 - The One With The Fake Monica",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:59.547",
    "end_chunk": "00:15:00.440"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes take place in Monica's apartment (living room and kitchen) and Central Perk coffee shop, shifting between evening and daytime.\n\n**KEY CHARACTERS**\n*   **Ross Geller:** Animated, concerned, and focused on a discussion about a woman and later about an animal named Marcel.\n*   **Rachel Green:** Smiling, listening, concerned, and engaged in conversations.\n*   **Monica Geller:** Animated and gesturing while speaking.\n*   **Chandler Bing:** Relaxed, smiling, amused, and observing.\n*   **Joey Tribbiani:** Smiling, animated, surprised, and enthusiastic in conversations.\n*   **Unidentified Person (Monica's Apartment):** Appears to be conversing with Monica and Rachel, discussing auditions and movies.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative begins in Monica's apartment living room with Ross animatedly describing an \"astounding\" and \"amazing\" woman to Monica, who reacts with disbelief. Meanwhile, Rachel and Chandler listen with amusement. Monica then moves to the kitchen, preparing a sandwich and chatting with an unidentified woman about her Broadway auditions, with Rachel joining in the conversation before Rachel moves toward a purple door. The scene shifts to the kitchen where Rachel continues discussing a movie with the unidentified person. Later, back in the living room, Ross is holding a paper and discussing it with Rachel, who appears skeptical, while Joey enters and reacts with surprise. The group then transitions to Central Perk, where Ross is speaking with Joey about an animal named Marcel and a \"zoo\" or \"interactive wildlife experience,\" with Rachel listening intently with concern and Chandler observing with amusement.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Introduction of a \"Fake Monica\":** Ross's initial animated description of a woman hints at a plotline involving someone posing as Monica, creating amusement and disbelief among the friends.\n*   **Rachel's Interactions:** Rachel engages in separate conversations with an unidentified woman in Monica's kitchen, discussing auditions and movies, establishing potential side plots or character introductions.\n*   **Tension and Surprise:** A scene in the living room involves a tense discussion between Ross and Rachel about a document, with Joey's surprised entrance adding to the intrigue.\n*   **Focus on Marcel:** The narrative culminates with Ross discussing the monkey Marcel and a zoo experience with Joey at Central Perk, indicating a significant plot point involving the animal.\n*   **Shifting Settings and Tone:** The episode moves between the comfortable setting of Monica's apartment and the public space of Central Perk, with the emotional tone shifting from lighthearted amusement to concern and surprise."
}