{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with neon signs visible\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark-colored jacket over striped shirt - light-colored pants - dark, styled hair - expression shifts from serious to surprised\nPhoebe Buffay: dark cardigan with red trim over white top - black pants - blonde hair in a braid - expression shifts from engaged to shocked\n\n### **ACTIONS AND INTERACTIONS:**\nJoey Tribbiani sits on the orange couch and leans in to kiss Phoebe Buffay on the cheek, then pulls back. Phoebe reacts with shock, covering her mouth with her hand. Joey stands up and walks away, leaving Phoebe sitting on the couch, still holding her hand to her mouth.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Wooden coffee table (with newspapers and ashtray)\n- Bar stools and counter (background)\n- Neon \"SERVICE\" sign (visible above counter)\n- \"Central Perk\" sign (visible through window)\n\n### **DIALOGUE CONTEXT:**\nJoey Tribbiani discusses a breakup with Phoebe Buffay. The conversation has a tense tone, with Joey appearing serious and Phoebe reacting by looking shocked and covering her mouth.\n\n### **TEMPORAL NOTES:**\nPhoebe Buffay moves from standing to sitting on the couch\nJoey Tribbiani moves from sitting to standing and walking away",
    "subtitles": "Then, uh... Then I'm sorry. You know... ...you're gonna be really, really hard to get over. I know. I don't know whether it's just because we're breaking up or what... ...but you have never looked so beautiful. Really? - Pheebs? - Yeah.",
    "episode": "1x17 - The One With Two Parts (2)",
    "chunk": "chunk_00021",
    "start_chunk": "00:19:58.739",
    "end_chunk": "00:20:59.423"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, fluorescent lighting\nThe setting is a clinical room with medical equipment, cabinets, and a gurney covered with a sheet.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown jacket - blue plaid shirt - short, dark hair - concerned expression\nChandler Bing: dark-colored sweater with light stripes - light-colored pants - short, dark hair - serious expression\nRachel Green: light-colored long-sleeved top - plaid pants - dark hair - concerned expression\nJoey Tribbiani: dark-colored jacket - dark pants - short, dark hair - concerned expression\nPhoebe Buffay: dark-colored coat with red trim - dark pants - blonde, shoulder-length hair - concerned expression\nUnidentified person: brown jacket - blue plaid shirt - short, dark hair - concerned expression (appears to be Ross Geller, but visual is ambiguous)\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits beside a gurney, speaking to the group while gesturing. Chandler Bing, Rachel Green, and Phoebe Buffay stand around the gurney, looking down at the covered figure with concern. Joey Tribbiani stands near the group, also looking down. The group collectively reacts to the situation, with Ross speaking and the others listening intently. The camera focuses on Ross as he talks, then shifts to show the group's reactions.\n\n### **OBJECTS AND PROPS:**\nGurney: covered with white sheet (center of frame)\nMedical equipment: white device with red dial (on wall)\nCabinets: light-colored (on wall)\nOxygen tank: white (in background)\nClock: red dial (on wall)\nMonkey: capuchin monkey (on gurney, revealed later)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the monkey's condition with the group. The conversation has a serious tone, with Ross appearing concerned and the others reacting with worry. The group is focused on the monkey, which is revealed to be recovering after surgery.\n\n### **TEMPORAL NOTES:**\nRoss Geller stands up and moves to the gurney\nPhoebe Buffay moves to stand beside Rachel Green\nChandler Bing steps forward to look at the gurney\nRoss Geller gestures toward the gurney while speaking\nThe camera focuses on the monkey on the gurney\nRoss Geller looks down at the monkey and smiles",
    "subtitles": "He looks so tiny. - We just got the message. - Is he all right? Yeah, the doctor got the K out. He also found an M and an O. We think he was trying to spell out \"monkey.\" The doctor says he'll be fine. He's just sleeping now. So you feel like a dad yet? No. Why? Hey, come on, you came through. You did what you had to do. That is very dad. Oh, look, he's waking up. ROSS: Hey, fella. How you doing?",
    "episode": "1x17 - The One With Two Parts (2)",
    "chunk": "chunk_00022",
    "start_chunk": "00:21:10.102",
    "end_chunk": "00:21:50.558"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, natural window light\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling\nRachel Green: light-colored cardigan - dark pants - brown, shoulder-length hair - smiling\nChandler Bing: dark-colored shirt - dark pants - brown, short hair - smiling\nJoey Tribbiani: plaid shirt - blue jeans - brown, medium-length hair - smiling\nPhoebe Buffay: dark jacket - dark pants - blonde, shoulder-length hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, Rachel, Chandler, Joey, and Phoebe stand together in the living room, smiling and laughing as they interact. Monica gestures with her hands while talking to Rachel, who holds a coffee mug and smiles back. Chandler leans against the wall with a relaxed expression, while Joey and Phoebe stand nearby, also smiling and engaged in the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with mugs and food containers)\n- Red and white checkered pillows (on couch)\n- Framed picture (on wall)\n\n### **DIALOGUE CONTEXT:**\nThe group is engaged in a lighthearted conversation, with Monica and Rachel laughing together. The tone is casual and joyful, with everyone appearing relaxed and happy. The group seems to be enjoying each other’s company, with smiles and animated gestures.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "[DUBBED IN SPANISH] ALL: Ooh.",
    "episode": "1x17 - The One With Two Parts (2)",
    "chunk": "chunk_00023",
    "start_chunk": "00:22:10.037",
    "end_chunk": "00:22:21.672"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in the Central Perk coffee shop during the daytime and then shift to a hospital room, also during the daytime. The final scene takes place in Monica's apartment living room, continuing in the daytime.\n\n**KEY CHARACTERS**\n*   **Joey Tribbiani:** Involved in a tense conversation with Phoebe, then concerned in the hospital, and later relaxed and happy in Monica's apartment.\n*   **Phoebe Buffay:** Shocked by Joey's actions, then concerned in the hospital, and finally happy in Monica's apartment.\n*   **Ross Geller:** Appears concerned and explanatory in the hospital.\n*   **Chandler Bing:** Appears serious in the hospital and relaxed in Monica's apartment.\n*   **Rachel Green:** Concerned in the hospital and smiling in Monica's apartment.\n*   **Monica Geller:** Present and smiling in her apartment.\n*   **Unidentified Person:** Appears to be Ross Geller, concerned in the hospital.\n*   **Monkey:** The subject of concern and eventual recovery in the hospital.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Central Perk, where Joey kisses Phoebe on the cheek, leaving her shocked and him walking away. The scene then transitions to a hospital room where Ross, Chandler, Rachel, Joey, and Phoebe gather, concerned about an unidentified person and later revealed to be a monkey recovering from surgery. Ross explains the monkey's condition to the worried group. Finally, the scene shifts to Monica's apartment, where Monica, Rachel, Chandler, Joey, and Phoebe are all present, engaged in a lighthearted and joyful conversation, laughing and enjoying each other's company.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Dynamics:** Joey's actions with Phoebe create an immediate emotional reaction, contrasting with the later camaraderie in Monica's apartment.\n*   **Emotional Tone:** The narrative shifts from tense and shocking (Central Perk) to serious and concerned (Hospital) and finally to lighthearted and joyful (Monica's Apartment).\n*   **Plot Setup:** The initial interaction between Joey and Phoebe hints at interpersonal drama, while the hospital scene focuses on the well-being of the monkey.\n*   **Notable Transitions:** There are clear scene transitions from the coffee shop to the hospital, and then to Monica's apartment, each with a distinct atmosphere and focus."
}