{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — daytime, fluorescent lighting\nThe scene is set in a hospital waiting area with chairs, a wooden table, and framed artwork on the walls. Medical equipment and signs for \"CCU & ICU\" are visible.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: light-colored cardigan - dark-colored pants - dark, shoulder-length hair - concerned expression\nRoss Geller: brown jacket - dark pants - dark, short hair - concerned expression\nJoey Tribbiani: patterned sweater (red, black, beige) - dark pants - dark, curly hair - concerned expression\nUnidentified person (Nana): light-colored pants and cardigan - blonde, curly hair - seated, appears elderly\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Ross stand by the hospital bed, looking down at the patient with concern. Monica leans forward to touch the patient's hand. Ross then steps back and gestures animatedly while speaking to the others. Joey and the unidentified woman sit in chairs, watching the interaction. Ross later walks to the hallway and speaks to the group, gesturing with his hands. The unidentified woman enters the room and joins the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee cups: white (on table)\n- Wooden table (center)\n- Hospital bed (with patient)\n- Medical equipment (in background)\n- Framed artwork (on walls)\n- Door with signs (CCU & ICU)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the patient's condition with Monica and Joey. The conversation has a tense tone, with Ross appearing anxious and Monica looking concerned. Joey reacts with a surprised expression as Ross explains the situation.\n\n### **TEMPORAL NOTES:**\nMonica",
    "subtitles": "Not just restaurants, from our house. Mrs. Geller? ROSS: She looks so small. I know. Well, at least she's with Pop-Pop and Aunt Phyllis now. Goodbye, Nana. Bye, Nana. [ROSS YELLS] [MONICA SCREAMS] Ross! Nurse. What is going on? You know, uh, how the nurse said Nana had passed? Well, she's not quite. - What? - She's not passed. She's present. She's back. What's going on? She may have died. \"She may have died\"? We're looking into it.",
    "episode": "1x08 - The One Where Nana Dies Twice",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:57.755",
    "end_chunk": "00:05:58.857"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nHospital hallway and patient room — daytime, fluorescent lighting. The scene transitions to Central Perk coffee shop — nighttime, warm interior lighting.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown jacket - light-colored shirt and tie - dark, short hair - concerned expression\nMonica Geller: light-colored cardigan - brown top - dark, shoulder-length hair - serious expression\nRachel Green: light-colored cardigan - brown top - dark, shoulder-length hair - serious expression\nChandler Bing: dark, patterned sweater - dark pants - dark, short hair - concerned expression\nUnidentified person: light-colored top - dark pants - short, curly hair - concerned expression\nUnidentified person: light-colored top - dark pants - short, curly hair - concerned expression\nJoey Tribbiani: red sweater - dark pants - dark, short hair - relaxed expression\nChandler Bing: dark, patterned sweater - dark pants - dark, short hair - concerned expression\nRachel Green: light-colored cardigan - brown top - dark, shoulder-length hair - serious expression\nMonica Geller: light-colored cardigan - brown top - dark, shoulder-length hair - serious expression\nRoss Geller: brown jacket - light-colored shirt and tie - dark, short hair - concerned expression\nChandler Bing: dark, patterned sweater - dark pants - dark, short hair - concerned expression\nUnidentified person: light-colored top - dark pants - short, curly hair - concerned expression\nUnidentified person: light-colored top - dark pants - short, curly hair - concerned expression\nJoey Tribbiani: red sweater - dark pants - dark, short hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller enters the hospital room, visibly distressed, and speaks to the family. Monica Geller and Rachel Green stand nearby, looking concerned. Chandler Bing sits in a chair, appearing worried. The scene",
    "subtitles": "Uh, I'll go see. [HEART MONITOR BEEPING] This almost never happens. [HEART MONITOR STOPS] Now she's passed. I just have to know, okay? Is it my hair? Yes, Chandler, that's exactly what it is. It's your hair. Yeah, you have homosexual hair. RACHEL: Hey. MONICA: Hi. RACHEL: So did she? Twice. Oh, that sucks.",
    "episode": "1x08 - The One Where Nana Dies Twice",
    "chunk": "chunk_00007",
    "start_chunk": "00:06:00.777",
    "end_chunk": "00:07:00.502"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with neon signs visible.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light blue shirt - dark pants - short, dark hair - concerned expression\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - serious expression\nChandler Bing: light-colored shirt - dark vest - dark pants - short, brown hair - relaxed expression\nPhoebe Buffay: white vest with graphics - dark long-sleeved shirt - long blonde hair - animated expression\nRachel Green: light gray cardigan - brown top - dark, shoulder-length hair - calm expression\nJoey Tribbiani: dark-colored shirt - dark pants - short, dark hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Monica sit on a couch, looking concerned as they listen to Phoebe, who is animatedly talking and gesturing with her hands. Chandler sits beside Phoebe, leaning back with his arms crossed, appearing relaxed and amused. Rachel stands nearby, holding a coffee mug, listening intently. Joey enters from the background, holding a sandwich, and walks toward the couch area. Monica approaches the couch, leans over Phoebe, and appears to comfort her while speaking.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: blue (held by Ross and Monica)\n- Orange couch (center of frame)\n- Wooden table (with various items)\n- Bar stools (in background)\n- Menu board (behind counter)\n- Sandwich (held by",
    "subtitles": "Oh, that sucks. You guys okay? I don't know. It's weird. I know she's gone, but I just don't feel, uh... Maybe that's because she's not really gone. No, no, she's gone. We checked. A lot. No, I mean, maybe no one ever really goes. Ever since my mom died, every now and then... ...I get this feeling that she's, like, right here, you know? Oh. And Debbie, my best friend from junior high... ...got struck by lightning on a miniature golf course. I always get this strong Debbie vibe... ...whenever I use one of those little yellow pencils. I miss her. Aw. Here, Pheebs. Want this? - Oh, thanks. - Sure. I just sharpened her this morning.",
    "episode": "1x08 - The One Where Nana Dies Twice",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:58.835",
    "end_chunk": "00:07:59.519"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and brick wall decor.\n\n### **CHARACTERS PRESENT:**\n- Monica Geller: dark-colored sweater - floral skirt - dark, shoulder-length hair - focused expression\n- Phoebe Buffay: white patterned top - dark pants - blonde, shoulder-length hair - smiling\n- Chandler Bing: orange ribbed sweater - unclear lower clothing - dark, styled hair - concerned expression\n- Ross Geller: light-colored shirt - dark vest and tie - dark, short hair - serious expression\n- Rachel Green: dark top - denim overalls - brown, shoulder-length hair - animated expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands near the couch, adjusting her overalls while talking to Phoebe, who is seated and smiling. Chandler sits at the table, reading a newspaper and reacting with concern and gestures. Ross sits on the couch, holding a mug and listening to the conversation. Rachel stands behind the couch, interacting with Monica and Phoebe. The group appears engaged in a serious discussion, with Monica and Rachel gesturing as they speak.\n\n### **OBJECTS AND PROPS:**\n- Newspaper: held by Chandler (on table)\n- Coffee mug: blue (held by Ross)\n- Orange couch: center of frame\n- Brick wall decor: background\n- Wooden table: with various items\n- Lamp: warm lighting (on table)\n\n### **DIALOGUE CONTEXT:**\nChandler discusses the topic of death with the group, expressing concern and disbelief. The conversation has a serious tone, with Chandler appearing worried and Monica and Rachel reacting with animated gestures and expressions. Ross listens intently, appearing serious and concerned.\n\n### **TEMPORAL NOTES:**\n- Monica moves from standing to adjusting her overalls\n- Phoebe shifts position while seated\n- Chandler gestures while reading the newspaper\n- Ross holds and drinks from his mug\n",
    "subtitles": "See, I don't believe any of that. I think when you're dead... ...you're dead. You're gone. You're worm food. So Chandler looks gay, huh? I don't know who this is, but it's not Debbie. I thought it'd be a closed casket. Well, that doesn't mean she can't look nice. Sweetie, you think you can get in there? I don't see why not.",
    "episode": "1x08 - The One Where Nana Dies Twice",
    "chunk": "chunk_00009",
    "start_chunk": "00:08:01.814",
    "end_chunk": "00:08:43.188"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s bedroom — daytime, natural light from window\nThe room has pink walls, a wooden bed with a quilt, and a wooden cabinet. A framed painting hangs on the wall.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - smiling\nRoss Geller: dark-colored shirt - light-colored pants - dark, curly hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller is sitting in a chair, talking animatedly to Monica Geller, who is seated across from him. Monica listens, smiling and nodding, occasionally responding. Ross gestures with his hands as he speaks. The conversation appears to be serious but with moments of levity.\n\n### **OBJECTS AND PROPS:**\n- Wooden table (between characters)\n- Framed picture (on wall behind Ross)\n- Quilted bedspread (on bed)\n- Lamp (on side table)\n- Books (stacked on table)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses his wish to be buried at sea after death with Monica Geller. The conversation has a serious yet slightly humorous tone, with Ross appearing earnest and Monica reacting with a mix of concern and amusement.\n\n### **TEMPORAL NOTES:**\nRoss Geller stands up and moves to the cabinet to retrieve something.\nMonica Geller turns to face Ross as he speaks.\nRoss Geller sits back down after retrieving the item.",
    "subtitles": "ROSS: Here's my retainer. I was just thinking... ...when my time comes... - Dad. Listen to me. When my time comes, I wanna be buried at sea. You what? I wanna be buried at sea. It looks like fun. Define \"fun.\" Come on. You'll make a day of it. You'll get a boat, pack a lunch... And then we throw your body in the water. Gee, that does sound fun. Everyone thinks they know me. Everyone says, \"Jack Geller, so predictable.\" Maybe after I'm gone, they'll say, \"Buried at sea? Huh.\" That's probably what they'll say.",
    "episode": "1x08 - The One Where Nana Dies Twice",
    "chunk": "chunk_00010",
    "start_chunk": "00:09:02.375",
    "end_chunk": "00:09:59.723"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes begin in a hospital waiting room and patient room during the daytime, then transition to Central Perk coffee shop in the evening, and conclude in Monica's apartment living room and bedroom, also in the evening and daytime respectively.\n\n**KEY CHARACTERS**\n- **Monica Geller:** Concerned, serious, and supportive throughout.\n- **Ross Geller:** Anxious and distressed in the hospital, later serious and earnest in discussions about death.\n- **Joey Tribbiani:** Concerned in the hospital, later relaxed and amused.\n- **Chandler Bing:** Worried and concerned, engaging in a serious discussion about death.\n- **Rachel Green:** Concerned and serious, later animated.\n- **Phoebe Buffay:** Animated and animatedly sharing something, later smiling.\n- **Nana:** The elderly patient in the hospital, whose condition is a cause of concern.\n\n**MERGED NARRATIVE SUMMARY**\nThe group is gathered at the hospital, where Monica and Ross are with their grandmother, Nana, who is in the CCU/ICU. Ross is anxious and explaining Nana's condition, causing concern among Monica and Joey. The scene shifts to a hospital hallway and then to Central Perk, where the friends are discussing Nana's situation. Later, in Monica's apartment, Chandler initiates a serious conversation about death, which concerns the group. The focus then shifts to a private conversation between Ross and Monica in her bedroom, where Ross shares his unusual wish to be buried at sea.\n\n**IMPORTANT CONTEXT OR THEMES**\n- **Family Concern and Illness:** The initial scenes highlight the group's concern for Nana's critical condition in the hospital.\n- **Coping with Mortality:** The narrative progresses to a more philosophical discussion about death and end-of-life wishes, initiated by Chandler and further explored by Ross.\n- **Emotional Support and Friendship:** The friends offer support to each other through difficult and sensitive conversations.\n- **Transition to Lighter/More Personal Topics:** After the initial hospital tension and the broad discussion on death, the focus narrows to Ross's individual, slightly morbid but earnest wish, creating a shift in tone."
}