{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm interior lighting with stage spotlights\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: purple long-sleeved top - green skirt - long, curly blonde hair - smiling, animated\nRachel Green: denim jacket - dark skirt - dark, shoulder-length hair - arms crossed, expression neutral\nMonica Geller: light-colored sweater - dark pants - dark, tied-back hair - smiling, attentive\nChandler Bing: dark leather jacket - red shirt - short, dark hair - smiling, leaning forward\nRoss Geller: light-colored shirt - dark pants - short, dark hair - expression neutral, listening\nJoey Tribbiani: dark jacket - white shirt - short, dark hair - expression neutral, seated\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay stands at the microphone, playing an acoustic guitar and singing to an audience. Rachel Green stands nearby, arms crossed, watching Phoebe. Monica Geller sits on a couch, smiling and watching the performance. Chandler Bing leans forward, smiling at Phoebe. Ross Geller sits beside Monica, listening attentively. Joey Tribbiani sits nearby, observing the scene. The group appears engaged and entertained by Phoebe's performance.\n\n### **OBJECTS AND PROPS:**\n- Acoustic guitar: light wood finish (being played by Phoebe)\n- Microphone: on stand (in front of Phoebe)\n- Central Perk sign: visible in background\n- Coffee mugs: various colors (on tables)\n- Orange couch: center of frame\n- Brick wall decor: background\n\n### **DIALOGUE CONTEXT:**\nPhoebe Buffay discusses a song about realizing what life is really all about with the audience. The conversation has a casual, musical tone, with Phoebe appearing animated and enthusiastic, and the listeners reacting by smiling and clapping.\n\n### **TEMPORAL NOTES:**\nScene begins with Phoebe performing on stage\nRachel Green stands near the stage, arms crossed\nMonica Geller sits on the couch, smiling\nChandler Bing leans forward, smiling\nRoss Geller sits beside Monica, listening\nJoey Tribbiani sits nearby, observing\nAudience claps after Phoebe finishes singing",
    "subtitles": "Everybody. Shh. Uh, Central Perk is proud to present... ...the music of Miss Phoebe Buffay. PHOEBE: Thanks. Hi. Um, I wanna start with a song that's about that moment... ...when you suddenly realize what life is really all about. Okay, here we go. Okay. Thank you very much. CHANDLER: What...? Oh, great. This is just...",
    "episode": "1x07 - The One With The Blackout",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:02.043",
    "end_chunk": "00:00:45.544"
  },
  "chunk_2": {
    "caption": "**SCENE SETTING:**\nMonica’s apartment living room — evening, dim lighting with candles and lamps\nThe room is furnished with an orange couch, a wooden coffee table, and a brick wall with decor. The scene transitions to an outdoor fountain at night, then to a dark city skyline.\n\n**CHARACTERS PRESENT:**\nRachel Green: light-colored top - dark pants - long, wavy brown hair - smiling\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated\nPhoebe Buffay: dark top - dark pants - dark, curly hair - smiling\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smiling\nJoey Tribbiani: dark shirt - dark pants - short, brown hair - smiling\nRoss Geller: dark shirt - dark pants - short, dark hair - serious\nDavid Schwimmer: dark shirt - dark pants - short, dark hair - serious\n\n**ACTIONS AND INTERACTIONS:**\nThe group is gathered in Monica’s apartment, reacting with excitement to a city-wide blackout. Rachel stands holding a tray, smiling. Monica gestures animatedly while talking on the phone. Phoebe lies on the floor, sipping from a straw. Chandler and Joey sit on the couch, smiling and talking. Ross stands near the doorway, looking concerned. David Schwimmer stands near the couch, looking serious. The group moves to the outdoor fountain, then to a dark city skyline.\n\n**OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden coffee table (center)\n- Brick wall decor (background)\n- Candles (on table)\n- Fountain (outdoor)\n- City skyline (background)\n\n**DIALOGUE CONTEXT:**\nRachel discusses the blackout with the group. The conversation has a casual tone, with Rachel appearing excited and Monica reacting by gesturing animatedly. The group is reacting to the blackout, with some members appearing concerned and others smiling.\n\n**TEMPORAL NOTES:**\nScene begins with all characters seated\nRachel stands up and holds a tray\nMonica gestures animatedly while talking on the phone\nPhoebe lies on the floor, sipping from a straw\nChandler and Joey sit on the couch, smiling and talking\nRoss stands near the doorway, looking concerned\nDavid Schwimmer stands near the couch, looking serious\nThe group moves to the outdoor fountain\nThe scene transitions to a dark city skyline",
    "subtitles": "This is so cool, you guys. The entire city's blacked out. Mom says it's Manhattan, Brooklyn and Queens... ...and doesn't know when it'll be back on. PHOEBE: Wow. RACHEL: You guys, this is big. Pants and a sweater. Why, Mom? Who will I meet in a blackout? Power-company guys? Eligible looters?",
    "episode": "1x07 - The One With The Blackout",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:42.143",
    "end_chunk": "00:02:02.704"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — nighttime, dim lighting with candles and warm lamps\n\n### **CHARACTERS PRESENT:**\nMonica Geller: light-colored sweater - dark pants - dark, shoulder-length hair - concerned expression\nRachel Green: dark-colored top - dark pants - long, wavy brown hair - smiling expression\nRoss Geller: light-colored turtleneck sweater - dark pants - short, dark hair - serious expression\nPhoebe Buffay: red long-sleeved top - dark pants - blonde, shoulder-length hair - serious expression\nChandler Bing: dark jacket over light shirt - dark pants - short, dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Rachel are in the kitchen, talking and gesturing while holding candles. Ross is seen in the background, also holding a candle. Phoebe is in a bank vestibule, talking on her phone while leaning against a counter. Chandler is standing in the bank vestibule, looking at Phoebe with a serious expression.\n\n### **OBJECTS AND PROPS:**\n- Candles: multiple, lit (on counter and table)\n- Phone: black, being held by Phoebe\n- ATM machines: two, visible in bank vestibule\n- Counter: light-colored, with a black bag on it\n- Posters: visible on wall behind Phoebe, including one that says \"Save a Person's Life\"\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses being trapped in a bank vestibule with Chandler Bing, who is also present. The conversation has a tense tone, with Phoebe appearing serious and Chandler looking concerned. Phoebe mentions being with \"some guy,\" while Chandler reacts with a serious expression.\n\n### **TEMPORAL NOTES:**\nPhoebe moves from standing to leaning against the counter while talking on the phone.\nChandler shifts his position slightly while looking at Phoebe.",
    "subtitles": "Power-company guys? Eligible looters? Can we talk about this later? Okay. Can I borrow the phone? I wanna call my apartment and check on my grandma. What's my number? I never call me. CHANDLER [THINKING]: Oh, my God. It's her. It's that Victoria Secret model. Something Goodacre. Hi, Mom, it's Jill. She's right. It's Jill. Jill Goodacre. Oh, my God. I am trapped in an ATM vestibule with Jill Goodacre. Is it a vestibule? Maybe it's an atrium? Yeah, that is the part to focus on, you idiot. Yeah, I'm fine. I'm just stuck at the bank in an ATM vestibule. Jill says vestibule... ...I'm going with vestibule. JILL: I'm fine. No, I'm not alone. I don't know. Some guy. Oh, some guy. I am some guy.",
    "episode": "1x07 - The One With The Blackout",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:59.327",
    "end_chunk": "00:03:02.181"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nA dimly lit bank lobby during nighttime, with artificial lighting. The scene transitions to a dark apartment interior, also lit by candles, suggesting a blackout.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored coat - light-colored pants - dark, short hair - smiling expression\nRachel Green: red top - dark pants - long, brown hair - concerned expression\nJoey Tribbiani: red t-shirt - jeans - dark, short hair - animated expression\nRoss Geller: light-colored sweater - dark pants - brown, short hair - serious expression\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - concerned expression\nPhoebe Buffay: purple top - patterned dress - long, blonde hair - animated expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler enters a bank, smiling, and interacts with a woman in a red top. The scene shifts to an apartment where Joey, holding a lit menorah, enters and gestures dramatically. Ross and Monica stand nearby, looking on. Phoebe and Rachel react with concern and amusement. Joey continues to gesture while holding the menorah, and Ross bends down to adjust something near a guitar. The group gathers around a window, looking out with expressions of surprise and concern.\n\n### **OBJECTS AND PROPS:**\n- Menorah: lit candles (held by Joey)\n- Guitar: on a chair (near Ross)\n- Candles: multiple lit candles (on tables and in the room)\n- Bank teller machine: visible in the bank lobby\n- Bank posters: visible on the wall\n- Window: with a grid pattern, showing the group looking out\n\n### **DIALOGUE CONTEXT:**\nJoey discusses officiating a Hanukkah ceremony during a blackout with the group. The conversation has a joking tone, with Joey appearing animated and the others reacting with concern and amusement. The group seems to be reacting to the situation with a mix of humor and surprise.\n\n### **TEMPORAL NOTES:**\nChandler enters the bank lobby\nJoey enters the apartment holding a menorah\nRoss bends down near the guitar\nThe group gathers around the window",
    "subtitles": "Oh, some guy. I am some guy. Hey, Jill, I saw you with some guy last night. Yes, he was some guy. JOEY: Hey, everyone. Officiating at tonight's blackout is Rabbi Tribbiani. Chandler's old roommate was Jewish, and these are the only candles we have... ...so happy Hanukkah. PHOEBE: Ooh, look. Ugly Naked Guy lit a bunch of candles. ALL: Ooh. Oh! Ooh. That had to hurt. CHANDLER [THINKING]: All right, all right. It's been 14 and a half minutes... ...and you still haven't said one word. Oh, God.",
    "episode": "1x07 - The One With The Blackout",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:57.969",
    "end_chunk": "00:04:00.697"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nEmerson Bank ATM vestibule — nighttime, dim artificial lighting\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored coat - light-colored shirt - brown, medium-length hair - expression shifts from concerned to amused\nUnidentified person: red long-sleeved top - dark pants - blonde, shoulder-length hair - expression shifts from neutral to annoyed\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing stands near an ATM, initially looking concerned while talking on the phone, then smiles as he interacts with the woman at the counter. The woman, standing behind the counter, appears annoyed and gestures with her hands while speaking. Chandler eventually walks away from the counter, still on the phone, while the woman watches him leave.\n\n### **OBJECTS AND PROPS:**\n- ATM machine (left side of frame)\n- Counter with papers and brochures (right side)\n- Phone (held by Chandler)\n- Black purse (on counter, next to woman)\n- \"DAY & NIGHT TELLER\" sign (above ATM)\n- \"Emerson Bank\" sign (on display case)\n\n### **DIALOGUE CONTEXT:**\nChandler Bing discusses being stuck in an ATM vestibule with a woman named Jill Goodacre with someone on the phone. The conversation has a humorous, slightly exasperated tone, with Chandler appearing amused and the listener (off-screen) reacting with disbelief or concern.\n\n### **TEMPORAL NOTES:**\nChandler Bing walks away from the counter after ending his phone call.\nThe woman at the counter turns and watches Chandler leave.",
    "subtitles": "...and you still haven't said one word. Oh, God. Do something. Just make contact. Smile. There you go. You're definitely scaring her. Uh, would you like to call somebody? Yeah, about 300 guys I went to high school with. Yeah, thanks. [PHONE RINGS] Hello? - It's me. - It's Chandler. Are you okay? Yeah, I'm fine. [MUMBLING] I'm stuck in an ATM vestibule... ...with Jill Goodacre. What? [MUMBLING] I'm stuck... ...in an ATM vestibule... ...with Jill Goodacre. I have no idea what you said.",
    "episode": "1x07 - The One With The Blackout",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:57.904",
    "end_chunk": "00:05:00.632"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in the familiar Central Perk coffee shop in the evening and then shift to Monica's apartment, also in the evening. Later, the setting transitions to a dimly lit bank lobby and then back to a dark apartment interior, all within the context of a city-wide blackout.\n\n**KEY CHARACTERS**\nThe main group of friends – Monica, Rachel, Phoebe, Chandler, Ross, and Joey – are central to the narrative. David Schwimmer is also present in one scene. A bank teller (Jill Goodacre) appears in a later scene.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens with Phoebe performing a song at Central Perk, with her friends gathered and enjoying the show. The scene then transitions to Monica's apartment where the friends react with excitement to a city-wide blackout. They observe the blackout from Monica's apartment, with some members of the group expressing concern while others seem amused. The narrative then splits: Chandler is shown in a bank vestibule, interacting with a bank teller named Jill Goodacre, while the rest of the group is back in the apartment. In the apartment, Joey arrives holding a menorah and discusses officiating a Hanukkah ceremony during the blackout. The group gathers by a window, reacting to the outside situation with surprise and concern.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Chandler's humorous and slightly flustered interaction with Jill Goodacre in the bank vestibule provides a comedic subplot.\n*   **Emotional Tone:** The initial mood is one of lighthearted entertainment, shifting to excitement and amusement at the blackout, then to a mix of concern, humor, and mild exasperation as the blackout's effects become more apparent and individual situations arise.\n*   **Plot Setup:** The city-wide blackout serves as the central disruptive event, leading to various individual challenges and interactions among the friends. Joey's mention of officiating a Hanukkah ceremony sets up a potential event during the blackout.\n*   **Notable Transitions:** The scene transitions from the public space of Central Perk to the private setting of Monica's apartment, then to the unexpected confinement of a bank vestibule for Chandler, and back to the apartment where the group collectively observes the blackout's impact."
}