{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nThe hallway outside apartment 200 — daytime, warm artificial lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit jacket - light blue shirt - dark tie - dark, short hair - serious, concerned expression\nChandler Bing: striped robe over white t-shirt - dark pants - brown, medium-length hair - animated, expressive expression\nJoey Tribbiani: blue t-shirt - dark pants - brown, medium-length hair - surprised, concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler stand in the hallway, engaged in an animated conversation. Chandler gestures with his hands while speaking, and Ross responds with hand gestures and facial expressions. Joey enters from the apartment doorway holding a newspaper, joins the conversation, and then walks away. Chandler crosses his arms and listens to Ross, who appears to be explaining something with a serious expression.\n\n### **OBJECTS AND PROPS:**\n- Newspaper: white, held by Joey (in hand)\n- Door: green, with number 200 visible\n- Radiator: silver, visible against wall\n- Kitchen area: visible through doorway, with white stove and cabinets\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a social faux pas with Chandler, specifically about not kissing a friend's mom, while Joey enters and reacts to the conversation. The tone is casual and slightly humorous, with Ross appearing serious and Chandler animated. Joey reacts with surprise and concern as he enters the scene.\n\n### **TEMPORAL NOTES:**\nJoey enters the frame from the apartment doorway\nJoey walks away from the group after entering\nRoss and Chandler continue their conversation while standing in the hallway",
    "subtitles": "You broke the code. - What code? - You don't kiss your friend's mom. Sisters are okay. Maybe a hot-looking aunt. But not a mom. Never a mom. [ALL SHOUTING] What are you guys doing out here? Uh, well, Joey and I had discussed getting in an early morning racquetball game. But, um, apparently somebody overslept. Yeah, well, you don't have your racquet. No. No, I don't, because it's being restrung. Ahem. Somebody was supposed to bring me one. Yeah. Well, you didn't call and leave your grip size. Okay, you guys are spending way too much time together. Okay, I'm scum. I'm scum. - Ross, how could you let this happen? - I don't know. Well, it's not like she's a regular mom. You know? She's sexy. She's... You don't think my mom's sexy? Well, not in the same way.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00011",
    "start_chunk": "00:10:02.351",
    "end_chunk": "00:11:02.535"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nApartment hallway — daytime, warm artificial lighting with natural light filtering through blinds.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit jacket - light blue shirt - striped tie - dark, short hair - serious expression\nJoey Tribbiani: striped robe over white tank top - red belt - dark, medium-length hair - animated expression\nRachel Green: patterned robe over black top - hair tied up - concerned expression\nUnidentified person: patterned shirt with leather jacket - dark, curly hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands in the hallway, gesturing while speaking to Joey Tribbiani, who is wearing a robe and appears surprised. Rachel Green and an unidentified person enter from a doorway, standing near the stairs. Rachel looks concerned as the unidentified person places a hand on her shoulder. Joey turns and walks into his apartment, entering through a blue door. Ross follows him into the apartment, holding a bottle.\n\n### **OBJECTS AND PROPS:**\n- Blue apartment door (with gold number 19)\n- Green hallway door (with gold number 20)\n- Wooden staircase\n- Blue kitchen cabinets\n- Copper pots hanging on wall\n- Decorative shelves with various items\n- Window with blinds\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses a topic with Joey Tribbiani, who is wearing a robe and appears surprised. The conversation has a casual tone, with Ross appearing serious and Joey reacting with animated expressions. Rachel Green and an unidentified person enter the scene, with Rachel looking concerned as the unidentified person places a hand on her shoulder.\n\n### **TEMPORAL NOTES:**\nJoey Tribbiani enters his apartment through the blue door.\nRoss Geller follows Joey into the apartment, holding a bottle.",
    "subtitles": "Well, not in the same way. I'll have you know that Gloria Tribbiani... ...was a handsome woman in her day, all right? You think it's easy giving birth to seven children? Huh? Okay, I think we're getting into a weird area here. - Aah. - Hey. - Hey. - What are you guys doing out here? Well, ha, ha, not playing racquetball. - He forgot to leave his grip size. - He didn't get the goggles. Oh. Right. Well, sounds like you two have issues. Goodbye, baby. [SPEAKING IN ITALIAN] Do they wait for me to do this? - So are you gonna tell him? - I'm not gonna tell him. - Why would I tell him? - How about, because if you don't... ...his mother might? - Hmm. What are you guys doing here? Uh, he's not even wearing a jock strap.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:59.909",
    "end_chunk": "00:12:01.845"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, bright artificial lighting\nThe setting is a hospital room with medical equipment visible, including an EKG monitor and IV stand. A hospital bed is central, with a potted plant and a small table nearby.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored cardigan with colorful stripes - unclear lower clothing - blonde hair in two braids - expression shifts from concerned to animated\nRachel Green: black top with red scarf - unclear lower clothing - dark, shoulder-length hair - expression shifts from smiling to serious\nUnidentified person: lying in hospital bed, covered by light blue blanket - hair visible, appears to be male - expression: resting, eyes closed\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe stands by the bed, initially touching the patient's forehead, then gesturing while speaking. Rachel enters holding balloons and a card, approaches the bed, and touches the patient's head. The two women converse, with Phoebe appearing animated and Rachel listening, then speaking with a serious expression. The patient remains still in bed throughout.\n\n### **OBJECTS AND PROPS:**\n- Balloons: multicolored (yellow, blue, purple) held by Rachel\n- EKG monitor: displaying heartbeat (on wall)\n- IV stand: with fluid bag (near bed)\n- Potted plant: green, near the bed\n- Small table: with a red object (possibly a card or box) on it\n- Hospital bed: light blue blanket covering patient\n\n### **DIALOGUE CONTEXT:**\nRachel discusses the patient's condition with Phoebe, asking if he's doing better. Phoebe responds that she doesn't know, as she wasn't there. The conversation has a concerned tone, with Rachel appearing serious and Phoebe animated as she speaks.\n\n### **TEMPORAL NOTES:**\nRachel enters the room from the doorway holding balloons.\nPhoebe moves from touching the patient's forehead to gesturing while speaking.\nRachel moves from holding balloons to touching the patient's head.",
    "subtitles": "Uh, he's not even wearing a jock strap. What did I ask? [EKG BEEPING] - Hi. - Hi. What are you doing here? Nothing. I just thought I'd stop by, you know, after the, ahem... That I, you know. Um, so, what are you doing here? I'm not really here. I just thought I'd drop these off on the way. My way. Do you, um, come here a lot... ...without me? No, no, no. So, um, do you think he's doing any better than he was this morning? How would I know? I wasn't here.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00013",
    "start_chunk": "00:11:58.718",
    "end_chunk": "00:13:00.320"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, warm indoor lighting\nThe scene features a living room with a brown leather chair, a television, a bookshelf, and a kitchen area visible in the background. Decor includes a poster on the wall and a clown-faced mug on a counter.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - concerned expression\nPhoebe Buffay: green and red striped sweater - unclear lower clothing - blonde, braided hair - serious expression\nChandler Bing: light-colored shirt - dark vest - light blue jeans - dark, medium-length hair - animated expression\nRoss Geller: dark suit - light shirt - striped tie - dark, short hair - serious expression\nJoey Tribbiani: striped sweater - unclear lower clothing - dark, medium-length hair - surprised expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Phoebe stand near a bed, appearing concerned as they talk. Chandler sits in a leather chair, animatedly talking to Ross, who stands and gestures while speaking. Joey enters the room, holding a piece of bread, and joins the conversation, looking surprised. The group is engaged in a tense discussion about a personal matter involving Chandler and Ross.\n\n### **OBJECTS AND PROPS:**\n- Bed: with blue sheets (in background)\n- Brown leather chair: where Chandler sits\n- Television: on stand in background\n- Bookshelf: with books and DVDs\n- Clown-faced mug: on counter\n- Red boxing gloves: hanging on wall\n- Poster: \"Las Aysteres de New York\" on wall\n- Sandwich: in Joey’s hand\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses Chandler Bing’s actions with Monica Geller and Phoebe Buffay. The conversation has a tense tone, with Ross appearing serious and Chandler animatedly defending himself. Monica and Phoebe react with concern, while Joey enters and appears surprised by the situation.\n\n### **TEMPORAL NOTES:**\n- Joey Tribbiani enters the frame from the kitchen area\n- Chandler Bing stands up from his chair and walks toward Ross Geller\n- Ross Geller moves from standing to gesturing while speaking\n- Joey Tribbiani sets down the sandwich he was holding",
    "subtitles": "How would I know? I wasn't here. Really? Not even to, um, change his pajamas? Oh, my God. You're my friend. I had to tell you. I can't believe it. Paolo kissed my mom? Yeah, I mean, I don't know if you noticed, but he had a lot to drink. I mean, you know how he gets when he's drunk... I can't do this. I did it. It was me. I'm sorry. I kissed your mom. What? I was really upset about Rachel and Paolo and I think I had too much tequila... ...and Nora... Mrs. Mom, your Bing, was... She was just being nice, you know? But nothing happened. Nothing. Ask Joey. Joey came in... - You knew about this? - Uh... You know, knowledge is a tricky thing. I spent the entire day with you. Why didn't you tell me? Hey, hey. You're lucky I caught them when I did... ...or else who knows what would've happened? Thanks, man. Big help.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:57.777",
    "end_chunk": "00:13:59.838"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, warm indoor lighting with natural light from windows.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - light-colored shirt - dark hair - serious expression\nChandler Bing: striped sweater - light-colored pants - dark hair - animated expression\nJoey Tribbiani: striped sweater - light-colored pants - dark hair - surprised expression\nRachel Green: denim vest over dark top - shoulder-length brown hair - smiling expression\nMonica Geller: dark-colored top - dark hair - concerned expression\nPhoebe Buffay: dark-colored top - blonde hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands in the living room, gesturing and speaking animatedly to Chandler Bing, who reacts with surprise and gestures back. Joey Tribbiani enters from the kitchen area, looking shocked, and then exits the room. Rachel Green and Monica Geller are seated at a table in a restaurant, looking at a menu together, with Rachel writing something down. Phoebe Buffay enters the scene holding a guitar and begins to play.\n\n### **OBJECTS AND PROPS:**\n- Menu board: brown (on table)\n- Guitar: wooden (being played)\n- Coffee mugs: various colors (on table)\n- Refrigerator: white (in kitchen)\n- Posters: various (on walls)\n- Chairs: brown leather (in living room)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses a situation with Chandler Bing, expressing frustration and disbelief. The conversation has a tense tone, with Ross appearing serious and Chandler reacting with surprise. Rachel Green and Monica Geller are discussing a menu item, with Rachel appearing focused and Monica looking concerned.\n\n### **TEMPORAL NOTES:**\nJoey Tribbiani enters the living room from the kitchen area.\nJoey Tribbiani exits the living room.\nRachel Green and Monica Geller move to a restaurant setting.\nPhoebe Buffay enters the restaurant scene holding a guitar.",
    "subtitles": "I can't believe this. What the hell were you thinking? I wasn't. I don't know. I... Of all my friends, no one knows the crap I go through with my mom more than you. - I know. - I can't believe you did this. - Me neither. - I'm mad at you for not telling me. - What are you mad at me...? - Let me slam the door. Chandler, I didn't kiss her. He did. See what happens when you break the code? - Joey. - Aah! Uh. - Rach. - Hey. \"A Woman Undone. By Rachel Karen Green.\" Yeah, I thought I'd give it a shot. I'm still on the first chapter. Now, do you think his \"love stick\" can be \"liberated from its denim prison\"? Yeah, I'd say so. And there's no \"J\" in \"engorged.\" - Hey, Rach. - Hey. - Hello. - Hello. - You going to the hospital tonight? - No. You?",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00015",
    "start_chunk": "00:14:00.297",
    "end_chunk": "00:15:02.275"
  },
  "summary": "**SCENE OVERVIEW**\nThe episode begins in the hallway outside apartments, transitions to inside an apartment, then to a hospital room, and finally settles in Monica's apartment living room, with a brief shift to a restaurant setting within the final chunk.\n\n**KEY CHARACTERS**\n- **Ross Geller:** Appears serious and concerned, often explaining or discussing situations.\n- **Chandler Bing:** Animated and expressive, involved in conversations and discussions, sometimes defending himself.\n- **Joey Tribbiani:** Initially surprised and concerned, then animated, and later shocked.\n- **Rachel Green:** Concerned, then smiling, and later seated at a restaurant table.\n- **Monica Geller:** Concerned, and later seated at a restaurant table.\n- **Phoebe Buffay:** Appears concerned and animated, later serious, and then smiling while playing guitar.\n- **Unidentified Person:** Present in the hospital room, lying in bed.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative opens with Ross and Chandler discussing a social faux pas concerning not kissing a friend's mom, with Joey briefly joining the conversation before heading into his apartment. Ross follows Joey inside his apartment. The scene then shifts to a hospital room where Phoebe and Rachel are concerned about a patient, discussing his condition. Following this, the focus returns to Monica's apartment, where a tense discussion unfolds among Ross, Chandler, Monica, and Phoebe regarding a personal matter involving Chandler and Ross. Joey enters, surprised by the situation. Later, in the same apartment, Ross and Chandler are having a heated conversation, with Joey entering and then exiting. Simultaneously, Rachel and Monica are shown at a restaurant looking at a menu, and Phoebe enters the restaurant scene with a guitar to play.\n\n**IMPORTANT CONTEXT OR THEMES**\n- **Relationship Developments:** Hints of a strained personal matter between Ross and Chandler emerge, leading to tense discussions involving Monica and Phoebe.\n- **Emotional Tone:** The episode shifts between casual humor, concern (at the hospital), and tension (during arguments).\n- **Plot Setup or Payoff:** The initial conversation about a social faux pas sets a light tone, while the later tense discussions in Monica's apartment suggest a more significant interpersonal conflict is developing. The hospital scene provides a separate, parallel storyline.\n- **Notable Transitions:** A significant transition occurs from the apartment hallway and hospital to Monica's apartment, where multiple conversations and storylines appear to converge or run in parallel. The final chunk also introduces a brief, seemingly disconnected scene with Rachel and Monica at a restaurant and Phoebe playing guitar, potentially setting up future interactions."
}