{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA dimly lit apartment hallway — evening — warm, artificial lighting from wall sconces.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark-colored coat over a red shirt - dark pants - dark, medium-length hair - serious expression\nRoss Geller: dark-colored coat over a striped shirt - dark pants - short, dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nJoey stands in the hallway, initially looking toward the door, then turns to confront Ross. Ross enters from a doorway, and the two engage in an animated, tense conversation, gesturing with their hands. Joey appears defensive and agitated, while Ross speaks emphatically, placing a hand on Joey's shoulder as they stand near the door.\n\n### **OBJECTS AND PROPS:**\n- Wall sconce: lit (on wall)\n- Radiator: metallic (in foreground)\n- Door: dark green (with doorknob visible)\n- Blinds: on window (in background)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a confrontation with Joey's mother, referencing a heated exchange about maturity and a bomb threat. The conversation has a tense, serious tone, with Ross appearing concerned and Joey reacting with defensive agitation.\n\n### **TEMPORAL NOTES:**\nJoey moves from standing near the door to facing Ross directly.\nRoss enters the hallway from a doorway.\nRoss places his hand on Joey's shoulder during their conversation.",
    "subtitles": "- Are we okay now? - Yeah. No. No. Ah, the forbidden love of a man and his door. Shh. He did it. He told her off. And not just about the kiss, about everything. - You're kidding? - No. He said, \"When are you gonna grow up and start being a mom?\" - Wow. - Wait, then she came back with: \"The question is, when are you gonna grow up and realize I have a bomb?\" Okay, wait. Are you sure she didn't say: \"When are you gonna grow up and realize I am your mom?\" - That makes more sense. - You think? Yeah. So, what's going on now? I don't know. I've been standing here spelling it out for you. I don't hear anything. Wait, wait, wait. What do you see? It's hard to tell. They're so tiny and upside down. Wait, wait, wait. They're walking away. They're walking away.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00021",
    "start_chunk": "00:20:00.699",
    "end_chunk": "00:21:03.386"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nAn apartment hallway — evening, warm artificial lighting from wall sconces.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored coat over a red shirt - blue jeans - dark, short hair - expression shifts from concerned to amused\nChandler Bing: orange button-up shirt with patterned tie - dark pants - brown, medium-length hair - expression shifts from serious to smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler are standing in a hallway, initially interacting near a door. Ross gestures and speaks animatedly while Chandler listens. Chandler then turns and walks toward the hallway, where Ross follows. Ross then turns to face Chandler, who is now standing near a doorway. They engage in a conversation, with Ross gesturing and Chandler responding with a smile. Ross places his hand on Chandler's shoulder during their interaction.\n\n### **OBJECTS AND PROPS:**\n- Wall sconces (on wall)\n- Radiator (in hallway)\n- Door (green, with brass handle)\n- Kitchen doorway (visible behind Chandler)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a recent interaction with Chandler's mother with Chandler. The conversation has a joking tone, with Ross appearing amused and Chandler reacting with a smile. Ross mentions that the interaction went \"awful\" but that he feels \"pretty good\" about it.\n\n### **TEMPORAL NOTES:**\nRoss walks away from the door and then turns back to face Chandler.\nChandler walks toward the hallway and then turns to face Ross.\nRoss places his hand on Chandler's shoulder during their conversation.",
    "subtitles": "They're walking away. They're walking away. No, they're not. They're coming right at us. Run, run! You okay, kiddo? - Yeah, I'm okay. - All right. You be good. Drive safe. [CHUCKLES] - Mrs. Bing. - Mr. Geller. Hey. You mean that? Yeah, why not? - So I told her. - Oh. - How did it go? - Awful. Awful. Couldn't have gone worse. - Well, how do you feel? - Pretty good. I told her. Well, see? So maybe it wasn't such a bad idea, you know, me kissing your mom, huh? But we don't have to go down that road.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00022",
    "start_chunk": "00:20:59.967",
    "end_chunk": "00:21:58.024"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nThe friends' apartment living room — evening, warm ambient lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - long, wavy brown hair - smiling\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated\nChandler Bing: striped sweater - dark pants - short, brown hair - relaxed\nRoss Geller: light-colored shirt - dark pants - short, dark hair - serious\nJoey Tribbiani: orange shirt - dark pants - dark, wavy hair - smiling\nChandler Bing: light-colored shirt - dark pants - short, brown hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands in the center of the room, holding papers and speaking animatedly to the group. Monica, Chandler, Ross, and Joey are seated on couches and chairs, all holding papers and listening to Rachel. Chandler leans back in his chair with a relaxed expression, while Ross appears serious. Joey smiles and looks at Rachel. Rachel gestures with her hands as she speaks.\n\n### **OBJECTS AND PROPS:**\n- Wooden coffee table (center)\n- Red and white checkered couch (background)\n- Blue kitchen cabinets (visible in background)\n- Lamp (on table)\n- Papers (held by characters)\n- Books (on coffee table)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses a script with the group, asking for their honest opinions. The conversation has a casual, joking tone, with Rachel appearing animated and the others reacting with smiles and attentive listening.\n\n### **TEMPORAL NOTES:**\nRachel moves from standing to sitting on the couch.\nJoey shifts his position slightly while listening.",
    "subtitles": "Now, this is just the first chapter... ...and I want your absolute honest opinion. Okay? Oh, and on page two, he's not reaching for her \"heaving beasts.\" What's a \"niffle\"? You can usually find them on the heaving beasts. All right, all right, so I'm not a great typist. Wait, did you get to the part about his \"huge, throbbing pens\"? Tell you, you don't wanna be around when he starts writing with those. - All right, that's it. Give them back. GROUP: No.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00023",
    "start_chunk": "00:22:04.698",
    "end_chunk": "00:22:38.105"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in an apartment hallway and later in the friends' apartment living room during the evening. The scene shifts from the hallway to the living room.\n\n**KEY CHARACTERS**\n- **Joey Tribbiani:** Appears defensive and agitated, then later smiling and attentive.\n- **Ross Geller:** Appears concerned, then amused and later serious.\n- **Chandler Bing:** Listens intently, then reacts with amusement and appears relaxed.\n- **Rachel Green:** Animated and seeking opinions.\n- **Monica Geller:** Animated and listening.\n\n**MERGED NARRATIVE SUMMARY**\nIn an apartment hallway, Ross confronts Joey about a tense conversation he had with Joey's mother regarding maturity and a bomb threat. The exchange is serious and animated, with Ross placing a hand on Joey's shoulder. Following this, Ross discusses an interaction with Chandler's mother, which he describes as \"awful\" but feels good about, leading to Chandler's amused reaction. The scene then shifts to the friends' apartment living room, where Rachel is animatedly discussing a script with Monica, Chandler, Ross, and Joey, seeking their honest opinions. The group is seated, holding papers, and listening attentively, with Joey smiling and Ross appearing serious, while Chandler remains relaxed.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Ross's interactions with both Joey's and Chandler's mothers reveal awkward or tense family dynamics.\n*   **Emotional Tone:** The narrative moves from tension and agitation in the hallway to a more casual and collaborative atmosphere in the living room.\n*   **Plot Setup:** Ross's conversations hint at potential comedic or dramatic situations involving the characters' parents.\n*   **Notable Transitions:** The primary transition is from an intense hallway conversation to a group discussion in the living room, marking a shift in focus from parental interactions to Rachel's script."
}