{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with decorative lamps and neon signs visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: denim vest - dark-colored top - brown, shoulder-length hair - smiling, engaged\nMonica Geller: dark-colored sweater - dark pants - dark, tied-back hair - serious, focused\nPhoebe Buffay: red vest - brown top - blonde, braided hair - smiling, performing\nChandler Bing: light-colored shirt - dark pants - short, brown hair - relaxed, attentive\nRoss Geller: dark leather jacket - patterned shirt - dark, styled hair - animated, talking\nUnidentified person: dark clothing - dark hair - unclear expression (background)\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay stands at a microphone, playing an acoustic guitar and singing to an audience. Rachel Green sits at the counter, writing in a notebook. Monica Geller stands beside her, observing. Ross Geller and Chandler Bing sit on the orange couch, engaged in conversation while Ross holds a card and Chandler reads a magazine. The camera shifts between the performers and the audience, capturing reactions and interactions.\n\n### **OBJECTS AND PROPS:**\n- Acoustic guitar: light wood finish (being played)\n- Microphone: on stand (in front of Phoebe)\n- Notebook: white paper (on counter, held by Rachel)\n- Magazine: dark cover (held by Chandler)\n- Orange couch: center of frame\n- Bar counter: with various items and a neon sign\n- Decorative lamps and framed art: on walls\n\n### **DIALOGUE CONTEXT:**\nPhoebe Buffay discusses a song about a man she recently met with the audience. The conversation has a casual, lighthearted tone, with Phoebe appearing enthusiastic and Rachel reacting with amusement. Ross and Chandler are engaged in their own conversation, seemingly unaware of the performance.\n\n### **TEMPORAL NOTES:**\nPhoebe Buffay begins singing and playing guitar.\nRachel Green shifts from writing to watching Phoebe.\nRoss Geller and Chandler Bing turn their attention to Phoebe’s performance.\nThe camera pans to show the audience’s reactions.",
    "subtitles": "- You going to the hospital tonight? - No. You? No. You? You just asked me. Okay, maybe it was a trick question. - Um, Rachel, can we do this now? - Okay. I am so hot. And here's a picture of my mother and father on their wedding day. Now, you tell me she's not a knockout. I cannot believe we're having this conversation. Come on, just try to picture her not pregnant. That's all. Central Perk is proud to present Miss Phoebe Buffay. [CROWD CHEERING] PHOEBE: Thanks. Hi. Um, ahem. Okay. I'd like to start with a song that's about a man I recently met... ...who's, um, come to be very important to me. Okay. [SINGING] You don't have to be awake To be my man",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:59.648",
    "end_chunk": "00:16:00.667"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm interior lighting with decorative lamps and chandeliers.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored top - red vest - blonde hair in two braids - smiling while playing guitar\nRachel Green: denim vest - dark top - brown hair - expression shifts from neutral to concerned\nChandler Bing: light-colored shirt - dark pants - short brown hair - expression shifts from relaxed to serious\nRoss Geller: red shirt - light gray jacket - short dark hair - expression shifts from relaxed to concerned\nJoey Tribbiani: dark jacket - light-colored shirt - dark hair - expression shifts from neutral to animated\nUnidentified person: dark shirt - dark hair - expression neutral (visible behind bar)\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay performs a song on stage, playing an acoustic guitar and singing into a microphone. Rachel Green stands near the stage, watching the performance. Chandler Bing and Ross Geller sit on the orange couch, watching Phoebe with expressions of concern and amusement. Joey Tribbiani enters the scene from the doorway, walks toward the couch, and begins talking animatedly with Chandler and Ross. Phoebe finishes her song, exits through the door, and the group reacts to her performance.\n\n### **OBJECTS AND PROPS:**\n- Acoustic guitar: light-colored wood (being played by Phoebe)\n- Microphone stand: silver (in front of Phoebe)\n- Orange couch: center of frame\n- Coffee mugs: various colors (on table)\n- Brick wall decor: background\n- Menu board: behind counter\n- \"PERK\" sign: visible on wall\n\n### **DIALOGUE CONTEXT:**\nRachel Green introduces Phoebe Buffay's performance to the group. Chandler Bing and Ross Geller react to Phoebe's singing, with Chandler expressing frustration and Ross appearing concerned. The conversation revolves around Phoebe's behavior, with Chandler mentioning her \"Freudian nightmare\" tendencies. The tone is casual but slightly tense, with Chandler appearing annoyed and Ross looking serious.\n\n### **TEMPORAL NOTES:**\nPhoebe Buffay exits through the door after finishing her song.\nJoey Tribbiani enters the scene from the doorway.\nChandler Bing and Ross Geller shift from sitting to standing and talking.\n",
    "subtitles": "[SINGING] You don't have to be awake To be my man Long as you have brain waves I'll be there to hold your hand Though we just met the other day There's something I have got to say Okay, thank you very much. I'm gonna take a short break. RACHEL: Okay, that was Phoebe Buffay, everybody. Whoo! - What the hell was that? - Phoebe just started... I believe I was talking to Joey. All right, there, mother-kisser? [LAUGHING] \"Mother-kisser.\" I'll shut up. Chandler, can I say something? I know you're still mad at me. I just wanna say that there were two people there that night, okay? - There were two sets of lips. - Yes, well, I expect this from her. Okay? She's always been a Freudian nightmare. Okay, but if she always behaves like this, why don't you say something? Because it's complicated. It's complex.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:56.914",
    "end_chunk": "00:17:01.394"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with neon signs visible.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored jacket - dark pants - brown, medium-length hair - animated expression\nRoss Geller: grey sweater - blue jeans - dark, short hair - serious expression\nUnidentified person: dark clothing - dark hair - neutral expression (visible in background)\nUnidentified person: light-colored top - dark pants - dark hair - smiling expression (visible in background)\nUnidentified person: dark clothing - dark hair - neutral expression (visible in background)\nUnidentified person: dark clothing - dark hair - neutral expression (visible in background)\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Ross stand facing each other in the center of the coffee shop, engaged in an animated conversation. Ross gestures with his hands while speaking, and Chandler responds with expressive facial movements. Other patrons are seated at tables and the bar, observing the interaction. Chandler then kneels on one knee, holding Ross's hand, while Ross looks down at him with a surprised expression. The scene then cuts to a hospital room where Monica Geller, wearing a dark outfit and carrying a red backpack, enters and stands near a hospital bed. Phoebe Buffay, holding a guitar and wearing a patterned robe, stands beside the bed. Ross Geller, now in a light blue hospital robe, enters the room and greets Monica and Phoebe. Monica smiles and gestures toward Ross, while Phoebe looks on with a concerned expression.\n\n### **OBJECTS AND PROPS:**\nCoffee mugs: various colors (on tables)\nOrange couch (center of frame)\nWooden tables (with drinks and magazines)\nBar stools (with patrons seated)\nHospital bed (with patterned blanket)\nGuitar (held by Phoebe Buffay)\nRed backpack (carried by Monica Geller)\nFlowers and balloons (in hospital room)\nRed book (on hospital bed tray)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses a complicated situation with Chandler Bing, mentioning a Greek play rehearsal and a kiss with his mother. The conversation has a tense tone, with Ross appearing serious and Chandler animated. Monica Geller and Phoebe Buffay enter the hospital room and greet Ross, who appears to be recovering. Monica smiles and gestures toward Ross, while Phoebe looks on with a concerned expression.\n\n### **TEMPORAL NOTES:**\nChandler kneels on one knee, holding Ross's hand\nRoss Geller enters the hospital room\nMonica Geller enters the hospital room\nPhoebe Buffay enters the hospital room\nRoss Geller moves to stand near the hospital bed\nMonica Geller moves to stand near the hospital bed\nPhoebe Buffay moves to stand near the hospital bed",
    "subtitles": "Because it's complicated. It's complex. Hey, you kissed my mom. We're rehearsing a Greek play. - That's funny. We done now? - No. Okay, you mean you're not gonna talk to her, tell her how you feel? That would be a no. Just because you played tonsil tennis with my mom... ...doesn't mean you know her, all right? Trust me, you can't talk to her. Okay. \"You can't\"? Or you can't? Okay, that's my finger. Okay, that's my knee. Still doing the play. [SHOUTS THEN HUMS] All right, what did you do with him? [TOILET FLUSHES] - You're awake. - Look at you. How do you feel? Uh, a little woozy, but basically okay. Gosh, you look good. I feel good. Who are you?",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:58.517",
    "end_chunk": "00:17:59.911"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, bright artificial lighting\nMedical equipment, hospital bed, and balloons are visible, indicating a patient's room.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling and animated\nPhoebe Buffay: patterned jacket over dark top - dark, braided hair - smiling and holding a guitar\nUnidentified person: light-colored hospital robe over dark shirt - brown, medium-length hair - looking up and speaking\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Phoebe stand near the bed, talking to the unidentified person who is sitting up in the hospital bed. Monica gestures with her hands while speaking, and Phoebe holds a guitar and smiles. The unidentified person listens, then responds while looking at them. The conversation appears to be about care and gratitude, with Monica and Phoebe expressing that they have taken care of the person.\n\n### **OBJECTS AND PROPS:**\n- Guitar: wooden, held by Phoebe\n- Hospital bed: with light blue sheets and pillows\n- Medical equipment: monitors and IV stand visible\n- Balloons: colorful, near the bed\n- Flowers: in a vase on the bedside table\n- Red tablet: on the bedside table\n\n### **DIALOGUE CONTEXT:**\nMonica and Phoebe discuss the care they provided to the unidentified person, mentioning specific acts like reading, singing, and shaving. The conversation has a slightly sarcastic and disappointed tone, as Monica expresses frustration that their efforts were not reciprocated with a meaningful goodbye. The unidentified person appears grateful but offers a vague farewell, which Monica finds unsatisfactory.\n\n### **TEMPORAL NOTES:**\nThe unidentified person sits up in the bed and begins speaking after the initial greeting. Monica and Phoebe shift their positions slightly while talking, but remain near the bed throughout the clip.",
    "subtitles": "- Sorry. - I'm Phoebe Buffay. I'm Monica Geller. I've been taking care of you. We both have. - So the Etch A Sketch is from you guys? - Actually, it's just from me. - Yeah, I got you the foot massager. - Know who shaved you? That was me. - I read to you. - I sang. Ha. Well, thanks. - Oh, my pleasure. - You're welcome. So I guess I'll see you around. What? That's it? \"See you around\"? - Well, what do you want me to say? - Well, I don't know. Maybe, uh: \"That was nice. It meant something to me. I'll call you.\" - All right. I'll call you. - I don't think you mean that. This is so typical. You know, we give... ...and we give... ...and we give. And then we just get nothing back. And then one day, it's just, you know, you wake up and \"See you around.\"",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00019",
    "start_chunk": "00:18:00.079",
    "end_chunk": "00:19:00.471"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nA hospital room — daytime, bright fluorescent lighting. The scene transitions to an apartment kitchen — evening, warm interior lighting.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark-colored shirt under light-colored hospital robe - hair: brown, medium length, styled - Expression: concerned, looking upward\nPhoebe Buffay: dark-colored top - hair: dark, shoulder-length, straight - Expression: animated, talking\nRachel Green: dark-colored top - hair: dark, shoulder-length, straight - Expression: serious, listening\nChandler Bing: dark-colored shirt under light-colored jacket - hair: brown, medium length, styled - Expression: serious, looking at Phoebe\nNora: light-colored coat - hair: blonde, shoulder-length, straight - Expression: serious, talking\n\n### **ACTIONS AND INTERACTIONS:**\nJoey sits in a hospital bed, looking concerned. Phoebe and Rachel walk through a hallway, talking and gesturing. Chandler stands in the apartment kitchen, talking to Nora, who enters and gestures toward the kitchen. Nora walks through the kitchen, talking and gesturing toward the refrigerator and pantry shelves.\n\n### **OBJECTS AND PROPS:**\n- Hospital bed: light blue sheets (in hospital room)\n- Guitar: light-colored (held by Phoebe)\n- Red backpack: worn by Rachel\n- Refrigerator: white, with magnets and notes (in kitchen)\n- Pantry shelves: stocked with food items (in kitchen)\n- Microwave: white (on kitchen counter)\n- Poster: \"The Mysterious Mr. America\" (on kitchen wall)\n\n### **DIALOGUE CONTEXT:**\nNora discusses dropping off book copies for friends with Chandler. The conversation has a serious tone, with Nora appearing concerned and Chandler reacting with a serious expression. The dialogue mentions a past incident involving Ross, indicating a tense or awkward topic.\n\n### **TEMPORAL NOTES:**\n- Joey sits in hospital bed throughout the clip\n- Phoebe and Rachel walk through hallway, then exit\n- Chandler stands in kitchen, then turns to face Nora\n- Nora enters kitchen, walks to refrigerator, then gestures toward pantry shelves\n- Nora exits kitchen, then re-enters to continue conversation with Chandler",
    "subtitles": "And then one day, it's just, you know, you wake up and \"See you around.\" Let's go, Phoebe. You know what? We thought you were different. But I guess it was just the coma. NORA: The car's running downstairs. I wanted to drop off these copies of my book for your friends. - Anything you want from Lisbon? - No, just knowing you're there is enough. All right. Well, be good. I love you. You kissed my best Ross. Or something to that effect. Okay. Look, it was stupid. - Really stupid. - Really stupid. And I don't even know how it happened. I'm sorry, honey. I promise it will never happen again.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:56.635",
    "end_chunk": "00:19:58.738"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in the Central Perk coffee shop in the evening and then transition to a hospital room during the day, concluding with a scene in an apartment kitchen in the evening.\n\n**KEY CHARACTERS**\n*   **Phoebe Buffay:** A singer, then a concerned visitor, and later involved in a conversation about past events.\n*   **Rachel Green:** Present at Central Perk, later seen in a hallway.\n*   **Monica Geller:** Observes Phoebe's performance, later visits Ross in the hospital, showing care and some frustration.\n*   **Chandler Bing:** Converses with Ross, later talks to Nora about a past incident involving Ross.\n*   **Ross Geller:** Engaged in conversation, then in the hospital.\n*   **Joey Tribbiani:** Enters Central Perk, later seen in a hospital bed.\n*   **Nora:** Chandler's mother, who visits and discusses past events, including those involving Ross.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Central Perk with Phoebe performing a song she wrote about a new acquaintance, which elicits amusement and then concern from her friends. Ross and Chandler discuss a complicated situation involving Ross, a Greek play, and his mother. Meanwhile, Joey enters. The conversation among Ross, Chandler, and Joey hints at tension and something \"Freudian.\" This segues into a hospital scene where Monica and Phoebe visit Ross, who is recovering. Phoebe is seen with her guitar, and Monica expresses a mix of care and mild disappointment regarding the perceived lack of a proper goodbye from the patient they were tending to. Later, in an apartment kitchen, Chandler speaks with his mother, Nora, about delivering books. Their conversation becomes serious as it touches upon a past incident involving Ross, implying an awkward or tense history. Joey is also seen in a hospital bed during this transition.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Friendship and Support:** The group rallies around Phoebe's performance and later visits Ross in the hospital, showing care and concern.\n*   **Interpersonal Dynamics:** The conversations reveal underlying tensions and past issues, particularly involving Ross and his mother, Nora.\n*   **Humor and Awkwardness:** Phoebe's unconventional songs and the group's reactions, as well as Nora's conversation with Chandler, blend humor with uncomfortable truths.\n*   **Scene Transition:** A notable shift occurs from the public setting of Central Perk to the private, and then medical, environments of a hospital room and an apartment kitchen, reflecting a progression of events and conversations.\n*   **Unresolved Issues:** The dialogue between Chandler and Nora suggests lingering complexities and past grievances related to Ross."
}