{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nStreet corner newsstand — daytime, bright natural light\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored coat - dark pants - long, wavy blonde hair - animated\nRachel Green: dark leather jacket - dark pants - dark hair in a beanie - surprised expression\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe and Rachel stand at a newsstand, talking and gesturing animatedly. Phoebe points behind Rachel, who turns to look. They both react with exaggerated surprise as an ambulance drives past, causing them to jump back and gesture in shock. The scene cuts to the Friends cast in their apartment, where they are seated and laughing together.\n\n### **OBJECTS AND PROPS:**\n- Newsstand with newspapers and magazines (various covers visible)\n- Ambulance (orange and white, with \"AMBULANCE\" written on front)\n- Street with snow patches and parked cars\n- Brick buildings with windows and posters\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses checking the horoscope with Rachel. The conversation has a casual, joking tone, with Phoebe appearing animated and Rachel reacting with surprise. The sudden appearance of the ambulance adds a comedic element to their interaction.\n\n### **TEMPORAL NOTES:**\n- Scene transitions from street to apartment interior\n- Phoebe and Rachel move from standing at the newsstand to reacting to the ambulance\n- Characters in apartment transition from seated to laughing together",
    "subtitles": "Do you think they have yesterday's Daily News? MONICA: Why? - I just wanna check my horoscope... ...see if it was right. Oh, my God. Phoebe. Don't look now, but, behind you there's a guy... ...who has the potential to break our hearts and plunge us into depression. Where? Ooh, come to Mama. Okay, he's coming. Be cool. Be cool. Be cool. - Nice hat. BOTH: Thanks. - We should do something. Whistle. - We're not gonna whistle. - Yeah, come on, do it. - No. - Do it. Do it. Do it. - Woo-hoo! [AMBULANCE SIRENS WAILING] [TIRES SQUEALING THEN THUD] I can't believe you did that.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:02.377",
    "end_chunk": "00:00:41.331"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nHospital room — nighttime, artificial lighting from lamps and medical equipment.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored top - unclear lower clothing - long, wavy blonde hair - concerned expression\nRachel Green: black leather jacket - unclear lower clothing - dark, shoulder-length hair - serious expression\nUnidentified person (in bed): hospital gown - unclear hair color - sleeping\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe and Rachel stand by the hospital bed, looking down at the sleeping person. Phoebe leans forward, placing her hand on the person's chest, appearing concerned. Rachel stands beside her, looking down with a serious expression. The person in bed remains still and asleep throughout the scene.\n\n### **OBJECTS AND PROPS:**\n- Hospital bed: with blue blanket and pillows\n- Medical equipment: monitor and IV stand (visible near bed)\n- Lamp: white base, on bedside table\n- Curtains: beige, partially drawn\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses the sleeping person's condition with Rachel. The conversation has a concerned tone, with Phoebe appearing worried and Rachel reacting with seriousness. The dialogue mentions the person's face and suggests they might be a lawyer.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "MONICA: Why did I woo-hoo? I mean, what was I hoping? He'd turn around and say: \"Ooh, I love that sound. I must have you now\"? I just wish there was something we could do. [EKG BEEPING] Hello. Hello, coma guy. Get up, you Girl Scout! Up, up, up! - Phoebe, what are you doing? - Maybe nobody's tried this. I wish we at least knew his name. Would you look at that face? I mean, even sleeping he looks smart. I bet he's a lawyer.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:29.631",
    "end_chunk": "00:02:03.288"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, clinical fluorescent lighting. The scene transitions to the friends' apartment — evening, warm ambient lighting from lamps and windows.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored patterned vest over striped shirt - dark pants - long, curly blonde hair - expression shifts from concerned to smiling\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - expression shifts from concerned to smiling, then to serious\nChandler Bing: dark-colored shirt - dark pants - short, brown hair - expression: relaxed, smiling\nJoey Tribbiani: red sweater - dark pants - medium-length brown hair - expression: smiling, relaxed\nRoss Geller: dark-colored shirt - dark pants - short, brown hair - expression: serious, concerned\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - expression: animated, concerned\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe and Rachel stand by a hospital bed, talking and gesturing toward a patient. Phoebe leans on Rachel’s shoulder comfortingly. The scene cuts to the friends’ apartment, where Phoebe and Rachel stand near the kitchen counter, talking with Chandler, Joey, Ross, and Monica. Monica holds a bag of chips, while Chandler and Joey sit on the couch, smiling and talking. Ross sits nearby, looking concerned. Rachel sits in a chair, holding a mug. The group watches TV, where a man on screen holds up a book titled \"Euphoria Unbound.\"\n\n### **OBJECTS AND PROPS:**\n- Hospital bed: blue sheets, medical equipment (IV stand, monitor)\n- Coffee mugs: various colors (on table)\n- Wooden coffee table (center)\n- TV: black, displaying a talk show host holding a book\n- Book: \"Euphoria Unbound\" (on TV screen)\n- Brick wall decor (background)\n- Patterned couch (center)\n\n### **DIALOGUE CONTEXT:**\nPhoebe and Rachel discuss a man they met, speculating he’s a lawyer who teaches sculpting and can dance. The conversation has a joking, lighthearted tone, with Phoebe animatedly speaking and Rachel smiling. The group in the apartment watches TV, reacting to the talk show host discussing the book \"Euphoria Unbound.\"\n\n### **TEMPORAL NOTES:**\nScene transitions from hospital room to friends’ apartment.\nPhoebe leans on Rachel’s shoulder.\nChandler and Joey sit on the couch.\nRoss sits nearby, looking concerned.\nRachel sits in a chair, holding a mug.\nThe group watches TV, where a man on screen holds up a book.",
    "subtitles": "I mean, even sleeping he looks smart. I bet he's a lawyer. Yeah, but did you see the dents in his knuckles? That means he's artistic. Okay. He's a lawyer who teaches sculpting on the side. And he can dance. And he's the kind of guy who, when you're talking, he's listening... ...you know, and not saying, \"Yeah, I understand\"... ...but wondering what you look like naked. - Oh, stop it. I wish all guys could be like him. I know. Are there no conscious men in the city for you two? - He doesn't have anyone. - Yeah. We feel kind of responsible. I can't believe you said, \"Woo-hoo.\" I don't even say, \"Woo-hoo.\" Oh, she's coming up. She's coming up. Folks, when we come back... ...we'll talk about her new book Euphoria Unbound... ...with always-interesting Nora Tyler Bing. Put the kids to bed for this one. Don't watch this. Weekend at Bernie's is on Showtime and HBO and Cinemex.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:59.202",
    "end_chunk": "00:03:02.472"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nThe Friends apartment living room — evening, warm ambient lighting with lamps and decorative wall sconces.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - patterned skirt - dark, shoulder-length hair - animated\nRoss Geller: dark blue fleece jacket - light-colored pants - dark, short hair - concerned\nChandler Bing: dark patterned zip-up shirt - dark pants - dark, wavy hair - expressive\nRachel Green: black top - black pants - dark, shoulder-length hair - smiling\nPhoebe Buffay: striped shirt - dark overalls - long, blonde hair - animated\nJoey Tribbiani: red sweater - dark pants - dark, wavy hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered in the living room, seated on couches and chairs, watching television. Chandler stands and gestures animatedly while talking, then walks toward the kitchen area. Rachel and Monica sit on the couch, with Monica holding a bag of chips and talking to Ross, who gestures back. Phoebe stands near the kitchen counter, holding a bowl. Joey sits on the couch, eating chips. The group reacts to something on TV, with Chandler and Phoebe pointing at the screen.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Wooden coffee table (center)\n- Blue kitchen cabinets (background)\n- Refrigerator with magnets (kitchen area)\n- Television (on stand, showing a talk show)\n- Bowl of chips (held by Phoebe)\n- Bag of chips (held by Monica)\n\n### **DIALOGUE CONTEXT:**\nChandler discusses his mother's books with the group, expressing excitement about them. The conversation has a casual, joking tone, with Chandler appearing animated and the others reacting with smiles and nods. The group is engaged in the discussion, with Ross and Monica actively participating.\n\n### **TEMPORAL NOTES:**\nChandler stands up and walks toward the kitchen area\nPhoebe moves from the kitchen counter to stand near the refrigerator\nRachel and Monica remain seated on the couch throughout\nJoey remains seated on the couch, eating chips\nThe group shifts attention to the television screen",
    "subtitles": "Don't watch this. Weekend at Bernie's is on Showtime and HBO and Cinemex. - No way. - Come on. She's your mom. Exactly. Weekend at Bernie's. Dead guy getting hit in the groin 20, 30 times. - No? - Chandler, I gotta tell you... ...I love your mom's books. I love her books. I cannot get on a plane without one. I mean, this is so cool. You wouldn't think it's cool if you were 11... ...and all your friends were passing around page 79 of Mistress Bitch. Come on, Chandler. I love your mom. I think she's a blast. - You can say that. She's not your mom. ROSS: Oh, please. She's the... RACHEL: Hi, sweetie. When did Rigatoni get back from Rome? - Last night. - Really? So then his plane didn't explode in a big ball of fire? Just a dream I had. But, phew. Hey, hey, hey. She's on. Ah. Nora Bing. Before we get to the book. What is this about you being arrested in London? What is that about?",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:58.845",
    "end_chunk": "00:04:02.366"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nThe Friends apartment living room — evening, warm ambient lighting from lamps and decorative fixtures.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - dark pants - long, wavy brown hair - smiling, relaxed\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated, gesturing\nChandler Bing: dark-colored zip-up sweater - dark pants - short, brown hair - serious, focused\nJoey Tribbiani: red shirt - jeans - short, dark hair - smiling, relaxed\nPhoebe Buffay: dark-colored top - patterned pants - long, curly brown hair - smiling, relaxed\nRoss Geller: orange sweater - jeans - short, brown hair - attentive, listening\nUnidentified person: dark-colored top - unclear pants - long, blonde hair - smiling, relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered in the living room, watching a television show featuring a talk show host and guest. Chandler stands holding a mug, looking intently at the TV. Monica and Rachel are seated on the couch, engaged in conversation with each other and the group. Joey sits on the couch, smiling and listening. Ross sits beside Monica, attentive. Phoebe sits in an armchair, relaxed. The group reacts to the TV show, with Monica gesturing animatedly while speaking to Rachel.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (held by characters)\n- Wooden coffee table (center of frame)\n- Red and white checkered armchair (right side)\n- Blue shelves (background)\n- Lamp (on side table)\n- Television (center of frame)\n\n### **DIALOGUE CONTEXT:**\nThe group discusses a TV show featuring a talk show host and guest. The conversation has a casual, humorous tone, with Monica appearing animated and Rachel reacting with amusement. The group is engaged in the conversation, with Chandler appearing focused and Joey smiling.\n\n### **TEMPORAL NOTES:**\nChandler stands up and walks toward the kitchen area\nMonica gestures animatedly while speaking to Rachel\nJoey sets down mug and sits on couch\nRoss leans forward, attentive to conversation",
    "subtitles": "What is this about you being arrested in London? What is that about? - Your mom was arrested? - Shh, I'm busy beaming with pride. This is kind of embarrassing... ...but occasionally after I've been intimate with a man... - Why would she say that's embarrassing? - Shh. - I just get this craving for Kung Pao chicken. That's too much information. So now you're doing this book tour thing. How's that going? Oh, fine. I'm leaving for New York tomorrow, which I hate. But I get to see my son, who I love. GROUP: Oh. This is the way that I find out. Most moms use the phone. You know, don't take this wrong, I just don't see you as a mom somehow. - I don't mean that bad. - Oh, no. I'm a fabulous mom. I bought my son his first condoms. And then he burst into flames.",
    "episode": "1x11 - The One With Mrs. Bing",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:59.239",
    "end_chunk": "00:05:01.174"
  },
  "summary": "**SCENE OVERVIEW**\nThe episode begins on a bright, daytime street corner at a newsstand, then transitions to a hospital room at night, and finally to the friends' apartment in the evening. The setting remains within the apartment for the remainder of the observed sequence.\n\n**KEY CHARACTERS**\n*   **Phoebe Buffay:** Animated, concerned, then relaxed and smiling.\n*   **Rachel Green:** Surprised, serious, then smiling and relaxed.\n*   **Chandler Bing:** Relaxed, smiling, then animated and focused.\n*   **Joey Tribbiani:** Relaxed and smiling throughout.\n*   **Ross Geller:** Concerned, then attentive.\n*   **Monica Geller:** Animated and concerned, then animated.\n*   **Unidentified person:** Sleeping in a hospital bed, later appears relaxed in the apartment.\n\n**MERGED NARRATIVE SUMMARY**\nPhoebe and Rachel start their day at a newsstand, engaging in a lighthearted conversation about horoscopes, which is comically interrupted by a startled reaction to an ambulance. The scene then shifts to a hospital room at night, where Phoebe and Rachel express concern for a sleeping individual, speculating they might be a lawyer. This leads to a transition back to the friends' apartment in the evening. There, the group discusses the hospitalized individual, with Phoebe and Rachel sharing lighthearted observations about him being a lawyer who sculpts and dances. Later, the friends gather in the living room, watching a TV show. Chandler shares his excitement about his mother's books, while the others are engrossed in the program. Monica and Rachel engage in conversation, and the group reacts humorously to the TV.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Unexpected hospital visit:** Phoebe and Rachel's concern for an unidentified person in the hospital introduces a potential subplot or character development.\n*   **Humorous speculation:** The friends playfully speculate about the hospitalized individual's profession and talents, adding a lighthearted tone.\n*   **Introduction of mother's work:** Chandler brings up his mother's books, hinting at a potential narrative arc related to them.\n*   **Group bonding:** The scenes in the apartment emphasize the friends' camaraderie as they share conversations, react to media, and support each other.\n*   **Transition between public and private spaces:** The sequence moves from a public street to a private hospital room, and finally to the familiar comfort of the friends' apartment."
}