{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nGynecologist's office — daytime, bright fluorescent lighting\nThe room features medical posters on the walls, a patient examination table, and a sink area, indicating a clinical setting.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark vest - dark, short hair - animated expression\nRachel Green: floral-patterned dress - long, curly brown hair - concerned expression\nUnidentified person: light blue medical gown - long, blonde hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands and gestures emphatically while speaking to Rachel Green and the unidentified person seated on the examination table. Rachel Green holds a small object and reacts with concern and surprise to Ross's statements. The unidentified person, seated in the exam table, listens and responds, at one point gesturing with her hands. Ross exits the room briefly before returning, continuing the conversation.\n\n### **OBJECTS AND PROPS:**\n- Medical posters: anatomical diagrams (on walls)\n- Patient examination table: light-colored (with patient seated)\n- Sink: with soap dispenser and bottles (near patient)\n- Magazine rack: with",
    "subtitles": "And we all know what a challenge that is. - Uh-huh. See? - All right, you two, stop it. No, no. She gets a credit. Hey, I'm in there too. Honestly. You're not actually suggesting Helen Willick Bunch Geller. I think that borders on child abuse. Of course not. I'm suggesting Geller Willick Bunch. Oh, no. No, no, no. You see what he's doing? He knows no one is gonna say all those names. He knows they'll wind up calling her Geller. Then he gets his way. My way? You think this is my way? Believe me, of all the ways I ever imagined this moment in my life being... ...this is not my way. You know what? This is too hard. Knock, knock. How are we today? Any nausea? - A little. - Just a little. Well, I was just wondering about the mother-to-be, but, uh, thanks for sharing. Uh, lie back. You know what? I'm gonna go. Um, I don't think I can be involved in this particular family thing. [BABY'S HEART BEATING OVER SONOGRAM]",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00021",
    "start_chunk": "00:20:00.574",
    "end_chunk": "00:20:56.754"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting with purple walls and decorative posters.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark vest - dark, short hair - animated expression\nRachel Green: light-colored top - dark pants - long, wavy brown hair - smiling\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - smiling\nChandler Bing: dark t-shirt - dark pants - short, brown hair - concerned expression\nJoey Tribbiani: light-colored shirt - dark pants - short, brown hair - concerned expression\nPhoebe Buffay: light-colored top - dark pants - blonde, shoulder-length hair - concerned expression\nUnidentified person: dark-colored top - dark pants - dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands in front of a television displaying an ultrasound image, gesturing excitedly as he explains what he sees to the group. Rachel Green sits on the couch, smiling and looking at the screen. Monica Geller stands beside Ross, also looking at the ultrasound. Chandler Bing and Joey Tribbiani sit on the couch, looking at the screen with concerned expressions. Phoebe Buffay sits on the couch, looking at the screen with a concerned expression. An unidentified person stands near the kitchen area, looking at the screen with a concerned expression.\n\n### **OBJECTS AND PROPS:**\n- Television: displaying ultrasound image (on stand)\n- Couch: with red and white patterned cushions (center of frame)\n- Lamp: warm lighting (on table)\n- Poster: \"Aux Buttes Chaumont Jouets\" (on wall)\n- Flowers: bouquet (on table)\n- Books: on shelf (background)\n- Refrigerator",
    "subtitles": "Oh, my God. Look at that. I know. Well, isn't that amazing? What are we supposed to be seeing here? I don't know, but I think it's about to attack the Enterprise. You know, if you tilt your head to the left and relax your eyes... ...it kind of looks like an old potato. Then don't do that, all right? Monica? What do you think? Mm-hm. Are you welling up? - No. - You are. - You are. You're welling up. - No, I'm not.",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00022",
    "start_chunk": "00:21:05.931",
    "end_chunk": "00:22:00.443"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting with visible kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - beige vest - dark, short hair - expression shifts from concerned to smiling\nMonica Geller: dark-colored top with patterned neckline - dark pants - dark, shoulder-length hair - expression shifts from serious to smiling\nRachel Green: denim overalls over white top - long, wavy brown hair - expression animated, smiling while talking on phone\nUnidentified person: dark-colored shirt - dark hair - seated on couch, partially obscured\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Monica stand near the kitchen counter, interacting with each other and an unseen person. Rachel stands in the living room area, animatedly talking on a red phone while gesturing with her free hand. Ross and Monica watch Rachel, with Ross smiling and Monica looking at Rachel with a concerned expression that shifts to a smile. The unidentified person remains seated on the couch, observing the scene.\n\n### **OBJECTS AND PROPS:**\n- Red telephone: held by Rachel (in hand)\n- White refrigerator: visible with magnets and items on side\n- Blue kitchen cabinets: visible in background\n- Flower arrangement: pink and white flowers in vase near refrigerator\n- Lamp: hanging lamp with woven shade in living room\n- Couch: with red and white patterned cushions\n\n### **DIALOGUE CONTEXT:**\nRachel discusses a pregnancy with someone on the phone, mentioning Barry and expressing hope for the baby to have her nose and Barry’s hairline. The conversation has a lighthearted, joking tone, with Rachel appearing animated and smiling while speaking. Ross and Monica react with concern that shifts to amusement as they listen to Rachel’s phone conversation.\n\n### **TEMPORAL NOTES:**\nRachel moves from standing near the couch to standing near the lamp while talking on the phone.\nRoss moves from standing near Monica to standing slightly away while smiling.\nMonica shifts her gaze from Ross to Rachel while listening to the phone conversation.",
    "subtitles": "- You are. You're welling up. - No, I'm not. - You're gonna be an aunt. - Oh, shut up. Hi, Mindy. Hi, it's Rachel. Yeah, I'm fine. I saw Barry today. Oh, yeah, yeah, he told me. No, it's okay. Really, it's okay. I hope you two are very happy. I really do. And, Min, you know, if everything works out... ...and you guys end up getting married and having kids and everything... ...I just hope they have his old hairline and your old nose. Okay, I know it was a cheap shot, but I feel so much better now.",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00023",
    "start_chunk": "00:21:58.191",
    "end_chunk": "00:22:40.983"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in a gynecologist's office during the daytime and then transition to Monica's apartment living room in the evening.\n\n**KEY CHARACTERS**\n*   **Ross Geller:** Appears animated and excited, particularly about an ultrasound.\n*   **Rachel Green:** Initially concerned, she later appears animated and smiling while on the phone discussing a pregnancy.\n*   **Monica Geller:** Present with Ross and the group, her expression shifts from serious to smiling.\n*   **Chandler Bing, Joey Tribbiani, Phoebe Buffay:** Appear concerned while watching an ultrasound.\n*   **Unidentified person (in Chunk 1):** Appears to be a medical professional, likely a doctor or nurse, present during the gynecologist's visit.\n*   **Unidentified person (in Chunk 2 & 3):** A guest in Monica's apartment, observing the group.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in a gynecologist's office where Ross Geller is animatedly speaking to Rachel Green and a medical professional. Ross appears to be explaining something important, causing Rachel concern. Later, the setting shifts to Monica's apartment living room in the evening, where Ross excitedly shows an ultrasound image on the television to a group including Rachel, Monica, Chandler, Joey, Phoebe, and another guest. While the others watch with concern, Rachel, now in overalls, is on the phone, cheerfully discussing a pregnancy. She jokes about the baby inheriting Barry's hairline and her nose. Ross and Monica initially watch Rachel with concern, but their expressions eventually turn to smiles as they listen to her lighthearted conversation.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** The initial scene in the gynecologist's office, involving Ross and Rachel, hints at an upcoming pregnancy. The later scene shows Ross enthusiastically sharing ultrasound information with the wider group, indicating a shared experience.\n*   **Emotional Tone:** The tone shifts from professional and slightly tense in the doctor's office to a mix of concern and excitement in the apartment, culminating in lightheartedness due to Rachel's phone conversation.\n*   **Plot Setup:** The pregnancy reveal is clearly set up, with the ultrasound as a focal point and Rachel's phone call providing further details and humor.\n*   **Notable Transitions:** A significant transition occurs from the clinical setting of the gynecologist's office to the comfortable, social environment of Monica's apartment, signifying a move from a medical announcement to a communal reaction."
}