{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment dining area — evening, warm indoor lighting\n\n### **CHARACTERS PRESENT:**\nMonica Geller: white sleeveless top - black pants - dark, shoulder-length hair - smiling and engaged in conversation\nRoss Geller: light-colored jacket over blue shirt - dark pants - short, dark hair - animated, gesturing while speaking\nCarol Willick: light gray cardigan - dark pants - blonde, shoulder-length hair - smiling, listening\nJoey Tribbiani: blue denim shirt - dark pants - short, dark hair - standing, gesturing while speaking\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits at the table, animatedly talking and gesturing with his hands while eating. Monica Geller sits across from him, smiling and listening, occasionally reacting with expressions of amusement or concern. Carol Willick sits beside Monica, smiling and listening to the conversation. Joey Tribbiani stands up from his seat, walks to the table, and gestures while speaking to the group. The group is seated around a wooden dining table with plates of food and blue glasses.\n\n### **OBJECTS AND PROPS:**\n- Blue glasses: on the table\n- Plates of food: on the table\n- Wooden dining table: center of frame\n- Refrigerator: with magnets and photos on the door (background)\n- Kitchen appliances: visible in the background\n- TV: in the background\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses his past",
    "subtitles": "Even when you were a kid, and you were chubby... ...and you had no friends, you were just fine. You'd read alone in your room. And your puzzles... Look, there are people, like Ross, who need to shoot for the stars. With his museum and his papers getting published. Other people are satisfied with staying where they are. I'm telling you, these are the people who never get cancer. And I read about these women trying to have it all, and I thank God... ...our little Harmonica doesn't seem to have that problem. So, Ross, what's going on with you? Any stories? No news, no little anecdotes to share with the folks? Okay, okay. Ahem. Look, I, uh... I realize you guys have been wondering... ...what exactly happened between Carol and me. And so, well, here's the deal.",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00011",
    "start_chunk": "00:09:57.847",
    "end_chunk": "00:10:58.865"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: blue denim shirt - brown pants - dark, short hair - serious expression\nCarol Willick: light gray jacket - white top - blonde, shoulder-length hair - concerned expression\nRachel Green: white sleeveless top - black pants - dark, shoulder-length hair - anxious expression\nUnidentified person: light-colored shirt - dark pants - dark hair - not visible\n\n### **ACTIONS AND INTERACTIONS:**\nRoss stands in the center of the room, speaking animatedly to Carol and Rachel who are seated at the table. Carol gestures with her hand while speaking to Ross. Rachel sits at the table with her hands clasped, looking concerned. Ross then sits in a chair and continues talking, gesturing with his hand. Rachel leans back on the couch with her arms crossed, looking away from Ross.\n\n### **OBJECTS AND PROPS:**\n- Blue glasses: on table\n- Plates: with food on table\n- Refrigerator: with magnets on it\n- Orange couch: in background\n- Wooden table: with plates and glasses on it\n- Lamp: on table\n\n### **DIALOGUE CONTEXT:**\nRoss discusses Carol being a lesbian and pregnant with his child, who will be raised by Carol and her partner Susan. The conversation has a serious tone, with Ross appearing concerned and Rachel reacting with anxiety. Carol appears to be explaining the situation to Ross.\n\n### **TEMPORAL NOTES:**\nRoss stands up and walks to the table\nRoss sits down in a chair\nRachel leans back on the couch",
    "subtitles": "Carol's a lesbian. She's living with a woman named Susan. She's pregnant with my child. And she and Susan are going to raise the baby. And you knew about this? Your folks are really that bad, huh? Well, you know, these people are pros. They know what they're doing. They take their time. They get the job done. Boy, I know they say that you can't change your parents. Boy, if you could, I'd want yours.",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00012",
    "start_chunk": "00:11:01.911",
    "end_chunk": "00:11:58.341"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with decorative lamps\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sleeveless top - black pants - dark, shoulder-length hair - expression shifts from relaxed to concerned\nRoss Geller: blue denim shirt - dark pants - dark, short hair - expression serious and engaged\nRachel Green: purple top - patterned pants - blonde, shoulder-length hair - expression animated and engaged\nChandler Bing: dark-colored t-shirt - dark pants - dark, medium-length hair - expression neutral to slightly amused\nPhoebe Buffay: light blue dress with floral pattern - dark pants - blonde, shoulder-length hair - expression focused and slightly concerned\nJoey Tribbiani: plaid shirt - blue jeans - dark, medium-length hair - expression relaxed and slightly amused\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits on the couch, initially relaxed, then becomes more engaged as she interacts with Ross. Ross stands and gestures while talking to Monica, then walks away. Rachel sits on the couch, holding a remote, and interacts with Monica. Phoebe enters the room, holding a mop, and begins cleaning while talking to Ross. Chandler stands near the bar area, observing the group. Joey sits on a stool, watching the interaction. The group is engaged in conversation, with Monica and Ross appearing to be the main focus.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Wooden coffee table (with",
    "subtitles": "Must pee. You know, it's even worse when you're twins. - You're a twin? - Oh, yeah. We don't speak. She's like this high-powered, driven, career-type. - What does she do? - She's a waitress. All right. You guys, I kind of gotta clean up now. Chandler, you're an only child, right? You don't have any of this. Well, no, although I did have an imaginary friend... ...who my parents actually preferred. RACHEL: Hit the lights, please. How long was I in there? I'm just cleaning up. Oh, do you, uh...? Do you need any help? Um, okay, sure. Thanks. [SIGHS] Anyway... So you nervous about Barry tomorrow? - Oh, a little. - Mm-hm.",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00013",
    "start_chunk": "00:12:00.302",
    "end_chunk": "00:13:02.155"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: light blue shirt - floral skirt - brown, shoulder-length hair - concerned expression\nRoss Geller: dark blue shirt - dark pants - short, dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the orange couch, looking up and speaking to Ross, who stands beside her holding a broom. Ross gestures with the broom as he speaks, then puts it down and stands with his hands on his hips while continuing the conversation. Rachel listens, occasionally looking down or to the side.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center)\n- Stained-glass lamp (on floor)\n- Bar stools (near counter)\n- Floral pillows (on couch)\n- Wooden coffee table (in front of couch)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses advice for someone recently dumped with Rachel. The conversation has a serious tone, with Ross appearing thoughtful and Rachel reacting with concern and slight exasperation.\n\n### **TEMPORAL NOTES:**\nRoss puts down the broom and stands with hands on hips. Rachel shifts her gaze while listening.",
    "subtitles": "- Oh, a little. - Mm-hm. - A lot. - Mm-hm. So got any advice? You know, as someone who's recently been dumped. Well, you may want to steer clear of the word \"dumped.\" Chances are he's going to be this broken shell of a man. You know? So you should try not to look too terrific. I know it'll be hard. Or, you know, hey, I'll go down there, and I'll give Barry back his ring. And you can go with Carol and Susan to the OB-GYN. You've got Carol tomorrow. When did it get so complicated? Got me. - Remember when we were in high school? - Yeah. I mean, didn't you think you' were gonna meet someone... ...fall in love, and that'd be it? [SCOFFS]",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:59.403",
    "end_chunk": "00:13:59.712"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nThe apartment living room — evening, dim ambient lighting with decorative lamps visible.\nThe scene transitions to a medical examination room — daytime, clinical lighting with posters and medical equipment.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light blue shirt - unclear lower clothing - brown, shoulder-length hair - concerned expression\nRoss Geller: dark blue denim shirt - dark pants - dark, short hair - serious expression\nUnidentified person: light-colored dress with floral pattern - dark hair - standing, holding a cup\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, looking up at Ross who stands beside her, placing his hand on the back of the couch. Ross appears to be speaking to her. The scene cuts to a medical room where Ross enters, greeting a woman in a blue hospital gown seated on an examination table. A second woman, wearing a floral dress, enters and shakes Ross’s hand. Ross then turns to speak to the woman in the gown.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Decorative lamps (one with butterfly design)\n- Medical examination table (in second scene)\n- Medical posters (on walls)\n- Cup (held by the unidentified woman)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a medical appointment with Rachel, who appears concerned. The conversation shifts to a medical setting where Ross greets a woman named Susan and shakes hands with another woman. The tone is casual and slightly awkward, with Ross appearing surprised or nervous.\n\n### **TEMPORAL NOTES:**\nRoss moves from standing beside the couch to entering the medical room.\nRachel remains seated on the couch throughout the first scene.\nThe unidentified woman enters the medical room and shakes Ross’s hand.",
    "subtitles": "- Ross? - Yes, yes. Oh. Man. I never thought I'd be here. [ROSS CHUCKLES] Me neither. Hi. Sorry I'm late. I got stuck at work. There was this big dinosaur thing. Anyway... Hi. - Ross, you remember Susan. - How could I forget? Ross. Hello, Susan. Good shake, good shake. So, uh, we're just waiting for? - Dr. Oberman. - Dr. Oberman. Okay, and is he...? - She. - Of course, \"she.\"",
    "episode": "1x02 - The One with the Sonogram at the End",
    "chunk": "chunk_00015",
    "start_chunk": "00:14:01.590",
    "end_chunk": "00:15:01.983"
  },
  "summary": "**SCENE OVERVIEW**\nThe events primarily take place in Monica's apartment living room and dining area during the evening. There is a brief transition to a medical examination room during the daytime.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Host, initially relaxed, becomes concerned.\n*   **Ross Geller:** Central figure, animatedly discussing personal matters, then serious and thoughtful.\n*   **Carol Willick:** Discussing a significant life change with Ross.\n*   **Rachel Green:** Reacts with concern and anxiety to the unfolding situation.\n*   **Joey Tribbiani:** Present and observant.\n*   **Chandler Bing:** Observant.\n*   **Phoebe Buffay:** Present and cleaning.\n*   **Susan:** Appears in the medical setting, introduced to Ross.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Monica's apartment where Ross is animatedly discussing his past with Monica, Carol, and Joey. The conversation shifts to a more serious tone as Ross explains to Carol and Rachel that Carol is a lesbian and pregnant with his child, who will be raised by Carol and her partner, Susan. The group in the apartment, including Monica, Chandler, and Phoebe, engages in discussion about this news, with varying expressions of concern and amusement. Later, Ross offers advice to Rachel about relationships after a breakup. The scene then transitions to a medical examination room where Ross meets Susan and another woman, seemingly for a prenatal appointment.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** The core of the narrative revolves around Ross's reaction to Carol's pregnancy and her relationship with Susan, setting up significant future plotlines.\n*   **Emotional Tone:** The initial atmosphere is somewhat casual but quickly shifts to serious, concerned, and anxious as the implications of Carol's pregnancy and her relationship with Susan are revealed. Ross experiences a range of emotions from animated discussion to serious contemplation and slight awkwardness.\n*   **Plot Setup:** The revelation of Carol's pregnancy and her partner Susan establishes a major family dynamic for Ross and sets the stage for future interactions.\n*   **Notable Transitions:** The scene transitions from the comfortable setting of Monica's apartment, where intimate conversations occur, to the more clinical environment of a medical examination room, highlighting the practical and ongoing nature of the pregnancy."
}