{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm indoor lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown coat - collared shirt and tie - dark, short hair - animated expression\nRachel Green: light-colored cardigan - dark pants - shoulder-length brown hair - arms crossed, serious expression\nMonica Geller: dark-colored dress - dark hair - concerned expression\nPhoebe Buffay: dark vest over light top - dark hair - surprised expression\nChandler Bing: blue sweater - dark pants - short, dark hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss enters the apartment carrying a small monkey on his shoulder, surprising the group. Monica, Rachel, and Phoebe react with shock and concern, while Chandler laughs. Ross explains the monkey’s origin, and the group discusses whether he should live with them. Monica gestures toward the monkey while speaking, and Rachel remains skeptical. Chandler continues to smile and laugh throughout the interaction.\n\n### **OBJECTS AND PROPS:**\n- Wooden dining table (center)\n- Refrigerator (left side)\n- Christmas tree (visible in background)\n- Kitchen counter with hanging pots and pans\n- Decorative stars and tinsel on walls\n- Coffee mugs and bowls on table\n\n### **DIALOGUE CONTEXT:**\nRoss discusses bringing a monkey named Marcel into the apartment with the group. The conversation has a humorous and slightly tense tone, with Ross appearing excited and the others reacting with concern or skepticism. Monica and Rachel express worry, while Chandler laughs at the situation.\n\n### **TEMPORAL NOTES:**\nRoss enters the apartment and stands in the doorway before moving into the room.\nThe monkey moves from Ross’s shoulder to his head and back again.\nChandler stands up and moves closer to the group as the conversation progresses.",
    "subtitles": "Guys? There's, uh, somebody I'd like you to meet. [PHOEBE & RACHEL GASP] Wait, wait. What is that? That would be Marcel. You wanna say hi? No. No, I don't. Oh, he is precious. Where did you get him? My friend Bethel rescued him from some lab. That is so cruel. Why? Why would a parent name their child Bethel? Hey, that monkey's got a Ross on his ass. Ross, is he gonna live with you, like, in your apartment? Yeah. I mean, it's been kind of quiet since Carol left, so... Why don't you just get a roommate? Ah, I don't know. You reach a certain age... ...having a roommate is just kind of pathe... Uh, sorry, that's \"pathet,\" which is Sanskrit for \"really cool way to live.\"",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:07.882",
    "end_chunk": "00:00:58.932"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm indoor lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - dark pants - shoulder-length brown hair - smiling\nMonica Geller: dark-colored dress - dark hair - expression: concerned\nChandler Bing: striped sweater - dark pants - short brown hair - expression: serious\nJoey Tribbiani: blue sweater - dark pants - short brown hair - expression: animated\nRoss Geller: brown jacket - collared shirt and tie - dark hair - expression: serious\nPhoebe Buffay: dark top - light-colored pants - long blonde hair - expression: surprised\nChandler Bing: dark shirt - dark pants - short brown hair - expression: smirking\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands near the kitchen area, gesturing while speaking. Monica and Rachel stand together near a Christmas tree, looking at Ross with concerned expressions. Chandler sits on the couch, looking up at Ross. Joey sits on the couch, looking up at Ross. Phoebe sits on the couch, looking at Ross. Ross walks away from the group, gesturing with his hand.\n\n### **OBJECTS AND PROPS:**\n- Christmas tree (left side of frame)\n- Orange couch (center of frame)\n- Coffee mugs (on table)\n- Brick wall decor (background)\n- Book (on table)\n- Guitar (being played)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses new material about his mother's suicide with the group. The conversation has a serious tone, with Ross appearing animated and the others reacting with concern. Monica and Rachel look at Ross with worried expressions, while Chandler and Joey listen intently.\n\n### **TEMPORAL NOTES:**\nRoss Geller walks away from the group after speaking.\nPhoebe Buffay sits on the couch, looking at Ross.\nChandler Bing sits on the couch, looking up at Ross.\nJoey Tribbiani sits on the couch, looking up at Ross.",
    "subtitles": "You guys, I'm doing all-new material tonight. I have 12 new songs about my mother's suicide... ...and one about a snowman.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:50.944",
    "end_chunk": "00:01:57.783"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - smiling\nRoss Geller: dark-colored sweater - dark pants - dark, short hair - concerned\nRachel Green: red off-the-shoulder top - plaid skirt - shoulder-length brown hair - serious\nChandler Bing: striped sweater - dark pants - dark, short hair - animated\nPhoebe Buffay: light-colored cardigan over dark top - dark pants - blonde, curly hair - smiling\nJoey Tribbiani: blue sweater - dark pants - dark, short hair - concerned\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe plays guitar while singing, standing near a Christmas tree. Ross and Monica sit on the orange couch, listening. Rachel enters, wearing a red top and plaid skirt, and approaches Ross, who is standing. Chandler sits at a table, gesturing as he speaks. Joey sits at a bar stool, looking concerned. The group is gathered in the coffee shop, engaged in conversation.\n\n### **OBJECTS AND PROPS:**\n- Guitar: light-colored (being played)\n- Orange couch",
    "subtitles": "Might want to open with the snowman. GROUP: Hey, Joey. - Hey. ROSS: Hey, Joe. - So how'd it go? Ah, I didn't get the job. [GROUP GROANS] How could you not get it? You were Santa last year. I don't know. Some fat guy's sleeping with the store manager. He's not even jolly. It's all political. So, what are you gonna be? I'm gonna be one of his helpers. It's just such a slap in the face, you know? Do you guys know what you're doing for New Year's? [GROUP SHOUTING] Gee, what? What is wrong with New Year's? Nothing for you. You have Paolo. You don't have to face the horrible pressures of this holiday... ...desperate scramble to find anything with lips... ...just so can have somebody to kiss when the ball drops. Man, I'm talking loud. Well, for your information, Paolo's gonna be in Rome this New Year's. So I'll be just as pathetic as the rest of you. Yeah, you wish.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00003",
    "start_chunk": "00:02:00.036",
    "end_chunk": "00:02:58.177"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: red off-the-shoulder top - plaid skirt - shoulder-length brown hair - expression shifts from annoyed to serious then to smiling\nPhoebe Buffay: light-colored patterned cardigan over black top - dark pants - blonde, curly hair in an updo - smiling and animated while playing guitar\nChandler Bing: dark striped sweater over collared shirt - dark pants - brown, medium-length hair - expression shifts from animated to serious\nJoey Tribbiani: blue sweater - dark pants - brown, medium-length hair - smiling and leaning back\nRoss Geller: dark red sweater - dark pants - brown, medium-length hair - expression shifts from serious to smiling\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - expression shifts from serious to smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands with arms crossed, talking animatedly to Chandler, who gestures back. Phoebe enters from the side, picks up a guitar, and begins playing and singing while standing near a microphone. Rachel moves to the microphone and begins singing along. The group watches, with Joey smiling and leaning back, Ross looking on, and Monica smiling. Phoebe continues playing and singing, smiling at the audience.\n\n### **OBJECTS AND PROPS:**\n- Guitar: light-colored wood (being played by Phoebe)\n- Microphone: silver stand (in front of Phoebe",
    "subtitles": "It's just that I'm sick of being a victim of this Dick Clark holiday. I say this year, no dates, we make a pact. Just the six of us. Dinner. - Sure. - Fine. You know, I was hoping for a little more enthusiasm. - Woo! - Okay. - Phoebe, you're on. - Oh. Oh, good. Okay, hi. Ladies and gentlemen, back by popular demand... ...Miss Phoebe Buffay. [CROWD CHEERING] Thanks. Hi. Um, ahem, I want to start with a song that means a lot to me this time of year. [SINGING] I made a man with eyes of coal And a smile so bewitchin' How was I supposed to know That my mom was dead in the kitchen? La-la-la",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00004",
    "start_chunk": "00:03:00.263",
    "end_chunk": "00:03:59.154"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored knit cardigan over dark top - dark pants - blonde, curly hair in a half-up style - smiling and animated while singing\nRachel Green: red off-the-shoulder top - red plaid skirt - brown, shoulder-length hair - expression shifts from bored to concerned\nChandler Bing: blue sweater - dark pants - dark, short hair - expression shifts from bored to distressed\nRoss Geller: dark-colored sweater - dark pants - dark, short hair - expression shifts from bored to concerned\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - expression shifts from bored to concerned\nJoey Tribbiani: dark-colored sweater - dark pants - dark, short hair - expression shifts from bored to concerned\nUnidentified person: dark-colored top - dark pants - dark, short hair - expression shifts from bored to concerned\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay performs on stage, playing guitar and singing to an audience. Rachel Green leans on a table, looking bored. Chandler Bing sits with arms crossed, looking distressed. Ross Geller and Monica Geller sit on a couch, looking concerned. Joey Tribbiani sits at a table, looking bored. An unidentified person sits at a table, looking bored. Phoebe Buffay gestures with her hands while singing. Ross Geller stands up and",
    "subtitles": "My mother's ashes Even her eyelashes Are resting in a little yellow jar - And sometimes when it's freezing DAVID: I'm being honest here. You don't agree. - I feel a little sneezy MAX: You're right. And now I... Excuse me? Excuse me? Yeah, noisy boys. Is it something that you'd like to share with the group? No. No, that's okay. Come on, if it's important enough to discuss while I'm playing... ...then I assume it's important enough for everyone else to hear. That guy's going home with a note. [CLEARS THROAT] - Nothing. I was just saying... - Could you speak up? Sorry. I was just saying to my friend, you were the most beautiful woman I'd ever seen. - And you said Daryl Hannah... - Darryl Hannah.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00005",
    "start_chunk": "00:04:00.031",
    "end_chunk": "00:05:01.383"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes take place in Monica's apartment and the Central Perk coffee shop during the evening, with visible Christmas decorations. The location shifts from the apartment to the coffee shop.\n\n**KEY CHARACTERS**\n- Ross Geller: Excited and animated about his new pet monkey, later appears concerned about personal matters.\n- Rachel Green: Initially skeptical of the monkey, later participates in singing.\n- Monica Geller: Concerned about the monkey, later appears supportive.\n- Phoebe Buffay: Surprised by the monkey, later performs by singing and playing guitar.\n- Chandler Bing: Amused by the monkey, later appears distressed.\n- Joey Tribbiani: Observant and engaged with conversations.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Monica's apartment where Ross Geller arrives, much to everyone's surprise, with a pet monkey named Marcel. The group, including Monica, Rachel, Phoebe, and Chandler, discusses whether Ross should be allowed to keep the monkey, with reactions ranging from shock and concern to amusement. Later, the scene shifts to a discussion where Ross talks about his mother's suicide, eliciting worried responses from the group. The setting then transitions to the Central Perk coffee shop, where Phoebe performs a song on stage. Rachel joins her to sing along, while the rest of the group watches. As Phoebe continues her performance, the others, including Chandler, Ross, Monica, and Joey, appear increasingly bored or distressed by her singing.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Introduction of a Pet:** Ross introduces his pet monkey, Marcel, sparking an initial debate among the friends.\n*   **Emotional Depth:** Ross shares a sensitive topic about his mother's suicide, revealing a more vulnerable side.\n*   **Performance and Audience Reaction:** Phoebe's musical performance at Central Perk elicits varied reactions from her friends, highlighting a potential comedic tension between her artistic expression and her friends' tolerance.\n*   **Shift in Setting:** The narrative moves from a private apartment setting to a public coffee shop, suggesting different dynamics and interactions.\n*   **Character Dynamics:** The chunks showcase the friends' diverse reactions to Ross's new pet and Phoebe's performance, reinforcing their established relationships and personalities."
}