{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with festive decorations visible.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored plaid shirt - dark pants - short, dark hair - animated expression\nRachel Green: red long-sleeved shirt under denim vest - patterned skirt - brown hair in ponytail - smiling\nChandler Bing: green turtleneck sweater - dark pants - short, dark hair - smiling\nJoey Tribbiani: light blue denim shirt over dark shirt - dark pants - short, dark hair - relaxed expression\nPhoebe Buffay: dark-colored plaid shirt - dark pants - short, dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Rachel are seated at a table, engaged in conversation. Rachel holds a yellow mug and leans forward to smell its contents. Chandler sits beside them, gesturing with his hands as he speaks. Joey stands nearby, holding a black bag and looking down. Phoebe sits on a nearby couch, appearing concerned as she listens to the conversation. The group is gathered in a festive setting, with Christmas decorations visible in the background.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: yellow (in Rachel's hand), various colors (on tables)\n- Orange couch (center of frame)\n- Wooden table (with mugs and decorations)\n- Christmas tree (in background)\n- Menu board (behind counter)\n- Bar stools (visible near counter)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the \"no-date pact\" with the group, explaining that Chandler and Phoe",
    "subtitles": "[SHOUTS] - You want me to actually throw you...? - I can hop. Now, tell me something, what does the phase \"no-date pact\" mean to you? Look, I'm sorry, okay? It's just that Chandler has somebody and Phoebe has somebody. I thought I'd ask Fun Bobby. - Fun Bobby, your ex-boyfriend, Fun Bobby? - Yeah. You know more than one Fun Bobby? I happen to know a Fun Bob. Okay. Here we go. Whoa, whoa, whoa. There's no room for milk. There. Now there is. Okay, so on our no-date evening... ...three of you now are gonna have dates. - Uh, four. - Four. - Five. - Five.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00011",
    "start_chunk": "00:09:59.265",
    "end_chunk": "00:11:01.618"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with holiday decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: red long-sleeve shirt - denim vest - brown, shoulder-length hair - animated, expressive\nChandler Bing: dark green turtleneck sweater - dark pants - brown, medium-length hair - serious, focused\nRoss Geller: light blue denim shirt - dark turtleneck underneath - dark, short hair - animated, gesturing\nJoey Tribbiani: plaid vest over black shirt - blue jeans - brown, medium-length hair - concerned, gesturing\nPhoebe Buffay: light green top - dark pants - blonde, shoulder-length hair - serious, listening\nUnidentified person: dark jacket - dark pants - dark hair - relaxed, seated\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits at a small table with Chandler, gesturing as she speaks. Ross sits in a green armchair, animatedly talking and gesturing with his hands. Joey enters from the background and sits on the couch next to Phoebe, who listens intently. The group is engaged in conversation, with Ross appearing to be the main speaker, while Rachel and Chandler react to his words.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: yellow and silver (on table)\n-",
    "subtitles": "- Five. - Five. Sorry. Paolo's catching an earlier flight. Yeah, and I met this really hot single mom at the store. Ha, ha. What's an elf to do? Okay, so I'm gonna be the only one standing there alone... ...when the ball drops? Oh, come on. We'll have a big party, and no one will know who's with who. Hey, you know, this is so not what I needed now. - What's the matter? - Oh, it's Marcel. He keeps shutting me out, you know? He's walking around all the time, dragging his hands. That's so weird. I had such a blast with him the other night. - Really? - Yeah, we played. We watched TV. That juggling thing is amazing. What, uh? What juggling thing? With the balled-up socks? I figured you taught him that. No. You know, it wasn't that big a deal. I mean, just balled-up socks. And a melon.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:59.992",
    "end_chunk": "00:11:58.007"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with festive decorations visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - dark pants - blonde, curly hair - smiling and engaged in conversation\nPhoebe Buffay: dark-colored top - dark pants - blonde, curly hair tied up - animated, expressive\nChandler Bing: dark-colored shirt - dark pants - brown, short hair - relaxed, smiling\nRoss Geller: light-colored shirt - dark pants - brown, short hair - serious expression\nJoey Tribbiani: dark-colored shirt - dark pants - brown, short hair - smiling\nUnidentified person: dark-colored shirt - dark pants - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, smiling and talking to Phoebe, who is animatedly responding. Chandler sits beside Rachel, smiling and listening. Ross sits nearby, looking serious. Joey enters from the background, holding a newspaper, and sits down. An unidentified person stands near the counter, looking at the group.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Brick wall decor (background)\n- Menu board (behind counter)\n- Newspaper (held by Joey)\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses going to Minsk with David, expressing excitement. The conversation has a casual tone, with Phoebe appearing animated and Rachel smiling and",
    "subtitles": "- Phoebe. Hi. - Hi, Max. Do you know everybody? No. Have you seen David? No, he hasn't been around. Well, if you see him, tell him to pack his bags. We are going to Minsk. - Minsk? - Minsk. It's in Russia. I know where Minsk is. Ha, ha. We got the grant. Three years, all expenses paid. So when do you leave? January 1 st. [KNOCKING ON DOOR] Hello? - Hey. Hi. Hi. - Hi. - What are you doing here? - Um, well, Max told me about Minsk. So you know, congratulations. This is so exciting! MAX: Yeah. It'd be even more exciting, if we were going. Oh, you're not going? Oh, why? Tell her, David.",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00013",
    "start_chunk": "00:12:02.471",
    "end_chunk": "00:13:00.862"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nThe lab at Central Perk — daytime, bright artificial lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: plaid shirt - light-colored t-shirt underneath - dark hair, short - animated expression\nRachel Green: dark-colored dress - patterned jacket - long, curly blonde hair - smiling expression\nUnidentified person: dark cardigan - light-colored t-shirt - medium-length brown hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Rachel stand near a lab counter, engaged in an animated conversation. Ross gestures with his hands while speaking, and Rachel listens, smiling and occasionally responding. The unidentified person enters the scene, walks toward the counter, and gestures while talking. Ross and Rachel then turn to face the unidentified person, continuing their conversation. Ross and Rachel share a hug, indicating a warm, affectionate interaction.\n\n### **OBJECTS AND PROPS:**\n- Lab equipment: various machines and devices (on counter and shelves)\n- Whiteboard: with mathematical equations written on it\n- Computer monitor: on a desk in the background\n- First aid station sign: visible on the wall\n- Orange stool: near the counter\n\n### **DIALOGUE CONTEXT:**\nRoss discusses his decision about going to Minsk with Rachel. The conversation has a casual, slightly tense tone, with Ross appearing concerned and Rachel reacting with concern and then smiling. The unidentified person appears to be offering advice or encouragement.\n\n### **TEMPORAL NOTES:**\n",
    "subtitles": "Tell her, David. \"I don't want to go to Minsk to work with Lipson and Yamaguchi and Flank. No, no, no. I want to stay here and make out with my girlfriend.\" Okay, thank you, Max. Thank you. So you're really not going? I don't know. I don't know what I'm gonna do. I just... You decide. - Oh, don't do that. - Please? No, but I'm asking you. I can't make a decision. - I can't. Please, just... - Okay. Stay. - Stay. - Stay. Getting so good at that. It was Max's stuff. [R.E.M.'S \"SHINY HAPPY PEOPLE\" PLAYING] I love this artichoke thing. Oh, don't tell me what's in it. The diet starts tomorrow. [LAUGHING NASALLY]",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:59.779",
    "end_chunk": "00:14:00.839"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with Christmas decorations visible.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored dress - silver satin dress - dark, shoulder-length hair - smiling, animated\nRoss Geller: dark suit - white shirt - dark tie - dark, short hair - serious, concerned\nRachel Green: dark-colored dress - off-the-shoulder, dark blue dress - curly, reddish-brown hair - smiling, engaged\nChandler Bing: dark jacket over white shirt - dark pants - brown, medium-length hair - smiling, relaxed\nJoey Tribbiani: dark jacket over white shirt - dark pants - brown, medium-length hair - smiling, relaxed\nUnidentified person: dark suit - white shirt - dark tie - dark, short hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nMonica enters the apartment, smiling and holding a champagne flute, greeting guests. Ross and Rachel stand near the doorway, smiling and interacting with Monica. Chandler and Joey stand near the kitchen area, smiling and observing the scene. Ross gestures animatedly while speaking to Monica, who responds with a serious expression. A monkey appears on Ross’s shoulder, causing him to look surprised. Monica gestures with her hand while speaking to Ross, who appears concerned. The group continues to interact, with Monica and Ross engaged in conversation.\n\n### **OBJECTS AND PROPS:**\n- Champagne glasses: clear (held by characters)\n- Christmas decorations: red and silver tinsel, star ornament (on door frame)\n- Refrigerator: white (with magnets and notes)\n- Table: wooden, with food and drinks\n-",
    "subtitles": "[LAUGHING NASALLY] You remember Janice. Vividly. [KNOCKING ON DOOR] MONICA: Hi. - Hi, I'm Sandy. Sandy, hi. Come on in. Hey. Ha, ha. - You brought your kids. - Yeah. That's okay, right? Party. That thing is not coming in here. \"That thing\"? This is how you greet guests at a party? Let me ask you something. If I showed up with my new girlfriend... ...she wouldn't be welcome? I'm thinking your new girlfriend wouldn't urinate on my coffee table. He was more embarrassed about that than anyone. Okay? And for him to have the courage to walk back in here...",
    "episode": "1x10 - The One with the Monkey",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:59.129",
    "end_chunk": "00:15:02.650"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place primarily in the Central Perk coffee shop, transitioning from evening to daytime. Later, the scene shifts to a laboratory setting before concluding in Monica's apartment living room in the evening.\n\n**KEY CHARACTERS**\nRoss Geller: A central figure, animated and often concerned in conversations.\nRachel Green: Engaged in discussions with Ross and others, often smiling.\nChandler Bing: A relaxed participant in group conversations.\nJoey Tribbiani: Joins group discussions, sometimes appearing concerned.\nPhoebe Buffay: Appears concerned and later excited about plans.\nMonica Geller: Greets guests in her apartment.\nAn unidentified person: Appears in discussions and offers advice.\n\n**MERGED NARRATIVE SUMMARY**\nThe group gathers at Central Perk in the evening, where Ross discusses a \"no-date pact\" and his potential trip to Minsk. Phoebe expresses excitement about going to Minsk with David. The conversation shifts to Ross's decision about going to Minsk, which he discusses with Rachel, who reacts with concern. The setting then moves to a lab where Ross and Rachel continue their animated conversation. Later, in Monica's apartment, the group is celebrating with Christmas decorations. A monkey unexpectedly appears on Ross's shoulder, surprising him and prompting a concerned interaction with Monica.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Ross and Rachel have a series of conversations, showing moments of concern and affection.\n*   **Emotional Tone:** The early conversations are animated and casual, shifting to concern regarding Ross's decisions, and then excitement from Phoebe. The arrival of the monkey creates surprise and a shift in the atmosphere.\n*   **Plot Setup or Payoff:** Phoebe's excitement about Minsk sets up a potential plotline. The monkey's appearance is a sudden, notable event.\n*   **Notable Transitions between Locations or Conversations:** The narrative moves from the coffee shop to a lab and finally to an apartment, with each location hosting discussions related to Ross's potential trip and culminating in the unexpected monkey incident."
}