{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm interior lighting with visible lamps and decorative items.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored pajama top - dark pants - brown hair in a bun - expression shifts from concerned to amused\nPhoebe Buffay: striped long-sleeve top - dark pants - blonde hair in a high ponytail - expression animated, smiling\nMonica Geller: dark-colored pajama top - dark pants - dark hair tied back - expression animated, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nA delivery person enters with a pizza box, which Monica and Rachel greet. Monica takes the pizza, and Rachel and Phoebe examine it. They then move to the kitchen area, where Rachel and Phoebe begin to open the box while Monica gestures and talks. Phoebe uses binoculars to look out the window, while Monica and Rachel watch her and react with expressions of surprise and amusement.\n\n### **OBJECTS AND PROPS:**\n- Pizza box: white with red lettering (held by delivery person, then by Monica and Rachel)\n- Binoculars: black (held by Phoebe)\n- Kitchen counter: blue shelves with various items\n- Table: covered with a floral tablecloth\n- Window: black-framed with multiple panes\n- Flower arrangement: in a",
    "subtitles": "- Oh, God. - Oh. Oh. - Oh, my God. - You want me to take this back? What? Are you nuts? We've got George Stephanopoulos' pizza. Here. - Uh, Pheebs? - Yeah? Who's George Snuffleupagus? That's Big Bird's friend. [LAUGHS] I see pizza. PHOEBE: Oh, I wanna see. Let me see. Let me see. Hello? Who are we spying on? You know the White House adviser? Clinton's campaign guy? The one with the great hair, sexy smile, really cute butt? Oh, him. The little guy. Oh, I love him. Ooh. Oh, wait. Wait, I see a woman. Tell me it's his mother. - Definitely not his mother. - Oh, no. Oh, wait, she's walking across the floor. She's walking, she's walking. She's going for the pizza. Hey, that's not for you, bitch!",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:59.273",
    "end_chunk": "00:15:56.746"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment rooftop patio — nighttime — dim, candlelit ambiance with interior lights visible through windows.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored pajama top - pajama pants - brown hair in a messy bun - smiling, relaxed\nMonica Geller: dark-colored pajama top - pajama pants - dark hair tied back - expression shifts from concerned to amused\nPhoebe Buffay: striped pajama top - pajama pants - blonde hair in a high ponytail - expression shifts from focused to amused\n\n### **ACTIONS AND INTERACTIONS:**\nRachel, Monica, and Phoebe are gathered on the rooftop patio, each holding a drink. Monica stands near the railing, gesturing as she speaks to Rachel, who is seated and sipping her drink. Phoebe stands beside them, holding her drink and looking between the two. The three appear to be engaged in a casual, lighthearted conversation, with Rachel smiling and Monica laughing at something Phoebe says. The scene transitions to an interior shot of the apartment, where Monica and Phoebe are seen standing near the window, looking out at the rooftop.\n\n### **OBJECTS AND PROPS:**\n- Drinks: clear glasses with pinkish liquid (in hands)\n- Candles: lit, placed on a small table\n- Brick wall: surrounding the patio area\n- Window: large, with visible interior decor\n- Red and white checkered blanket:",
    "subtitles": "WOMAN [OVER PA]: Dr. Max to Center 456. Dr. Max to Center 456. [WHOOSHES] Excuse me. We've been here for over an hour... ...and people less sick than my friend have gone in. I mean, that guy with the toe thing? Who's he sleeping with? Oh, come on, Dora. Don't be mad. I know we both said some things... ...we didn't mean... ...but that doesn't mean we still don't love each other. You know, I feel like I've lost her. [YELLS] - Lights still out? - Yeah. Well, maybe they're napping. Heh. Please. They're having sex. MONICA & PHOEBE: Shut up. So, what do you think George is like? - I think he's shy. - Oh, yeah?",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00017",
    "start_chunk": "00:16:01.835",
    "end_chunk": "00:17:01.811"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nA dimly lit, cozy indoor space with brick walls and candles — likely Monica’s apartment — evening, warm ambient lighting.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored plaid shirt - unclear lower clothing - dark hair in messy bun - smiling and animated\nMonica Geller: dark-colored pajamas - unclear lower clothing - dark hair down - smiling and relaxed\nPhoebe Buffay: light-colored robe - unclear lower clothing - blonde hair down - smiling and relaxed\nRoss Geller: yellow jacket - light-colored pants - dark hair - serious expression\nChandler Bing: dark-colored button-up shirt - blue jeans - dark hair under blue cap - animated expression\nJoey Tribbiani: white shirt under dark jacket - dark pants - dark hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel, Monica, and Phoebe are seated together, sipping drinks and chatting casually. Ross, Chandler, and Joey are in a hospital waiting room, sitting on chairs and talking animatedly, with Ross holding a small object and Chandler gesturing while speaking. Joey is seen standing up and moving around the waiting room.\n\n### **OBJECTS AND PROPS:**\n- Drinks with straws (in hands)\n- Candles (on stands)\n- Brick wall decor (background)\n- Hospital chairs (waiting room)\n- Refrigerator (with fruit visible)\n-",
    "subtitles": "- I think he's shy. - Oh, yeah? Yeah. I think you have to draw him out. And then when you do, he's a preppy animal. [ALL LAUGHING] Come on. I remember the moonlight coming in through the open window... ...and her face had the most incredible glow. Yes, the moon, the glow, the magical feeling. You did this part. Could I get some painkillers over here, please? He's right, enough already. What is the big deal about today? So you slept with her for the first time. So what? You slept with her for seven years after that. It's just a little more complicated than that. What? What is it? That she left you? That she likes women? That she left you for a woman that likes women? A little louder. There's a man on the 12th floor in a coma who didn't quite hear you. Then what? My first time with Carol was...",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:59.435",
    "end_chunk": "00:18:00.161"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — daytime, fluorescent lighting\nOutdoor patio at night — evening, candle and ambient lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: yellow jacket - light-colored pants - dark, short hair - animated\nChandler Bing: dark-colored shirt - blue jeans - blue baseball cap - concerned\nJoey Tribbiani: white hockey jersey with \"RANGERS\" - dark pants - dark, medium-length hair - serious\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - smiling\nRachel Green: light-colored robe - dark pants - blonde, tied back - smiling\nPhoebe Buffay: dark-colored top - dark pants - blonde, long hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler sit on a bench, engaged in conversation with Ross gesturing animatedly while holding a small object. Joey, in his hockey jersey, sits in a wheelchair nearby, looking down and then up at the others. The scene cuts to Monica, Rachel, and Phoebe sitting on a patio at night, each holding a drink with straws, laughing and talking. Monica and Rachel are smiling and appear to be enjoying their conversation, while Phoebe leans back with her legs up, also smiling.\n\n### **OBJECTS AND PROPS:**\n- Yellow jacket (Ross)\n- Blue baseball cap (Chandler)\n- White hockey jersey with \"RANGERS\" (Joey)\n- Light-colored robe (Rachel)\n- Dark-colored top (Monica)\n- Drinks with",
    "subtitles": "My first time with Carol was... Was my... [MUMBLES INDISTINCTLY] What? It was my first... ...time. With Carol? Oh. So in your whole life, you've only been with one? Oh. Oh, boy. Hockey was a big mistake. There's a whole bunch of stuff we could've done tonight. Okay. Okay, I got one. Do you remember that vegetarian pâté that I made that you loved so much? Uh-huh. [MONICA & RACHEL GIGGLE] Well, unless goose is a vegetable... - Oh! Oh! MONICA & RACHEL: Ha-ha-ha. Okay, fine, fine. Now I don't feel so bad about sleeping with Jason Hurley. - What? You slept with Jason? - You had already broken up.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:57.493",
    "end_chunk": "00:19:01.389"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nAn outdoor patio or rooftop area at night, characterized by brick walls, a low stone ledge, and dim, warm lighting from candles and a circular wall light.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored fluffy robe - unclear lower clothing - blonde hair in a high ponytail - smiling and animated\nRachel Green: dark-colored pajama top - unclear lower clothing - dark hair tied back - smiling and engaged in conversation\nMonica Geller: dark-colored pajama top - unclear lower clothing - dark hair tied back - smiling and animated\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe sits on the stone ledge, holding a drink with a straw, laughing and gesturing as she speaks. Rachel sits beside her, also holding a drink and smiling while listening and reacting. Monica sits nearby, holding her drink and smiling, occasionally gesturing as she joins the conversation. All three are engaged in a lively, animated discussion while seated on the ledge.\n\n### **OBJECTS AND PROPS:**\n- Drinks with straws: clear plastic cups (held by characters)\n- Stone ledge: low, textured stone barrier (characters sit on)\n- Brick wall: dark brick background\n- Circular wall light: illuminated fixture on the wall\n- Candles: small, lit candles on a small table\n\n### **DIALOGUE CONTEXT:**\n",
    "subtitles": "- What? You slept with Jason? - You had already broken up. - How long? - Just a couple hours. Oh, that's nice. Okay, okay, okay, I got one. Anyway. The valentine Tommy Rollerson left in your locker was really from me. Excuse me? Oh, hello? Like he was really gonna send you one. She was a big girl. [LAUGHS] Really? Well, at least big girls don't pee in their pants in seventh grade. I was laughing. You made me laugh. Oh, my God. There he is. There he is. There he is. - Where? - Right where we've been looking all night. - Oh, he's so cute. - Oh, George, baby, drop the towel. - Come on, drop the towel. RACHEL & PHOEBE: Drop the towel. MONICA: Please drop the towel. Drop it. ALL: Wow. Man, can you believe he's only had sex with one woman?",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:57.594",
    "end_chunk": "00:20:01.991"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place primarily in Monica's apartment, shifting between the living room, a rooftop patio, and an interior space that appears to be part of the apartment. There is also a scene set in a hospital waiting room. The time progresses from evening to night.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Host, animated, engaged in conversations.\n*   **Rachel Green:** Present in apartment scenes, initially concerned then amused and relaxed.\n*   **Phoebe Buffay:** Present in apartment scenes, animated, observant, and relaxed.\n*   **Ross Geller:** In the hospital waiting room, appears serious and animated.\n*   **Chandler Bing:** In the hospital waiting room, animated and concerned.\n*   **Joey Tribbiani:** In the hospital waiting room, initially relaxed then serious.\n\n**MERGED NARRATIVE SUMMARY**\nThe evening begins in Monica's apartment with Monica, Rachel, and Phoebe receiving a pizza delivery and examining it before moving to the kitchen. Phoebe's use of binoculars to look out the window amuses Monica and Rachel. Later, the three women are seen on Monica's rooftop patio, enjoying drinks and casual conversation in a candlelit ambiance. Meanwhile, Ross, Chandler, and Joey are in a hospital waiting room, engaged in conversation with varying expressions of seriousness and animation, with Joey later appearing more withdrawn. The scene then cuts back to Monica, Rachel, and Phoebe, who are continuing their lively conversation and drinking on the patio.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Dual Narrative Strands:** The summary interweaves the relaxed, friendly interactions of the women in the apartment with the more serious atmosphere surrounding the men at the hospital.\n*   **Emotional Contrast:** The cheerful, lighthearted tone of the women's conversations contrasts with the implied concern or seriousness of the men in the hospital.\n*   **Transition to Rooftop:** A clear shift occurs from interior apartment scenes to the outdoor rooftop patio, creating a change in ambiance.\n*   **Hospital Setting:** The presence of Ross, Chandler, and Joey in a hospital waiting room suggests a potential plot development or concern unrelated to the women's gathering.\n*   **Character Dynamics:** The interactions highlight the close friendship between Monica, Rachel, and Phoebe, while also hinting at the dynamics between Ross, Chandler, and Joey in a stressful environment."
}