{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated\nRoss Geller: light-colored shirt - dark pants - short, dark hair - concerned\nRachel Green: dark-colored top - light-colored pants - long, blonde hair - smiling\nChandler Bing: dark-colored sweater - dark pants - short, dark hair - surprised\nJoey Tribbiani: dark-colored shirt - dark pants - short, dark hair - smiling\nPhoebe Buffay: dark-colored top - dark pants - curly, dark hair - smiling\nUnidentified person: dark-colored top - dark pants - dark hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands at the counter, gesturing as she speaks to the group. Rachel sits on the couch, holding a coffee mug and smiling. Chandler and Joey stand near the couch, looking surprised. Phoebe stands near the counter, smiling. Ross stands near the couch, looking concerned. An unidentified person stands near the counter, smiling.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (center of frame)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses the service at the coffee shop with the",
    "subtitles": "By the way, great service today. - Ooh. - Oh, yeah. MONICA: Terrific. - It was excellent. CHANDLER: Unbelievable. And all that milk and stuff? Great. CHANDLER & JOEY: Hockey. - Hockey. Hockey. CHANDLER & JOEY: Hockey. - Hockey. Hockey. Hockey. Rachel? [GASPS] Oh, my God! [ALL SHRIEKING] I swear I've seen birds do this on Wild Kingdom. What are you guys doing here? Well, we were in the city shopping, and your mom said you work here... ...and it's true. Yeah. Look at you in the apron. You look like you're in a play. God, look at you. You are so big. I can't believe it. I know, I know. I'm a duplex.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:59.132",
    "end_chunk": "00:06:00.734"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored shirt - light-colored pants - long, wavy brown hair - smiling, animated\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling, engaged\nPhoebe Buffay: light-colored top - dark pants - curly brown hair - smiling, laughing\nUnidentified person: dark-colored top - dark pants - dark hair - smiling, laughing\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green stands and gestures while speaking to Monica Geller and Phoebe Buffay, who are both laughing and reacting to her. Monica Geller holds a shopping bag and smiles while looking at Rachel. Phoebe Buffay stands beside Monica, also smiling and engaged in the conversation. The group appears to be celebrating or reacting to news, as indicated by their animated expressions and gestures.\n\n### **OBJECTS AND PROPS:**\n- Shopping bags: various colors (in hands)\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses her father's news with Monica Geller and Phoebe Buffay. The conversation has a happy, excited tone, with Rachel appearing animated and Monica and Phoebe reacting by laughing and smiling.\n\n### **TEMPORAL NOTES:**\nNone",
    "subtitles": "I know, I know. I'm a duplex. RACHEL: So, what's going on with you? Well, guess who my dad's making partner in his firm. [ALL SHRIEK] And while we're on the subject of news... [ALL SHRIEK] Look, look. I have elbows. [BOTH SHRIEK] Passes it up to Leetch. Leetch spots Messier in the crease. Here's the pass. Oh. Oh. We'll take a time-out while Messier stops to look at some women's shoes. Carol was wearing boots just like those the night that we first... ...you know. In fact, she, uh... She never took them off. Ha, ha. It's because we... Sorry. Sorry. I can't believe... [ROSS SIGHS] - What? - Peach pit. Yes, bunny?",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:58.191",
    "end_chunk": "00:06:58.583"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored shirt - unclear lower clothing - brown, shoulder-length hair - smiling and animated\nUnidentified person: dark-colored top - unclear lower clothing - dark, curly hair - smiling\nUnidentified person: dark-colored top - unclear lower clothing - dark, curly hair - smiling\nUnidentified person: dark-colored top - unclear lower clothing - dark, curly hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green sits on a couch, smiling and talking animatedly to the other women seated around her. The other women are engaged in conversation, with one gesturing while speaking. All characters remain seated throughout the clip, interacting casually with each other.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tables)\n- Orange couch (center of frame)\n- Wooden tables (with drinks and snacks)\n- Flower arrangements (on tables)\n- Shopping bags (on floor near tables)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses her job as a waitress with the other women. The conversation has a casual, joking tone, with Rachel appearing animated and the other women reacting with smiles and nods.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "Peach pit. - That night, we, uh, had... - Peaches? Actually, nectarines, but basically. - Could've been a peach. - Then we, uh... Then we got dressed and I walked her to... ...the bus stop. I'm fine. Hey, that woman's got an ass like Carol's. What? I thought we were trying to find stuff. Oh, come on, you guys. Tell me all the dirt. Well, the biggest news is still you dumping Barry at the altar. - All right, let's talk reality for a second. - Okay. - When are you coming home? - What? Guys, I'm not. - Heh. Come on. This is us. - I'm not. This is what I'm doing now. I've got this job. Waitressing? Heh. I'm not just waitressing.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00008",
    "start_chunk": "00:07:00.128",
    "end_chunk": "00:08:01.062"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored shirt - patterned skirt - long, brown, wavy hair - animated\nPhoebe Buffay: dark-colored sweater - dark pants - curly, reddish-brown hair - surprised\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, gesturing expressively while speaking to Phoebe, who is seated across from her. Monica enters the scene from the kitchen area, holding a blender, and joins them at the table. Rachel and Monica interact with each other, with Rachel holding a glass and Monica gesturing while talking. Phoebe reacts with surprise to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Patterned cushions (on couch)\n- Wooden table (center of frame)\n- Vase with flowers (on table)\n- Shopping bags (on floor)\n- Blender (held by Monica)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses having a slumber party with Monica and Phoebe, mentioning cookie dough and Twister. The conversation has a casual, joking tone, with Rachel appearing animated and Monica reacting with surprise. Phoebe appears surprised by the conversation.\n\n### **TEMPORAL NOTES:**\nMonica enters the frame from the kitchen area\nRachel picks up",
    "subtitles": "Heh. I'm not just waitressing. I mean, I'm... I, um... I write the specials on the specials board. And I take the dead flowers out of the vase. Um, oh, and sometimes Arturo lets me put the little chocolate blobbies on the cookies. Well, your mom didn't tell us about the blobbies. [WHIRRING] MONICA: Hey, Rach. How was it with your friends? [MONICA & PHOEBE SHRIEK] Okay, how would you like some Tiki Death Punch? What's that? - Well, it's rum and... - Okay. We thought since Phoebe's staying over we'd have a slumber party. We got some trashy magazines, we got cookie dough, we got Twister. [PHONE RINGS] Ooh, ooh. And I brought Operation.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:58.311",
    "end_chunk": "00:08:59.871"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and window glow.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored pajama top - dark pants - dark, tied-back hair - animated, smiling\nRachel Green: dark-colored shirt - dark pants - brown, shoulder-length hair - concerned, then animated\nPhoebe Buffay: striped long-sleeve top - dark pants - blonde, high ponytail - smiling, holding a game box\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe enters holding an \"Operation\" game box and presents it to Monica and Rachel. Monica, holding a large, old-style cordless phone, answers a call while Rachel sits on the couch, gesturing and speaking animatedly. Monica listens intently, then responds while holding the phone, occasionally looking at Rachel. Rachel stands up and gestures emphatically while talking, then sits back down. Monica continues her phone conversation, looking concerned and then amused.\n\n### **OBJECTS AND PROPS:**\n- \"Operation\" game box: red and white (held by Phoebe)\n- Cordless phone: gray (held by Monica)\n- Coffee mugs: unclear (on table)\n- Orange couch (center of frame)\n- Wooden coffee table (with items)\n- Refrigerator: white, with magnets (visible in background)\n- Lamp",
    "subtitles": "But I lost the tweezers, so we can't operate. But we can prep the guy. Rach, it's the Visa-card people. Oh, God. Ask them what they want. Could you please tell me what this is in reference to? Yes, hold on. Um, they say there's been unusual activity on your account. - But I haven't used my card in weeks. - That is the unusual activity. They just wanna see if you're okay. They wanna know if I'm okay? Okay, they wanna know if I'm okay. Okay, let's see. Well, let's see. The FICA guys took all my money. Everyone I know is either getting married or getting pregnant or getting promoted... ...and I'm getting coffee. And it's not even for me. So if that sounds like I'm okay, okay, then you can tell them I'm okay. Okay? Uh, Rachel has left the building. - Can you call back? - All right. Come on.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00010",
    "start_chunk": "00:09:00.039",
    "end_chunk": "00:10:01.516"
  },
  "summary": "**SCENE OVERVIEW**\nThe scene begins in the Central Perk coffee shop during the daytime and transitions to Monica's apartment living room in the evening.\n\n**KEY CHARACTERS**\n- Monica Geller: Hosting conversations, initially discussing service and later involved in planning a slumber party and a phone call.\n- Rachel Green: Sharing news about her father and discussing her job, later planning a slumber party, and animatedly participating in conversations.\n- Phoebe Buffay: Laughing and reacting to Rachel's news, later surprised by slumber party plans.\n- Ross Geller: Appears briefly looking concerned.\n- Chandler Bing: Appears briefly looking surprised.\n- Unidentified individuals: Present in group interactions.\n\n**MERGED NARRATIVE SUMMARY**\nThe group is gathered at Central Perk, with Monica discussing the coffee shop's service, while Rachel, Phoebe, and others share animated conversations. Rachel excitedly shares news about her father and discusses her job as a waitress with her friends. Later, Rachel proposes a slumber party, complete with cookie dough and Twister, which elicits surprise from Monica and Phoebe. As evening arrives, the scene shifts to Monica's apartment. Phoebe arrives with the game \"Operation,\" while Monica takes a phone call that shifts from concern to amusement. Rachel is also animatedly involved in the ongoing conversations and activities.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Casual interactions and shared humor among friends.\n*   **Emotional Tone:** The initial scenes are lighthearted and humorous, with a shift to planning and later, a mix of concern and amusement during a phone call.\n*   **Plot Setup:** The planning of a slumber party and the setup for a potentially significant phone call.\n*   **Notable Transitions:** A clear transition from the public space of Central Perk to the private setting of Monica's apartment."
}