{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with visible lamps and candles.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored top - dark pants - long, blonde hair - animated\nChandler Bing: dark-colored shirt - blue jeans - brown, medium-length hair - relaxed\nRachel Green: dark-colored top - dark pants - shoulder-length, brown hair - serious\nMonica Geller: dark-colored blazer - black top - dark, shoulder-length hair - expressive\nRoss Geller: light-colored, striped shirt - light-colored pants - dark, short hair - surprised\nJoey Tribbiani: dark-colored shirt - blue jeans - brown, medium-length hair - concerned\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe sits on the couch, gesturing expressively while speaking to Chandler, who holds a mug and listens. Rachel sits nearby, looking concerned and occasionally gesturing. Monica sits in a chair, speaking animatedly and gesturing with her hand. Ross sits in a chair, holding a magazine and looking surprised as he listens. Joey enters from the background, holding a magazine, and sits down at the table.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with items on it)\n- Brick wall decor (background)\n- Menu board (behind counter)\n- Flower vase (on table)\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses what she would do if she were omnipotent, mentioning world peace and bigger boobs. The conversation has a casual, joking tone, with Phoebe appearing animated and Chandler reacting with a smirk. Monica and Ross are listening, with Monica appearing expressive and Ross looking surprised.\n\n### **TEMPORAL NOTES:**\nJoey enters the frame from the background and sits down at the table.",
    "subtitles": "PHOEBE: Oh, that's good. - Okay. All right, Phoebe? - Okay, okay. If I were omnipotent for a day, I would want, um, world peace... ...no more hunger, good things for the rain forest. And bigger boobs. Well, see, you took mine, so... Chandler, what about you? If I were omnipotent for a day, I'd make myself omnipotent forever. Heh. See, there's always one guy. \"If I had a wish, I'd wish for three more wishes.\" [ALL CHUCKLE] ROSS & MONICA: Hey, Joey. - Hey, buddy. What would you do if you were omnipotent? Probably kill myself. Excuse me? Hey, if Little Joey's dead, then I got no reason to live, you know? Joey, uh, omnipotent. You are? Ross, I'm...",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:02.168",
    "end_chunk": "00:00:56.930"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - light-colored pants - dark, short hair - expression: animated, talking\nRachel Green: dark-colored top - patterned skirt - long, wavy brown hair - expression: concerned, listening\nMonica Geller: dark-colored jacket - dark top - dark, shoulder-length hair - expression: serious, gesturing\nChandler Bing: dark sweater - dark pants - short, brown hair - expression: relaxed, listening\nJoey Tribbiani: dark-colored shirt - dark pants - dark, medium-length hair - expression: smiling, engaged\nPhoebe Buffay: light-colored top - dark pants - long, blonde hair - expression: smiling, animated\nUnidentified person: dark-colored shirt - dark pants - dark hair - expression: not visible\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits on the couch, holding a newspaper and talking animatedly to Chandler Bing, who is seated beside him. Rachel Green stands nearby, looking concerned and gesturing as she speaks. Monica Geller sits in an armchair, gesturing expressively while talking to Ross. Joey Tribbiani sits at a table, smiling and engaged in the conversation. Phoebe Buffay sits on the couch, smiling and listening to the group. The group is gathered in the coffee shop, interacting and conversing.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tables)\n- Orange couch (center of frame)\n- Wooden tables (with magazines and mugs)\n- Brick wall decor (background)\n- Menu board (behind counter)\n- Newspaper (held by Ross Geller)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses a topic with Chandler Bing, while Rachel Green reacts with concern. The conversation has a casual tone, with Ross appearing animated and Chandler relaxed. Monica Geller gestures while speaking, and the group listens attentively.\n\n### **TEMPORAL NOTES:**\nRoss Geller stands up from the couch and walks toward the counter. Chandler Bing remains seated throughout. Rachel Green moves from standing to sitting on",
    "subtitles": "How does she do that? I cannot sleep in a public place. Would you look at her? - She's so peaceful. - Yeah. [BOTH SCREAM]",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:49.275",
    "end_chunk": "00:02:00.994"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - light-colored pants - dark, short hair - animated, talking\nRachel Green: dark-colored top - purple pants - long, blonde hair - smiling, engaged in conversation\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - relaxed, listening\nChandler Bing: dark-colored sweater - dark pants - dark, medium-length hair - smiling, listening\nJoey Tribbiani: dark-colored shirt - dark pants - dark, medium-length hair - standing, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits on the couch holding a book, talking animatedly to Rachel Green, who holds a coffee mug and responds. Monica Geller sits in an armchair, listening to the conversation. Chandler Bing joins them on the couch, smiling and interacting with Ross. Joey Tribbiani enters the scene, walks toward the group, and gestures while talking to Ross and Chandler.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with magazines and flowers)\n- Brick wall decor (",
    "subtitles": "[BOTH SCREAM] What? What? Hi. It's okay, you know. You just nodded off again. - Oh. - What's going on with you? - I got no sleep last night. ROSS: Why? My grandmother has this new boyfriend... ...and they're both kind of insecure in bed, so... And deaf. So they're constantly having to reassure each other that they're having a good time. You have no idea how loud they are. - You can stay with Rachel and me tonight. - Thanks. Ninety-five, 96, 97. See, I told you. Less than 100 steps from our place to here. You got way too much free time, man. Hey, there's the birthday boy. Ross, check it out. Hockey tickets. Rangers-Penguins tonight at the Garden. We're taking you. - Happy birthday, pal. - We love you, man. [ROSS CHUCKLES] It's funny, my birthday was seven months ago. - So? - So I'm guessing you had an extra ticket...",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:59.828",
    "end_chunk": "00:03:00.095"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with visible brick walls and decor.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark pants - dark, short hair - concerned/animated expression\nChandler Bing: dark sweater - dark pants - dark, medium-length hair - smiling/relaxed expression\nRachel Green: dark-colored top - purple pants - long, wavy brown hair - smiling expression\nUnidentified person: dark-colored top - light-colored pants - dark hair - standing, hand on couch back\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler are seated on the orange couch, engaged in conversation. Ross holds a card and gestures while speaking, then stands up and walks away. Chandler remains seated, looking at Ross as he leaves. Rachel sits to their right, smiling and listening. An unidentified person stands behind the couch, placing a hand on the backrest.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Coffee mugs: various colors (on table)\n- Flower arrangement: pink and yellow flowers (on table)\n- Wooden table (in front of couch)\n- Brick wall decor (background)\n- Menu board (behind counter",
    "subtitles": "- So? - So I'm guessing you had an extra ticket... ...and couldn't decide which one of you got to bring a date? Huh? Well, aren't we Mr. The-Glass-is-Half-Empty? Oh, my God. Oh. Is today the 20th? October 20th? - I was hoping you wouldn't remember. - Oh. What's wrong with the 20th? Eleven days before Halloween? All the good costumes are gone? Today's the day Carol and I... ...first consummated... ...our physical relationship. We had sex. You know what? I better pass on the game. I think I'm just gonna go home and think about my ex-wife and her lesbian lover. The hell with hockey. Let's all do that. Come on, Ross. You, me, Joey, ice? Guys' night out? Come on, what do you say, big guy? Huh? Huh? Huh? - What are you doing? - I have no idea. Come on, Ross. All right, all right. Maybe it will take my mind off it.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:57.760",
    "end_chunk": "00:04:01.156"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with visible neon signs and brick walls.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - purple pants - long, wavy brown hair - relaxed, holding a yellow mug\nMonica Geller: dark-colored sweater - jeans - dark, tied-back hair - animated, holding and reading a check\nChandler Bing: dark-colored sweater - dark pants - short, brown hair - serious, standing with hands on couch\nJoey Tribbiani: light-colored shirt - dark pants - short, brown hair - smiling, standing near couch\nRoss Geller: light-colored striped shirt - dark pants - short, dark hair - serious, standing near couch\nPhoebe Buffay: dark top - light-colored pants - long, blonde hair - concerned, standing near bar\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands holding a check, reading it aloud with an animated expression while the others watch. Rachel sits on the couch, holding a yellow mug and listening. Chandler, Joey, and Ross stand near the couch, looking at Monica with expressions ranging from serious to concerned. Phoebe stands near the bar, looking on. The group is gathered around the central orange couch, engaged in a conversation about the check.\n\n### **OBJECT",
    "subtitles": "All right, all right. Maybe it will take my mind off it. - You promise to buy me a big foam finger? JOEY: You got it. - All right. - Look, look, look. My first paycheck. [ALL CHATTERING] Look at the window. There's my name. Hi, me. I remember the day I got my first paycheck. There was a cave-in in one of the mines, and eight people were killed. Wow, you worked in a mine? No, I worked at a Dairy Queen. Why? God, isn't this exciting? I earned this. I wiped tables for it. I steamed milk for it. And it was totally... ...not worth it. Who's FICA? Why's he getting all my money? I mean, what...? Chandler, look at that. Oh, this is not that bad. Oh, you're fine, yeah, for a first job. - You can totally, totally live on this. MONICA: Oh, yeah, yeah. By the way, great service today.",
    "episode": "1x04 - The One with George Stephanopoulos",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:58.363",
    "end_chunk": "00:05:00.382"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in the Central Perk coffee shop across different times of day (evening and daytime), with consistent warm interior lighting. The setting remains the same throughout.\n\n**KEY CHARACTERS**\n- Phoebe Buffay: Initially animated, later concerned.\n- Chandler Bing: Relaxed, engaged in conversations.\n- Rachel Green: Concerned, then smiling and listening.\n- Monica Geller: Expressive and animated, particularly when reading the check.\n- Ross Geller: Surprised, animated in discussion, later concerned.\n- Joey Tribbiani: Concerned, then smiling and engaged.\n\n**MERGED NARRATIVE SUMMARY**\nThe group of friends is gathered at Central Perk, engaged in various conversations. Initially, Phoebe humorously discusses what she would do if she were omnipotent. Later, Ross is animatedly discussing something with Chandler, while Rachel and Monica listen and interject. Ross then stands and walks away from the couch. The focus shifts to Monica, who stands holding and reading a check aloud with an animated expression. The others—Rachel, Chandler, Joey, and Ross—gather around, displaying a range of expressions from serious to concerned as they listen to Monica. Phoebe stands somewhat apart, also looking on with concern.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   The core group of friends consistently congregates at Central Perk, their usual hangout spot.\n*   The interactions showcase a mix of casual banter, active discussion, and more serious moments.\n*   A significant plot point emerges as Monica reads a check aloud, drawing the attention and concern of the entire group.\n*   The scene transitions from individual conversations to a collective focus on Monica's reading of the check."
}