{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA busy pizzeria — daytime, warm artificial lighting with visible menu boards and pizza signage in the background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored coat over a light shirt and patterned tie - dark, neatly styled hair - animated, expressive\nChandler Bing: dark-colored coat over a dark shirt - dark, styled hair - serious, then smiling\nJoey Tribbiani: dark-colored coat over a dark shirt - dark, styled hair - animated, gesturing while talking\n\n### **ACTIONS AND INTERACTIONS:**\nRoss, Chandler, and Joey stand around a blue table with pizza and drinks, engaged in an animated conversation. Ross gestures while speaking, Chandler listens and responds, and Joey holds a napkin and gestures emphatically. They are eating pizza and drinking from white cups, with the background showing other patrons and staff moving around.\n\n### **OBJECTS AND PROPS:**\n- Pizza: large, on a metal tray (on table)\n- White cups: multiple (on table)\n- Menu board: visible in background with \"STUFFED PIZZA CALZONE\" text\n- Blue table: central to the scene\n- Red walls: with circular signs (20\", 16\", 13\") visible\n\n### **DIALOGUE CONTEXT:**\nRoss discusses his plans to woo Rachel with wine and a romantic evening, suggesting she might be interested in him. Chandler and Joey react with amusement and skepticism, with Joey jokingly suggesting Ross take Rachel back to the 1890s. The conversation has a casual, joking tone, with Ross appearing earnest and Chandler and Joey reacting with laughter and disbelief.\n\n### **TEMPORAL NOTES:**\nJoey moves from standing near the table to gesturing toward Ross while speaking.\nRoss picks up and drinks from a white cup.\nChandler gestures with his hands while talking to Ross.",
    "subtitles": "I agree. I'm, like, in disbelief. Don't you think if things were gonna happen with Rachel, they would've happened? I'm telling you, she said she's looking for a relationship... ...with someone exactly like me. She really said that? Well, I added the \"exactly like me\" part. But she said she's looking for someone. And someone is gonna be there tonight. \"Tonight\" tonight? Well, I think it's perfect. It's just gonna be the two of us. She spent all day taking care of my monkey. I can't remember the last time I got a girl to take care of my monkey. [JOEY LAUGHING] Anyway, you know, I figured after work, I'd go pick up a bottle of wine... ...go over there and, uh, try to woo her. Hey, you know what you should do? You should take her back to the 1890s when that phrase was last used. If you keep this up...",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:59.465",
    "end_chunk": "00:06:00.525"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nRachel Green’s apartment living room — daytime, warm indoor lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - plaid skirt - hair in a bun - expression: concerned, animated\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green sits on the couch, interacting with a monkey that climbs on her lap and plays with her shoes. She stands up, walks to the dining table, places the shoes and a newspaper on it, then exits the room. She returns moments later, looking alarmed, and rushes back into the living room after seeing something on the TV screen.\n\n### **OBJECTS AND PROPS:**\n- Monkey: black and white fur (on couch)\n- Shoes: black (held by Rachel)\n- Newspaper: open (on dining table)\n- Couch: white with red and white striped cushions\n- Lamp: wooden base with patterned shade (on side table)\n- Refrigerator: white (in kitchen area)\n- TV: black CRT television (on stand)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses a monkey playing with her shoes and possibly pooping in them, reacting with concern and amusement. The conversation has a casual, slightly exasperated tone, with Rachel appearing animated and concerned as she interacts with the monkey and reacts to events on the TV.\n\n### **TEMPORAL NOTES:**\nRachel Green stands up from the couch\nRachel Green walks to the dining table and places shoes and newspaper down\nRachel Green exits the room\nRachel Green returns to the living room, looking alarmed\nRachel Green rushes back into the living room after seeing something on the TV",
    "subtitles": "If you keep this up... ...you'll be finished with this sucker by the end of the week. Now, the one in the feathered boa, that's Dr. Francis. Now, she used to be a man. Oh, look. See, now, there's Raven. We hate her. We're glad she's dying. And then... What? Marcel. Are you playing with Monica's shoes? You know you're not supposed to... Whoa, whoa. Marcel, did you poo in the shoe? Oh, Marcel. Bad monkey. Oh, God. Oh. Sorry, Barry. A little engagement gift. I'm sure you didn't register for that. [GUNSHOT ON TV] Who died? Who died? Roll him over. Oh, come on, roll him over. Oh! Well, we know it wasn't Dexter, right, Marcel? Because...",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:59.025",
    "end_chunk": "00:07:03.880"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting. The room features a white couch with patterned pillows, a wooden coffee table, and purple walls with visible decor including a framed picture of a deer and a vintage poster.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - plaid skirt - hair in a bun - expression: concerned, animated\nMonica Geller: white shirt - dark pants - dark, shoulder-length hair - expression: serious, engaged\nPhoebe Buffay: patterned top - dark pants - long blonde hair in a braid - expression: concerned, then smiling\nRoss Geller: light-colored blazer - dark pants - short brown hair - expression: concerned, surprised\nChandler Bing: dark long-sleeved shirt - dark pants - short brown hair - expression: concerned, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands holding a white towel, animatedly talking to the group about losing a monkey. Monica confronts Rachel, gesturing with her hands as she speaks. Phoebe enters the room holding a jacket and joins the conversation. Ross and Chandler stand nearby, reacting with concern and gesturing as they listen to the unfolding situation.\n\n### **OBJECTS AND PROPS:**\n- White couch (center of frame)\n- Wooden coffee table (with magazines)\n- Vintage poster (on wall behind TV)\n- Patterned pillows (on couch)\n- Refrigerator (visible in background)\n- TV (on wooden stand)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses losing a monkey named Marcel with the group. The conversation has a tense, concerned tone, with Rachel appearing anxious and Monica reacting with frustration. Phoebe and Ross listen intently, while Chandler gestures as he speaks, trying to calm the situation.\n\n### **TEMPORAL NOTES:**\nPhoebe enters the frame from the left side.\nRachel moves from standing near the couch to walking toward the group.\nMonica gestures toward Rachel while speaking.\nChandler steps forward and begins gesturing as he speaks.",
    "subtitles": "Well, we know it wasn't Dexter, right, Marcel? Because... Marcel? Marcel? Marc...? - How could you lose him? - I don't know, I don't know. We were watching TV, and then he pooped in Monica's shoe... Wait. He pooped in my shoe? Which one? I don't know. The left one. Which ones? Oh, those little clunky Amish things you think go with everything. - Hey. GROUP: Hey. Whoa, oh. Why is the air in here so negative? - Rachel lost Marcel. - Oh, no. How? - He pooped in my shoe. - Which one? Those cute little black ones I wear all the time. No, which one? Ha, ha. The right or left? Because the left one is lucky. Come on, you guys. What am I gonna do? All right, all right, all right. You're a monkey... ...you're loose in the city. Where do you go? Okay, it's his first time out... ...so he's probably gonna want to do some of the touristy things.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:59.460",
    "end_chunk": "00:08:03.148"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nThe apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: white button-up shirt - blue jeans - dark, shoulder-length hair - expression: concerned, animated\nRachel Green: light-colored sweater - plaid skirt - brown hair in a ponytail - expression: animated, frustrated\nPhoebe Buffay: patterned top (orange/red) - black cardigan - long blonde hair - expression: concerned, listening\nChandler Bing: light-colored shirt - dark pants - brown hair - expression: serious, listening\nJoey Tribbiani: dark-colored shirt - dark pants - brown hair - expression: not visible (off-screen or obscured)\nRoss Geller: light-colored jacket - dark shirt - dark hair - expression: animated, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Rachel are arguing animatedly while holding a white cloth, gesturing toward each other and Ross. Phoebe stands nearby, listening with concern. Ross gestures emphatically while speaking to Rachel. Monica walks toward the door, followed by Phoebe, and they exit the apartment to speak with Mr. Heckles. Chandler stands near the doorway, observing the interaction.\n\n### **OBJECTS AND PROPS:**\n- White cloth (held by Rachel)\n- Refrigerator (white, with magnets, visible in background)\n- Wooden table (center of room)\n- Orange couch (with patterned cushions)\n- Framed poster (on wall behind characters)\n- Lamp (on side table, lit)\n\n### **DIALOGUE CONTEXT:**\nMonica and Rachel discuss a lost monkey and a Belgian waffle, with Monica expressing frustration and urgency. Ross is involved in the conversation, gesturing as he speaks. The tone is tense and frantic, with Monica appearing concerned and Rachel animated. Phoebe listens intently, reacting with concern as the situation unfolds.\n\n### **TEMPORAL NOTES:**\nMonica and Phoebe exit the apartment and walk down the hallway.\nMonica and Phoebe approach Mr. Heckles at the door.\nRoss continues gesturing and speaking to Rachel as Monica and Phoebe leave.",
    "subtitles": "...so he's probably gonna want to do some of the touristy things. I'll go to Cats. You go to the Russian Tea Room. Oh, my God! Come on, you guys. He's gonna be home any minute. He's gonna kill me. Start with the building. You take the first and second floor. Phoebe and I will take third and fourth. Whoa, whoa. What am I gonna do? Okay, you stay here and just wait by the phone. Spray Lysol in my shoe and wait for Ross to kill you. Does anybody want to trade? [SIGHS] What do you want? Mr. Heckles, our friend lost a monkey. Have you seen it? I left a Belgian waffle out here. Did you take it? No. Why would you leave your Belgian waffle in the hall? I wasn't ready for it. The monkey, have you seen a monkey? I saw Regis Philbin once. Thank you, Mr. Heckles.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:59.937",
    "end_chunk": "00:08:58.912"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - plaid skirt - brown hair in a bun - expression shifts from concerned to animated\nRoss Geller: dark coat over light shirt and tie - dark pants - dark hair - expression animated, gesturing while speaking\n\n### **ACTIONS AND INTERACTIONS:**\nRachel, on the phone, enters the apartment and hangs up as Ross enters. She turns to him, gesturing excitedly while speaking. Ross, holding a bottle of wine, responds animatedly, gesturing with his hands. Rachel becomes visibly distressed, covering her face with her hands, then turns away. Ross continues talking, holding the wine bottle, as Rachel moves toward the couch.\n\n### **OBJECTS AND PROPS:**\n- Wine bottle: dark-colored (held by Ross)\n- Refrigerator: white, with magnets and photos (visible in background)\n- Blue shelves: filled with food items and books (behind Rachel)\n- Vase with flowers: orange and yellow (on counter)\n- Lamp: lit, on side table (right side of frame)\n- Plaid skirt: worn by Rachel\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a relationship topic with Rachel. The conversation has a tense, serious tone, with Ross appearing animated and Rachel reacting by becoming distressed and covering her face.\n\n### **TEMPORAL NOTES:**\nRachel hangs up the phone and turns to Ross.\nRoss enters the apartment and walks toward Rachel.\nRachel moves toward the couch as Ross continues talking.",
    "subtitles": "You owe me a waffle. Okay, he's a black capuchin monkey with a white face... ...with Russian dressing and pickles on the side. Okay, thanks. - Hi. - Hey. How did it go today? - Oh, great. It went great. Really great. - Yeah. - Hey, is that wine? - Yeah. Yeah. You, uh, want some? - Oh, I would love some. - Yeah. But you know what? You know what? Let's not drink it here. I'm feeling kind of crazy. Do you want to go to Newark? Uh, okay. Yeah. We could do that. But before we head off to the murder capital of the Northeast... ...I was, uh, kind of wanted to run something by you. You know how we were, you know, talking before... ...about relationships and stuff, well... - Oh, God, Ross, I cannot do this. - Okay, quick and painful.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00010",
    "start_chunk": "00:09:00.081",
    "end_chunk": "00:09:55.302"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in a busy pizzeria and then transition to apartments, shifting from daytime to evening.\n\n**KEY CHARACTERS**\n- Ross Geller: Trying to woo Rachel, later concerned and animated in conversations.\n- Chandler Bing: Initially skeptical and amused, later concerned.\n- Joey Tribbiani: Amused and skeptical in early conversations.\n- Rachel Green: Concerned about a monkey, animated and frustrated during arguments, and later distressed.\n- Monica Geller: Concerned and frustrated, particularly about the lost monkey.\n- Phoebe Buffay: Concerned and listening.\n\n**MERGED NARRATIVE SUMMARY**\nIn a pizzeria, Ross discusses his romantic intentions towards Rachel with Chandler and Joey, who are skeptical. Meanwhile, Rachel is at her apartment dealing with a monkey that has gotten into her shoes. Later, in Monica's apartment, Rachel is frantically explaining that she has lost the monkey named Marcel. A tense conversation ensues with Monica expressing frustration, while Ross, Chandler, and Phoebe listen with concern. The argument escalates between Monica and Rachel, involving talk of a Belgian waffle, prompting Monica and Phoebe to leave to speak with a neighbor. Ross remains to talk with Rachel, and the interaction takes a serious turn as Ross brings out a bottle of wine, which leads to Rachel becoming visibly distressed.\n\n**IMPORTANT CONTEXT OR THEMES**\n-   **Relationship Developments:** Ross's attempts to pursue Rachel are ongoing, contrasted with her current distress.\n-   **Emotional Tone:** The narrative shifts from lighthearted amusement in the pizzeria to increasing tension, frustration, and distress as the group deals with the lost monkey and personal issues.\n-   **Plot Setup:** The introduction of the lost monkey and its potential misbehavior sets up a significant point of conflict and worry for Rachel and the group. The mention of Mr. Heckles foreshadows a potential interaction.\n-   **Notable Transitions:** The scene shifts from a public pizzeria to the private setting of apartments, reflecting a change in the nature of the conversations from casual banter to more personal and urgent matters. The transition from daytime to evening also marks a shift in mood."
}