{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting with visible kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - plaid skirt - hair in a bun - expression: animated, concerned\nRoss Geller: dark coat over suit jacket - patterned tie - hair short and dark - expression: concerned, surprised\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands in the living room, gesturing emphatically while speaking to Ross, who stands near the kitchen area holding a bottle. Ross reacts with surprise and concern, looking at Rachel as she explains something. A monkey is briefly visible through a window in the background, adding to the chaotic context of their conversation.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, with magnets and notes (kitchen area)\n- Wooden table: with glasses and a bottle (center of room)\n- Lamp: lit, on a side table (living room)\n- Monkey: black and white, sitting on a table outside the window (visible through glass panes)\n- Flowers: in a vase near the doorway\n\n### **DIALOGUE CONTEXT:**\nRachel discusses losing a monkey named Marcel with Ross. The conversation has a tense, apologetic tone, with Rachel appearing anxious and gesturing frantically while Ross looks increasingly alarmed and frustrated. Ross responds with visible concern, reacting to Rachel’s explanation.\n\n### **TEMPORAL NOTES:**\nRoss removes his coat and walks toward the living room area.\nRachel gestures toward the window where the monkey is visible.\nRoss turns to face Rachel directly as she continues speaking.",
    "subtitles": "Oh, God. Okay, all right. All right, okay. Ross, please don't hate me. Oh, what? What? What? [CHUCKLES] You know Marcel? - Yeah? - Well, ahem. I kind of, uh... I kind of lost him. [INAUDIBLE DIALOGUE] I can't believe this. I mean, all I asked you to do was keep him in the apartment. I know, I know. I'm sorry. You know what? I guess it's partially my fault. I shouldn't have asked you to start off with a monkey. I should have started you off with, like, a pen or a pencil. Ross, I'm doing everything that I can. I've got everybody looking for him and I got... [DOOR BUZZER]",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00011",
    "start_chunk": "00:10:04.228",
    "end_chunk": "00:11:00.200"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nThe apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored sweater - plaid skirt - hair in a messy bun - expression: concerned, then animated\nRoss Geller: light-colored shirt - dark suit jacket - patterned tie - dark pants - hair: short, dark - expression: concerned, then surprised\n\n### **ACTIONS AND INTERACTIONS:**\nRachel and Ross are initially standing and talking animatedly, gesturing with their hands. Rachel turns and walks toward the door, then returns, looking surprised. Ross follows her, looking around the room. Rachel then walks toward the kitchen area. Ross walks toward the living room. Rachel opens the door, and a woman in a leather jacket enters, holding a red pole with a circular attachment. Ross approaches the woman and puts his arm around Rachel, who looks up at him with a surprised expression. The woman in the leather jacket looks at Rachel and Ross, then walks toward the kitchen area.\n\n### **OBJECTS AND PROPS:**\n- Door: blue, with a gold-framed mirror and a brass doorknob\n- Lamp: white lampshade, on a wooden table\n- Refrigerator: white, with magnets and photos on the door\n- Blue shelves: filled with various items, including bottles and books\n- Poster: red and white, on the wall near the door\n- Red pole with circular attachment: held by the woman in the leather jacket\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the situation with Rachel, who is concerned about a monkey. The conversation has a tense tone, with Ross appearing surprised and Rachel looking worried. The woman in the leather jacket enters and speaks to them, causing Rachel to look up at Ross with a surprised expression.\n\n### **TEMPORAL NOTES:**\nRachel walks toward the door and returns.\nRoss walks toward the living room.\nRachel opens the door.\nThe woman in the leather jacket enters the room.\nRoss puts his arm around Rachel.\nThe woman in the leather jacket walks toward the kitchen area.",
    "subtitles": "[DOOR BUZZER] - Who is it? LUISA [OVER INTERCOM]: Animal Control. - See, I've even got Animal Control. - You called Animal Control? Uh-huh. Why? Do you not like them? Heh. Marcel is an illegal exotic animal. I'm not allowed to have him in the city. If they find him, they'll take him away from me. Okay, well, now, see, you never ever, ever told us that. That's right, because I didn't expect you we're gonna invite them to the apartment. [KNOCKING ON DOOR] Hi. Thanks for coming. Somebody called about a monkey? Oh. Oh, you know what? That was a complete misunderstanding. Yeah, we thought we had a monkey, but we didn't. - It turned out it was a hat. - Cat. Cat. What did I say? Hi. We checked the third and fourth floor. - No one's seen Marcel. - Marcel? My uncle Marcel.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:58.741",
    "end_chunk": "00:12:00.427"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - plaid skirt - dark hair tied back - concerned/animated\nRachel Green: white shirt - jeans - dark hair in loose style - smiling/animated\nLuisa Gianetti: dark-colored jacket over light shirt - overalls - dark hair in ponytail - serious/concerned\nPhoebe Buffay: dark-colored top - dark pants - dark hair in loose style - serious/concerned\nRoss Geller: light-colored shirt - dark suit jacket - tie - dark hair - concerned\nJoey Tribbiani: dark-colored shirt - dark pants - dark hair - smiling/relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Rachel stand near the couch, gesturing as they speak to Luisa, who holds a red and silver tool. Ross stands behind Monica, looking concerned. Phoebe and Joey stand near the kitchen area, observing the group. Luisa sits at the table, holding the tool, while Monica and Rachel continue talking to her. Ross moves to stand beside Rachel, listening to the conversation. Joey walks toward the table and sits down, smiling.\n\n### **OBJECTS AND PROPS:**\n- Red and silver tool (held by Luisa)\n- Wooden dining table (center of frame)\n- Refrigerator (with magnets and photos, behind table)\n- Blue kitchen cabinets (visible in background)\n- Orange couch (visible in background)\n- Coffee mugs (on table)\n- Newspaper (on table)\n\n### **DIALOGUE CONTEXT:**\nMonica and Rachel discuss the legal consequences of possessing an illegal exotic animal with Luisa, who is holding a tool. The conversation has a serious tone, with Monica appearing concerned and Luisa reacting with seriousness. Rachel smiles and gestures as she speaks, while Ross looks on with concern.\n\n### **TEMPORAL NOTES:**\nLuisa sits down at the table\nRoss moves to stand beside Rachel\nJoey walks toward the table and sits down",
    "subtitles": "My uncle Marcel. Oh, is that who the monkey's named after? Okay. Are you aware that possession of an illegal exotic is punishable... ...by up to two years in prison and confiscation of the animal. PHOEBE: Oh, my God. You'd put that poor little creature in jail? Pheebs, you remember how we talked about saying things quietly to yourself first? Yes, but there isn't always time. Look, I'm sure there's some friendly way to reconcile this. Um, have a seat. First of all, we haven't been introduced. I'm Monica Geller. Oh, my God, you are. - And you're Rachel Green. - Yeah. Luisa Gianetti. Lincoln High? I sat behind you guys in homeroom. Oh! Luisa. Oh, my God. Monica. It's Luisa! Luisa. From homeroom.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00013",
    "start_chunk": "00:11:59.260",
    "end_chunk": "00:13:01.154"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nMonica Geller: white shirt - jeans - dark, shoulder-length hair - animated\nRachel Green: light-colored sweater - plaid skirt - brown hair in bun - concerned\nPhoebe Buffay: patterned top - dark pants - blonde, long hair - concerned\nRoss Geller: grey suit - patterned tie - dark hair - serious\nUnidentified person: brown jacket with fur collar - beige uniform shirt - hair in braid - serious\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands and gestures animatedly while speaking to the unidentified person, who holds a red and silver tool. Rachel sits at the table with hands clasped, looking concerned. Phoebe and Ross stand nearby, observing the interaction. The unidentified person moves toward the door, exiting the scene.\n\n### **OBJECTS AND PROPS:**\n- Wooden dining table (center)\n- Red and white checkered couch (background)\n- Coffee mug: unclear color (on table)\n- Refrigerator: white, with magnets and papers (background)\n- Blue shelves with various items (background)\n- Red and silver tool (held by unidentified person)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a monkey-related issue with the unidentified person, who is uncooperative and threatens to claim the monkey for herself. The conversation has a tense tone, with Monica appearing animated and the unidentified person appearing serious and determined. Rachel reacts with concern, while Ross and Phoebe observe silently.\n\n### **TEMPORAL NOTES:**\nUnidentified person exits the apartment through the door.",
    "subtitles": "Luisa. From homeroom. Yes! - You have no idea who I am, do you? RACHEL: No. Not at all. Well, maybe that's because you spent four years ignoring me. Would it have been so hard to say, \"Morning, Luisa\"... ...or \"Nice overalls\"? Oh, I'm so sorry. It's not so much you. You were fat. You had your own problems. But you. What a bitch. What? You know what? Be that as it may. You think you could you help us out here on that monkey thing, for old times' sake? Go, Bobcats. I could. But I won't. If I find that monkey, he's mine. [SINGING] Da, da, da Sorry.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:59.111",
    "end_chunk": "00:14:00.171"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nAn apartment hallway — evening, artificial hallway lighting\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored jacket - dark pants - dark, styled hair - expression: concerned, then animated\nJoey Tribbiani: dark-colored shirt - light-colored jeans - dark, styled hair - expression: concerned, then animated\nUnidentified person: pink top - denim shorts - blonde hair in ponytail - expression: smiling, then concerned\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Joey stand in a hallway, looking concerned as they talk to an unidentified woman who opens her door. The woman, wearing a pink top and denim shorts, appears surprised and then concerned as she interacts with them. Chandler gestures animatedly while speaking, and Joey stands beside him, listening. The woman holds a glass of a yellow drink and later crosses her arms while talking to them.\n\n### **OBJECTS AND PROPS:**\n- Glass: yellow liquid (held by unidentified woman)\n- Door: green (with number 5)\n- Wall sign: \"NEIGHBORHOOD WATCH\" (visible behind characters)\n- Radiator: metal, located near wall\n\n### **DIALOGUE CONTEXT:**\nChandler and Joey discuss a monkey they are looking for with the unidentified woman. The conversation has a casual, slightly humorous tone, with Chandler appearing animated and Joey looking concerned. The woman reacts with surprise and concern as they explain their situation.\n\n### **TEMPORAL NOTES:**\nUnidentified person opens door and steps out\nChandler gestures while speaking to the woman\nJoey stands beside Chandler, listening\nUnidentified person crosses arms while talking to them",
    "subtitles": "Sorry. [MARCEL CHATTERING] CHANDLER: Marcel? JOEY: Marcel? - Marcel? - Marcel? Hi, can I help you? Uh, we're kind of having an emergency, and, ahem, we were looking for something. - A monkey. - Yes, have you seen any? No. No, I haven't seen a monkey. Do you know anything about fixing radiators? Sure, sure. Did you try turning the knob back the other way? - Of course. - Oh. Then, no. Taste this daiquiri. Is there too much rum in here? Just a second. Hope you find your monkey. Oh, no, wait. No, no, no. Wait, wait. Um, we may not know about radiators, per se... ...but we do have a certain amount of expertise... ...in the heating and cooling milieu.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:58.671",
    "end_chunk": "00:15:00.773"
  },
  "summary": "**SCENE OVERVIEW**\nThe events unfold in Monica's apartment living room and kitchen, and later an apartment hallway, all during the evening. The scene transitions from the apartment where the main characters are present to a hallway outside.\n\n**KEY CHARACTERS**\n*   **Rachel Green:** Anxious and concerned, explaining a difficult situation.\n*   **Ross Geller:** Initially surprised and concerned, he supports Rachel.\n*   **Monica Geller:** Animated and concerned, trying to resolve a problem.\n*   **Phoebe Buffay:** Observing, concerned.\n*   **Joey Tribbiani:** Initially relaxed, later concerned and animated, involved in searching for something.\n*   **Chandler Bing:** Concerned and animated, involved in searching for something.\n*   **Luisa Gianetti:** A professional (implied legal or animal control) with a serious demeanor, holding a tool.\n*   **Unidentified Person (Animal Control/Officer):** Serious and uncooperative, threatening to claim the subject of the discussion.\n*   **Unidentified Neighbor:** Initially surprised, then concerned, interacting with Joey and Chandler.\n\n**MERGED NARRATIVE SUMMARY**\nIn Monica's apartment living room, Rachel is animatedly explaining to Ross that she has lost a monkey named Marcel. Ross reacts with surprise and concern. The tension escalates as Monica and Rachel discuss the legal implications of possessing an illegal exotic animal with Luisa, who appears to be an official holding a specialized tool. An unidentified person, possibly an animal control officer, also becomes involved, expressing a serious and uncooperative attitude, even threatening to claim the monkey for herself. As this situation unfolds within the apartment, with Phoebe and Ross observing, Monica and Rachel continue to try and manage the issue. Later, the scene shifts to an apartment hallway where Joey and Chandler are seen animatedly searching for something, approaching a neighbor who opens her door. They are inquiring about the monkey, with the neighbor initially surprised and then concerned by their explanation.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Ross offers support to Rachel during a stressful situation, putting his arm around her.\n*   **Emotional Tone:** The overall tone is tense and concerned due to the lost monkey and the involvement of authorities, with moments of animated dialogue and some lightheartedness during the search in the hallway.\n*   **Plot Setup:** The central problem of a lost exotic animal (Marcel the monkey) is established, leading to interactions with officials and a search by the friends.\n*   **Notable Transitions:** The scene transitions from the apartment interior, where the legal and official ramifications are being dealt with, to an external apartment hallway, indicating a shift in the search for Marcel. The introduction of the animal control officer raises the stakes of the situation."
}