{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nApartment hallway — evening, artificial lighting from wall sconces and doorways\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored blazer - dark shirt - dark, styled hair - expression: animated, gesturing\nRoss Geller: dark-colored sweater - dark pants - dark, styled hair - expression: serious, listening\nUnidentified person: light-colored shirt - dark pants - dark hair - expression: smiling\nUnidentified person: pink top - dark pants - blonde hair - expression: smiling\nMonica Geller: white shirt - blue jeans - dark hair - expression: concerned, holding flashlight\nPhoebe Buffay: patterned dress - dark pants - long blonde hair - expression: animated, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Ross stand in the hallway, talking and gesturing animatedly. Two women appear in the doorway, smiling and holding a drink. The scene cuts to Monica and Phoebe in a dimly lit basement, holding a flashlight and talking animatedly while gesturing with their hands.\n\n### **OBJECTS AND PROPS:**\n- Flashlight: red and blue (held by Monica)\n- Door: green (in hallway)\n- Sign: \"DANGER HIGH VOLTAGE\" (on wall in basement)\n- Brick wall: with pipes and electrical boxes (in basement)\n- Staircase: visible in hallway\n\n### **DIALOGUE CONTEXT:**\nChandler and Ross discuss finding a monkey named Marcel with two women. The conversation has a casual, slightly humorous tone, with Chandler appearing animated and Ross appearing serious. Monica and Phoebe react with concern and curiosity while searching for the monkey.\n\n### **TEMPORAL NOTES:**\nScene transitions from hallway to basement\nMonica and Phoebe enter basement from staircase\nChandler and Ross move to different positions in hallway",
    "subtitles": "...in the heating and cooling milieu. Uh, weren't we kind of in the middle of something here? Yes, but these women are very hot and they need our help. And they're very hot. We can't, all right? We're sorry. You have no idea how sorry. But we promised we'd find this monkey. If you see him, he's about yea high and answers to the name Marcel. So if we could get some pictures of you, you'd really be helping us out. Okay, from now on, you don't get to talk to other people. - Marcel? - Marcel. PHOEBE & MONICA: Marcel? Marcel? - Oh, my God. - What? Something just brushed up against my right leg. - What is it? - Oh. Oh, it's okay. It was just my left leg. [MARCEL CHATTERING]",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:58.272",
    "end_chunk": "00:16:00.917"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nA dimly lit, industrial basement or utility room — nighttime — artificial lighting from overhead fixtures and a flashlight.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: light-colored shirt - blue jeans - dark, shoulder-length hair - concerned expression\nPhoebe Buffay: dark-colored dress with red pattern - long, blonde hair - animated, fearful expression\nUnidentified person: dark-colored jacket with fur collar - dark pants - short, dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Phoebe are in a dark basement, holding a flashlight and reacting with fear to something unseen. An unidentified person in a dark jacket enters, draws a gun, and fires, causing Phoebe to scream and fall. Monica reacts with shock and tries to help Phoebe. The scene cuts to a hallway where a capuchin monkey is playing with a banana peel.\n\n### **OBJECTS AND PROPS:**\n- Flashlight: red and black (held by Monica)\n- Gun: black (held by unidentified person)\n- Sofa: red and white patterned (in basement)\n- Banana peel: on carpet (in hallway)\n- Warning signs: \"DANGER HIGH VOLTAGE\" and \"CAUTION\" visible on walls\n\n### **DIALOGUE CONTEXT:**\nMonica and Phoebe are discussing a missing monkey named Marcel. The conversation has a tense, fearful tone, with Monica appearing concerned and Phoebe reacting with panic. The unidentified person is not speaking in the visible frames.\n\n### **TEMPORAL NOTES:**\nPhoebe falls to the ground after being shot.\nMonica helps Phoebe up.\nScene cuts to a hallway with a monkey playing with a banana peel.\nThe scene cuts to Monica and Phoebe walking down a staircase with Ross and Rachel.",
    "subtitles": "[MARCEL CHATTERING] MONICA: Look, Phoebe. Oh, yeah. Oh, Marcel. Come here. - Oh, come here, Marcel. - Step aside, ladies. - What are you gonna do? - Just a small tranquilizer. PHOEBE: Run, Marcel, run! Run, Marcel! - Damn. - Are you okay? Oh, yeah, I think so. Oh. Huh. Whoa. Oh, gosh. ROSS & RACHEL: Marcel. Marcel. This is ridiculous. We've been all over the neighborhood. He's gone. He's just gone. - Ross, you don't know that. - Oh, come on. It's cold, it's dark.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:59.875",
    "end_chunk": "00:17:02.478"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nAn outdoor alleyway between apartment buildings at night — dim, artificial lighting from street lamps and building windows.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored coat - dark skirt and white tights - hair in a messy bun - expression: animated, distressed, then frustrated\nRoss Geller: dark overcoat - light-colored shirt and patterned tie - dark pants - hair: short, dark - expression: animated, exasperated, then pleading\n\n### **ACTIONS AND INTERACTIONS:**\nRoss walks down the alleyway, stopping to talk to Rachel, who is standing near a railing. Rachel appears distressed, gesturing wildly as she speaks, then bends over as if in pain. Ross gestures with his hands, looking concerned and frustrated, as they argue. Rachel turns away from Ross, then turns back to him, continuing to argue. A delivery person in a red uniform walks past carrying a crate of bananas.\n\n### **OBJECTS AND PROPS:**\n- Metal railing: green-painted (along alleyway)\n- Street sign: red and white (visible near Rachel)\n- Crate of bananas: blue and white (carried by delivery person)\n- Building stairs: stone steps with red wooden railings\n- Street lamp: glowing orange light (in background)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses Rachel's actions with her, specifically her breaking a sign and getting a broken foot. The conversation has a tense, frustrated tone, with Ross appearing exasperated and Rachel reacting with animated distress and frustration. Ross gestures emphatically while speaking, and Rachel responds with gestures and facial expressions showing her anger and pain.\n\n### **TEMPORAL NOTES:**\nRachel bends over and appears to be in pain.\nRoss gestures with his hands while talking to Rachel.\nRachel turns away from Ross, then turns back to him.\nDelivery person walks past carrying a crate of bananas.",
    "subtitles": "- Ross, you don't know that. - Oh, come on. It's cold, it's dark. He doesn't know the Village. And now I have a broken foot. Oh, my... I have no monkey and a broken foot. Thank you very much. Ross, you know, I've said I'm sorry, like, a million times. What do you want me to do? Huh? You want me to break my foot too? Here, I'm gonna break my foot right now. Ow! Oh, my God. There, are you happy now? Yeah, yeah. You know, now that you kicked the sign... ...hey, ha, ha, I don't miss Marcel anymore. You know, it's not like I did this on purpose. No, no, no. No, no. This is just vintage Rachel. I mean, things just sort of happen around you. I mean, you're off in Rachel Land, doing your Rachel thing... ...totally oblivious to people's monkeys or to people's feelings and... - I don't even want to hear it. - Ross. - Forget it, okay? - Ross. What? What? Hey, banana man.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:59.309",
    "end_chunk": "00:18:00.745"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nThe apartment hallway and living room — evening, warm interior lighting with some ambient streetlight visible outside.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored shirt - dark pants - dark, short hair - concerned expression\nRachel Green: brown coat over white turtleneck - plaid skirt - short, styled hair - concerned expression\nChandler Bing: dark shirt - dark pants - brown, medium-length hair - surprised expression\nMonica Geller: white shirt - blue jeans - dark, shoulder-length hair - concerned expression\nJoey Tribbiani: dark shirt - dark pants - brown, medium-length hair - surprised expression\nPhoebe Buffay: patterned top - dark pants - long, blonde hair - concerned expression\nUnidentified person: brown robe over white shirt - gray hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller enters the apartment carrying a large box of bananas, followed by a man in a brown robe. The group gathers in the living room, reacting with surprise as Ross places the bananas down. A small monkey wearing pink wings appears on the couch, startling everyone. Ross and the man in the robe react with shock and confusion, trying to locate the monkey. The group stands around the couch, looking at the monkey and each other with expressions of concern and disbelief.\n\n### **OBJECTS AND PROPS:**\n- Box of bananas: blue and white (on floor near couch)\n- Monkey: wearing pink wings (on couch)\n- Red patterned couch (center of frame)\n- Wooden table (near couch)\n- Fish tank (in background)\n- Bookshelf (in background)\n- Lamp (on table)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the monkey with the man in the robe, who appears confused and concerned. The conversation has a tense tone, with Ross appearing anxious and the man in the robe looking serious. The group reacts by looking at each other and the monkey with expressions of shock and concern.\n\n### **TEMPORAL NOTES:**\nRoss Geller enters the apartment carrying the box of bananas.\nThe man in the robe enters the apartment.\nThe monkey appears on the couch.\nRoss Geller places the bananas down.\nThe group gathers around the couch.",
    "subtitles": "Hey, banana man. Oh, this is so intense. One side of my butt is totally asleep and the other side has no idea. Hi. Did you order some bananas? - What about it? - Give me my monkey back. I don't have a monkey. - Then what's with all the bananas? - Potassium. [MARCEL CHATTERING] Marcel? Marcel. Okay, where is he? Where is he? Marcel? Marcel? [ALL GASPING] Marcel. What have you done to him? That's my monkey. That's Patty. Patty the monkey. Are you insane? - Come here, Marcel. Come on. - Come here, Patty. Come here, Marcel. Come here, Patty. Here, monkey. Here, monkey. Here, monkey. Gotcha.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:58.702",
    "end_chunk": "00:19:00.930"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nThe apartment hallway — evening, warm indoor lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - light-colored shirt - patterned tie - dark hair - serious expression\nRachel Green: brown jacket - white turtleneck - hair in a bun - concerned expression\nUnidentified person: dark-colored jacket with fur collar - hair in a braid - stern expression\nUnidentified older man: brown robe - gray hair - concerned expression\nUnidentified person: dark-colored shirt - dark hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nA police officer enters with a monkey in a cage, confronting Ross Geller and Rachel Green. Ross and Rachel argue with the officer, pleading for the return of the monkey. The officer remains firm, and Ross attempts to reason with her, while Rachel gestures emphatically. An older man in a robe stands nearby, watching the interaction with concern. The group remains clustered in the doorway, with Ross and Rachel being the main focus of the conversation.\n\n### **OBJECTS AND PROPS:**\n- Monkey cage: metal, with a red pole (held by officer)\n- Door: green, with a gold number '8' handle\n- Wall decor: framed pictures, abstract art\n- Furniture: wooden table (partially visible), vintage TV set (in background)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the monkey with the police officer, pleading for its return. The conversation has a tense tone, with Ross appearing serious and Rachel reacting by gesturing and speaking animatedly. The officer remains stern, refusing to return the monkey, while the older man watches with concern.\n\n### **TEMPORAL NOTES:**\nRoss Geller steps forward to speak to the officer\nRachel Green gestures toward the officer while speaking\nThe older man shifts his position slightly, observing the scene\nThe officer maintains her stance, holding the cage throughout",
    "subtitles": "Gotcha. - Okay, give me my monkey back. - That's my monkey. You're gonna have to take this up with the judge. That's not my monkey. Just the dress is mine. You can send it back whenever. - All right, I want my monkey. - No. - Oh, come on, Luisa. - Sorry, prom queen. You had to be a bitch in high school, you couldn't have been fat. All right, look, in high school, I was the prom queen... ...and I was the homecoming queen and the class president and you... ...were also there. Look, if you take this monkey... ...I will lose one of the most important people in my life. You can hate me if you want, but please do not punish him. Come on, Luisa, you have a chance to be the bigger person here. Take it. No. All right. Well, then how about I call your supervisor and I tell her... ...that you shot my friend in the ass with a dart.",
    "episode": "1x19 - The One Where The Monkey Gets Away",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:59.471",
    "end_chunk": "00:19:57.570"
  },
  "summary": "**SCENE OVERVIEW**\nThe scene begins in an apartment hallway and a dimly lit basement, then transitions to an outdoor alleyway, and finally returns to the apartment hallway and living room. The time progresses from evening to night and back to evening.\n\n**KEY CHARACTERS**\n*   **Chandler Bing:** Appears animated and humorous in the hallway, later surprised.\n*   **Ross Geller:** Serious and concerned in the hallway and basement, then exasperated and pleading in the alley, and finally anxious and defensive in the apartment.\n*   **Monica Geller:** Concerned and animated in the basement, reacting with shock.\n*   **Phoebe Buffay:** Animated and fearful in the basement, reacting with panic.\n*   **Rachel Green:** Distressed and in pain in the alley, then concerned in the apartment, and finally animatedly arguing with a police officer.\n*   **Marcel (Monkey):** The central focus, initially the subject of discussion, then seen playing with a banana peel, and finally appearing on the couch with wings before being taken by a police officer.\n*   **Unidentified individuals:** Including two women in the hallway, a person in a basement who fires a gun (causing Phoebe's fall), a delivery person with bananas, and an older man in a robe.\n*   **Police Officer:** Stern and firm, confronting Ross and Rachel about the monkey.\n\n**MERGED NARRATIVE SUMMARY**\nIn an apartment hallway, Chandler and Ross discuss the missing monkey, Marcel, with two women. The scene shifts to Monica and Phoebe in a dimly lit basement, searching for Marcel and reacting with fear. An unidentified person enters, draws a gun, and fires, causing Phoebe to scream and fall; Monica rushes to help. The narrative then cuts to a hallway where Marcel is seen playing with a banana peel. Later, in an outdoor alleyway, Ross and Rachel argue intensely; Rachel appears distressed and in pain, while Ross is exasperated. A delivery person passes with a crate of bananas. Back in the apartment, Ross enters with a large box of bananas, followed by an older man. Everyone is surprised when Marcel, now wearing pink wings, appears on the couch. The situation escalates when a police officer arrives with a monkey cage, confronting Ross and Rachel, who plead for Marcel's return, but the officer remains stern.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **The Search for Marcel:** The central plot revolves around the disappearance and recovery of Ross's monkey, Marcel.\n*   **Rising Tension and Danger:** The basement scene introduces a violent element with a gunshot, creating a sense of immediate danger.\n*   **Character Conflict:** The argument between Ross and Rachel in the alley highlights their relationship strain.\n*   **Unexpected Appearances:** Marcel's appearance with wings on the couch adds a surreal and surprising twist.\n*   **Escalation to Authority:** The arrival of the police officer signifies a serious turn of events, moving from a personal issue to a legal confrontation.\n*   **Emotional Dynamics:** The characters display a range of emotions including concern, fear, panic, distress, frustration, surprise, and exasperation throughout the sequence."
}