{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA cluttered utility closet or storage room — nighttime, artificial lighting. The scene transitions to a hospital room with standard medical equipment and warm, ambient lighting.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark pants - dark, short hair - concerned expression\nRachel Green: dark-colored dress - shoulder-length brown hair - smiling expression\nPhoebe Buffay: dark-colored top - long blonde hair - animated expression\nUnidentified person: dark-colored top - long blonde hair - concerned expression\nUnidentified person: dark-colored top - long brown hair - concerned expression\nUnidentified person: white lab coat - dark hair - professional expression\nUnidentified person: dark-colored top - dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss, Rachel, and Phoebe are initially in a cluttered storage room, reacting with concern as they try to open a door. Ross falls to the floor, holding a broom handle. The scene shifts to a hospital room where Rachel stands beside a patient in a hospital gown, holding an orange juice. A doctor in a white coat speaks to the patient while Rachel holds the juice. Ross enters the room, leaning over the patient's bed, gesturing animatedly as he speaks to her. The patient appears to be in labor, with a nurse assisting her.\n\n### **OBJECTS AND PROPS:**\n- Orange juice: orange (in Rachel's hand)\n- Hospital gown: white with blue polka dots (on patient)\n- White lab coat: (on doctor)\n- Broom handle: light-colored (in Ross's hand)\n- Medical equipment: various (in hospital room)\n- Storage items: various (in storage room)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the situation with the patient and the doctor, appearing concerned and animated. Rachel holds an orange juice and listens to the conversation. The tone is tense and serious, with Ross appearing worried and the patient appearing in pain. The doctor speaks calmly, providing reassurance.\n\n### **TEMPORAL NOTES:**\nRoss falls to the floor, holding a broom handle.\nThe scene transitions to a hospital room.\nRoss enters the hospital room and leans over the patient's bed.\nRachel holds an orange juice and listens to the conversation.",
    "subtitles": "Okay, who wants to hear something ironic? PHOEBE & SUSAN: Help! ROSS: Come on! PHOEBE & SUSAN: Help! ROSS: I'm having a baby in there! SUSAN: Hello? - Help! ROSS: Okay, everyone stand back. Ow. Are they here yet? No, honey, but don't worry, we're gonna find them. And until we do, we are all here for you, okay? - Okay. Okay. RACHEL: Okay? Anyway, you were telling me about Paris. It sounds wonderful. It really was. There was this great little pastry shop right by my hotel... [CAROL YELLING] There you go, dear. You... Come on, Lydia, you can do it. Push. Push him out, push him out. Harder, harder. Push him out, push him out. Way out. Let's get that ball and really move. Hey, hey. Ho, ho. Let's get... I was just... Yeah, okay.",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00011",
    "start_chunk": "00:09:59.807",
    "end_chunk": "00:11:01.242"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, bright artificial lighting\nWaiting room — daytime, mixed natural and artificial lighting\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark-colored sweater - unclear lower clothing - dark, styled hair - concerned expression\nPhoebe Buffay: black top - unclear lower clothing - long blonde hair - animated expression\nRachel Green: white shirt with patterned dress - unclear lower clothing - brown, shoulder-length hair - concerned expression\nRoss Geller: light-colored striped shirt - dark pants - short brown hair - surprised expression\nMonica Geller: dark-colored top - unclear lower clothing - dark, tied-back hair - serious expression\nChandler Bing: purple t-shirt under blue hoodie - unclear lower clothing - dark, styled hair - smiling expression\nUnidentified person: dark-colored top - unclear lower clothing - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nJoey stands by a hospital bed, gesturing animatedly while speaking to a person lying in the bed. A nurse enters and interacts with the patient. The scene shifts to a storage room where Phoebe plays a guitar while Rachel and Ross stand nearby, reacting to her music. Ross gestures and speaks to Rachel. The scene then moves to a waiting room where Monica is on a payphone, talking and gesturing. Chandler approaches, takes the phone from her, and speaks into it while she watches with a smile. Monica then hugs Chandler.\n\n### **OBJECTS AND PROPS:**\nHospital bed (with patient)\nGuitar (being played by Phoebe)\nStorage room shelves (with cleaning supplies)\nPayphone (in waiting room)\nSofa (in waiting room)\nCoffee table (in waiting room)\nNo smoking sign (on wall)\nPotted plant (in waiting room)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the birth of a baby with Monica, who is on the phone. The conversation has a tense tone, with Ross appearing concerned and Monica reacting with worry. Chandler joins in, taking the phone and speaking with a more relaxed tone, while Monica smiles and watches him.\n\n### **TEMPORAL NOTES:**\nJoey moves from standing by the bed to exiting the room.\nPhoebe enters the storage room and begins playing guitar.\nRoss and Rachel move from standing to interacting with Phoebe.\nMonica moves from standing to using the payphone.\nChandler enters the waiting room and approaches Monica.\nMonica moves from using the payphone to hugging Chandler.",
    "subtitles": "I was just... Yeah, okay. Push, push, push. What are you gonna do, suck the door open? - Help! Help! Help! - Help! [SINGING] And they found their bodies The very next day And they found their bodies The very next... La, la, la, la, la, la ROSS & SUSAN: Help! No, Mom, everything's going fine, really. Yeah, Ross is great. He's, uh... He's in a whole other place. Yeah. No, he's gone. No, no, you don't have to fly back. Really. What do you mean, this might be your only chance? Oh. Would you stop? I'm only 26. I'm not even thinking about babies yet. [BABY COOING] [SOBBING] [CHANDLER MIMICS STATIC CRACKLING]",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:59.033",
    "end_chunk": "00:11:53.753"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nOB/GYN waiting room — daytime, bright artificial and natural light from windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored hoodie over purple t-shirt - dark pants - dark, short hair - expression: concerned, then animated\nRachel Green: dark-colored tank top - dark pants - shoulder-length brown hair - expression: attentive, then slightly surprised\nUnidentified person: light-colored shirt - dark pants - short dark hair - expression: neutral, seated\nUnidentified person: light-colored shirt - dark pants - short dark hair - expression: neutral, seated\nUnidentified person: light-colored shirt - dark pants - short dark hair - expression: neutral, seated\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller and Rachel Green stand near a coffee machine, interacting with a doctor who is pouring coffee into cups. Ross gestures animatedly while talking to Rachel, who holds a cup and listens. Other patients are seated in the background, some looking at their phones or conversing quietly. The doctor, wearing a white coat and stethoscope, smiles and talks to Rachel while pouring coffee.\n\n### **OBJECTS AND PROPS:**\n- Coffee machine: dark-colored (on counter)\n- Coffee cups: white (held by characters)\n- Stethoscope: blue (around doctor's neck)\n- White coat: worn by doctor\n- Wall-mounted bulletin board: with papers (behind doctor)\n- \"OB/GYN Waiting Room\" sign: blue (on door)\n- \"No Smoking\" sign: red and white (on wall)\n- Framed artwork: mountain scene (on wall)\n- Potted plant: green (in corner)\n- Couch: light-colored (in background)\n- Coffee table: wooden (with magazines)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses his personal life with Rachel Green, mentioning his difficulty attracting women due to his job as a doctor. Rachel responds with a mix of surprise and amusement, reacting to his comments. The conversation has a casual, slightly humorous tone, with Ross appearing animated and Rachel appearing engaged and slightly amused.\n\n### **TEMPORAL NOTES:**\nRoss Geller and Rachel Green move from standing near the door to standing near the coffee machine.\nDoctor enters the room and approaches Rachel Green.\nDoctor pours coffee into cups while talking to Rachel Green.\nRoss Geller gestures with his hands while talking to Rachel Green.",
    "subtitles": "- Where have you been? JOEY: Oh, I just had a baby. Mazel tov. I don't know. It could be an hour, it could be three. But relax, she's doing great. So, uh, tell me, are you currently involved with anyone? No. No, not at... At the moment, no, I'm not, no. - Are you? - No, no. It's hard enough to get women to go out with me. Heh. Right, yeah, I've heard that about cute doctors. No, no, really. I suppose it's because I spend so much time, you know... ...where I do. - Oh. - Mm. I try not to let work affect my personal life, but it's hard when you do... ...what I do. It's like, uh... Well, for instance, what do you do? - I'm a waitress. - Okay, all right. Well, aren't there times when you come home at the end of the day...",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00013",
    "start_chunk": "00:12:01.220",
    "end_chunk": "00:13:00.320"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nHospital hallway and patient room — daytime, bright artificial lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: white doctor's coat - light-colored shirt and tie - dark, short hair - concerned expression\nRachel Green: dark-colored tank dress - shoulder-length brown hair - smiling then thoughtful expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss, in a doctor's coat, gestures animatedly while talking to Rachel, who holds a coffee mug and listens. Rachel then walks away, smiling, as Ross follows her into a hospital room. Inside, Ross peeks through the door while Rachel sits on a couch reading a magazine. Ross then enters the room, where a woman in a hospital gown holds a baby, and a man sits beside her. Ross watches them from the doorway, then steps inside to join them.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: white (held by characters)\n- Magazine: \"People\" (on couch)\n- Hospital gown: light-colored with floral pattern (on woman)\n- Baby: wrapped in pink blanket (in woman's arms)\n- Hospital room decor: window with blinds, framed artwork on wall\n- Balloons: colorful (visible in hallway)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the baby with Rachel, who mentions her mom called him. The conversation has a casual tone, with Ross appearing concerned and Rachel smiling. Rachel reacts by walking away, then later returns to the room, where Ross joins the parents.\n\n### **TEMPORAL NOTES:**\nRachel walks away from Ross and enters the hospital room.\nRoss follows Rachel into the room.\nRoss peeks through the door, then enters the room.\nRoss moves to sit beside the parents.",
    "subtitles": "Well, aren't there times when you come home at the end of the day... ...and you're just like, \"If I see one more cup of coffee...\" Ahem. Yeah. Gotcha. - I'm gonna check up on your friend. - Okay, that's fine. - So how did you know I was even here? ROY: Your mom called me. So is this her? No, this is a loaner. Listen, I'm sorry you had to do this by yourself. Oh. I wasn't by myself. I had a doctor, a nurse and a helper guy. So did you see who won the game? Yeah, Knicks by 10. They suck. Eh, they're not so bad.",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:57.151",
    "end_chunk": "00:13:53.915"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nHospital hallway — daytime, artificial lighting\nThe scene transitions to a cluttered utility closet or storage room with shelves, cleaning supplies, and a red circular decoration on the wall.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark pants - dark, short hair - animated, frustrated expression\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair tied back - concerned expression\nRachel Green: dark-colored top - dark pants - blonde, long hair - seated, listening expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss enters the utility closet, visibly agitated, and begins arguing with Monica and Rachel. He gestures emphatically while speaking, expressing frustration about being stuck in the closet while his son is being born. Monica responds with a concerned expression, gesturing as she speaks back to Ross. Rachel remains seated, listening to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Balloons: colorful, attached to wall (hallway)\n- Baby-themed balloon: large, shaped like a bottle with a rocket, on the floor (hallway)\n- Shelves: holding cleaning supplies and paper towels (closet)\n- Red circular decoration: on wall (closet)\n- Blue trash can: in corner (closet)\n- Guitar: leaning against wall (closet)\n- Red hose: coiled on floor (closet)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses his frustration about being stuck in the closet while his son is being born, blaming Monica. The conversation has a tense, emotional tone, with Ross appearing animated and frustrated, and Monica reacting with concern. Rachel listens quietly, seated nearby.\n\n### **TEMPORAL NOTES:**\nRoss enters the utility closet from the hallway.\nRoss begins gesturing and speaking animatedly.\nMonica responds, gesturing as she speaks.\nRachel remains seated throughout the scene.",
    "subtitles": "ROSS: Come on. Come on. Damn it, damn it, damn it. This is all your fault. This is supposed to be, like, the greatest day of my life. My son is being born, and I should be in there, you know? Instead I'm stuck in a closet with you. I've been waiting for this just as much as you have. Believe me, no one has been waiting for this as much as I have, okay? And you know what the funny thing is? When this day is over, you get to go home with the baby. - Where does that leave me? - You get to be the father. Everyone knows who you are. Who am I? There's Father's Day. There's Mother's Day. There's no Lesbian Lover Day. Every day is Lesbian Lover Day. This is so great.",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00015",
    "start_chunk": "00:14:15.980",
    "end_chunk": "00:14:59.814"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place across various hospital locations, including a patient room, waiting room, hallway, and a utility closet, shifting between daytime and nighttime settings.\n\n**KEY CHARACTERS**\n- Ross Geller: A doctor, often appearing concerned and animated, particularly about his son's birth.\n- Rachel Green: Supportive and attentive, often listening to conversations.\n- Monica Geller: Appears concerned and is seen in a waiting room and later arguing with Ross.\n- Chandler Bing: Offers a more relaxed demeanor and takes over a phone call.\n- Joey Tribbiani: Briefly seen interacting with a patient in a hospital room.\n- Unidentified Patient: Appears to be in labor.\n- Doctor: Professional and reassuring.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative begins with a chaotic scene in a utility closet where Ross, Rachel, and Phoebe are trying to open a door, leading to Ross falling. The scene then shifts to a hospital room where a patient is in labor, attended by a doctor and nurse, with Rachel offering juice. Ross enters, expressing concern. Meanwhile, in a waiting room, Monica is on the phone, worried about the birth, but Chandler takes over, offering a more relaxed tone. Ross and Rachel later share a casual conversation with a doctor in the OB/GYN waiting room, where Ross discusses his dating challenges. Ross then enters a hospital room where a new baby has been born, and he joins the parents. The episode concludes with Ross, Monica, and Rachel arguing in a utility closet about being stuck there while his son is being born, with Ross expressing frustration towards Monica.\n\n**IMPORTANT CONTEXT OR THEMES**\n- **Relationship Developments:** Ross and Rachel share several interactions, from being concerned together to having a more casual, humorous conversation. Chandler provides a moment of levity and support to Monica.\n- **Emotional Tone:** The overall tone shifts between tense and serious during the labor and birth, to casual and humorous during Ross and Rachel's conversations, and finally to frustrated and tense during Ross's argument in the closet.\n- **Plot Setup or Payoff:** The primary plot point is the birth of Ross's son, with various characters experiencing different aspects of the event, from the delivery room to the waiting areas and even a misplaced utility closet argument.\n- **Notable Transitions:** The scenes transition between a cluttered storage room and a hospital setting, then to different areas within the hospital (patient room, waiting room, hallway), and finally back to a storage closet, creating a sense of disjointed urgency."
}