{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — nighttime, artificial lighting from overhead fixtures and windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - striped shirt - patterned tie - dark, short hair - serious expression\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated expression\nRachel Green: white t-shirt - dark overalls - brown, shoulder-length hair - concerned expression\nChandler Bing: purple t-shirt under dark blue zip-up hoodie - dark pants - dark, styled hair - relaxed expression\nJoey Tribbiani: dark-colored hoodie - dark pants - dark, styled hair - surprised expression\nPhoebe Buffay: orange jacket - dark pants - blonde, long hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands and gestures animatedly while talking to Monica Geller, who responds while walking toward him. Rachel Green sits on a chair, looking concerned and gesturing with her hands as she speaks. Chandler Bing sits in a chair, holding a magazine and reacting with surprise to the conversation. Joey Tribbiani stands up from his chair and walks toward the group, looking surprised. Phoebe Buffay enters the room and joins the conversation, looking concerned.\n\n### **OBJECTS AND PROPS:**\n- Magazine: held by Chandler Bing\n- Chairs: multiple light-colored chairs arranged in the room\n- Coffee table: wooden, with magazines on it\n- Wall decor: framed paintings on the walls\n- Bulletin board: with papers pinned to it\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the situation with Monica Geller, who appears concerned. The conversation has a tense tone, with Ross appearing serious and Monica reacting with concern. Rachel Green speaks with a worried expression, gesturing as she talks. Chandler Bing reacts with surprise to the conversation, while Joey Tribbiani enters the room looking surprised.\n\n### **TEMPORAL NOTES:**\n- Joey Tribbiani stands up from his chair and walks toward the group\n- Phoebe Buffay enters the room from the right side\n- Monica Geller walks toward Ross Geller\n- Chandler Bing holds a magazine and reacts with surprise\n- Rachel Green gestures with her hands while speaking",
    "subtitles": "WOMAN [OVER PA]: Dr. Johnson, you have a call on line 7. She's not here yet. She's having my baby and she's not here. - Everything's fine. Has her water broken? - I don't know. But when I spoke to her, she said she'd already passed the mucus plug. [GROANS] Do we have to know about that? What are you gonna do when you have a baby? I'm gonna be in the waiting room, handing out cigars. Yes, Joey's made arrangements to have his baby in a movie from the '50s. Aah, I don't believe this. I mean, she could be giving birth in the cab. Oh, Ross, relax. It's only like $2 for the first contraction... ...and then 50 cents each additional contraction. What, it's okay when Chandler does it? You have to pick your moments. - Hi. Did I miss it? Did I miss it? - No, she's not even here yet. - Oh. MONICA: What's with the guitar? I just thought we might be here for a while, so, you know, things might get musical.",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:05.588",
    "end_chunk": "00:01:02.561"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — evening, artificial lighting from overhead fixtures and wall sconces.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored suit jacket - light-colored striped shirt - dark, short hair - concerned expression\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling expression\nChandler Bing: purple hoodie over grey t-shirt - dark pants - dark, styled hair - amused expression\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - animated expression\nPhoebe Buffay: orange coat over dark top - dark pants - blonde, long hair - smiling expression\nJoey Tribbiani: dark-colored hoodie - dark pants - dark, styled hair - relaxed expression\nUnidentified person: light-colored top - dark pants - dark, short hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands near the door, talking animatedly to Rachel Green, who is smiling and gesturing. Monica Geller sits on a couch, holding a book and looking up at the group. Chandler Bing sits on a couch, smiling and looking up at the group. Phoebe Buffay stands near the door, smiling and gesturing. Joey Tribbiani sits on a couch, looking up at the group. An unidentified person stands near the door, looking at the group.\n\n### **OBJECTS AND PROPS:**\n- Book: dark-colored cover (held by Monica Geller)\n- Coffee mug: dark-colored (on table)\n- Orange couch (center of frame)\n- Wall sconces (on wall)\n- Door sign: \"OB/GYN Waiting Room\" (on door)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the birth of a baby with Rachel Green. The conversation has a casual tone, with Ross appearing concerned and Rachel reacting by smiling. Monica Geller appears animated and engaged in the conversation.\n\n### **TEMPORAL NOTES:**\nRoss Geller stands up and walks toward the door.\nRachel Green walks toward the door.\nMonica Geller sits on the couch.\nChandler Bing sits on the couch.\nPhoebe Buffay stands near the door.\nJoey Tribbiani sits on the couch.\nUnidentified person stands near the door.",
    "subtitles": "I just thought we might be here for a while, so, you know, things might get musical. [ROSS SHOUTS] ROSS: Hey, where the hell have you been? - We stopped at the gift shop. I was looking at stuffed animals, and Susan wanted a Chunky. Susan wanted a... You're having a baby. A baby. You don't stop for Chunkys. - I used to have that bumper sticker. - Ha, ha. You see what I mean?",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00002",
    "start_chunk": "00:00:58.683",
    "end_chunk": "00:01:18.494"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nHospital room — daytime, fluorescent lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored striped shirt - dark-colored pants - dark, short hair - concerned expression\nRachel Green: dark-colored hoodie - light-colored patterned skirt - brown, shoulder-length hair - animated expression\nCarol: light-colored hospital gown with dark polka dots - blonde, braided hair - smiling expression\nDr. Franzblau: white lab coat - dark pants - dark, short hair - professional expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green stands beside the hospital bed, holding a yellow cup and talking to Carol, who is seated in the bed. Ross Geller stands near the bed, gesturing with his hand as he speaks to Dr. Franzblau, who is writing on a clipboard. Dr. Franzblau then turns to speak to Ross and Rachel, who are both looking at him. Carol smiles and laughs as she interacts with Rachel.\n\n### **OBJECTS AND PROPS:**\n- Yellow cup: held by Rachel Green\n- Clipboard: held by Dr. Franzblau\n- Hospital bed: with Carol seated in it\n- Wall-mounted sign: indicating \"WAITING ROOMS\", \"NURSERY\", and \"ELEVATORS\"\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the baby's birth with Dr. Franzblau, who is checking the medical records. Rachel Green interacts with Carol, who is smiling and laughing. The conversation has a casual tone, with Rachel appearing animated and Ross appearing concerned.\n\n### **TEMPORAL NOTES:**\nRachel Green enters the room and approaches Carol, holding a yellow cup. Dr. Franzblau enters the room and begins writing on a clipboard. Ross Geller gestures with his hand as he speaks to Dr. Franzblau.",
    "subtitles": "- \"Stopped for a Chunky.\" - Let it go, Ross. I got an extra one. You want this? No. Hey, how's my favorite parenting team doing? Dr. Franzblau. Hi. So I understand you're thinking of having a baby. Wow. I see you're nine months pregnant. That's a good start. [CAROL CHUCKLES] - How you doing with your contractions? - Oh, I love them. Each one's like a little party in my uterus. Ha, ha. They're every four minutes and last 55 seconds. Fifty-nine seconds. Quartz. Ha. Swiss quartz. Ha, ha. - Am I allowed to drink anything? - Ice chips, just ice chips. - They're at the nurses' station. - I'll get them. SUSAN: No, I'm getting it. Be right back. - No, I got it. I'm getting it. Hi. Thought you might like some ice chips. CAROL: Thanks. And if you need anything else, I...",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00003",
    "start_chunk": "00:02:06.376",
    "end_chunk": "00:03:00.554"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — evening, artificial lighting from overhead fixtures and wall sconces.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored striped shirt - dark overalls - medium-length brown hair - smiling and animated\nJoey Tribbiani: dark-colored sweater - purple t-shirt - dark hair - relaxed, then animated\nUnidentified person: light-colored shirt - dark pants - dark hair - serious expression\nUnidentified person: light-colored shirt - dark pants - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green stands and gestures while talking to a doctor, who hands her a paper. An unidentified woman sits in a hospital bed nearby. Joey Tribbiani is seen sleeping in a chair, then wakes up and gestures animatedly while watching a basketball game on a television. An unidentified woman enters the room and stands near Joey, gesturing and talking to him.\n\n### **OBJECTS AND PROPS:**\n- Television: displaying a basketball game (on wall)\n- Chairs: multiple beige chairs (in waiting room)\n- Coffee mug: unclear color (on table)\n- Magazine: held by unidentified person\n- Hospital bed: with patient in polka-dot gown\n- Wall sconces: providing lighting\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses her pregnancy with the doctor. The conversation has a casual tone, with Rachel appearing animated and the doctor appearing professional. Joey Tribbiani is watching a basketball game and reacts to the game with animated gestures.\n\n### **TEMPORAL NOTES:**\nJoey Tribbiani wakes up from sleeping\nUnidentified woman enters the room\nJoey Tribbiani stands up from chair\nUnidentified woman gestures while talking to Joey",
    "subtitles": "And if you need anything else, I... ...do not believe we have met. Hi. I'm Rachel Green. I'm Carol's ex-husband's sister's roommate. Ha, ha. It's nice to meet you. I'm Dr. Franzblau. I'm your roommate's brother's ex-wife's obstetrician. [LAUGHS] Oh, that's funny. I want a baby. Hmm. Not tonight, honey. I got an early day tomorrow. Get up. Come on, let's get some coffee. Oh, okay, because we never do that. Shoot, shoot, shoot. Or just fall down. That's good too. LYDIA: Knick fan? JOEY: Oh, yeah. - Oh, boy, do they suck. - Hey, listen, lady, I... Whoa. Look. Look at your man Ewing. Nice shot. You know, he couldn't hit water if he was standing on a boat. Oh, yeah? And who do you like? - Celtics. - Celtics? Ha!",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:58.386",
    "end_chunk": "00:04:00.530"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nHospital waiting room — nighttime, artificial lighting from overhead fixtures and wall sconces.\n\n### **CHARACTERS PRESENT:**\nUnidentified person: dark-colored sweater - dark pants - dark, styled hair - concerned expression\nUnidentified person: maroon dress - patterned skirt - dark hair tied back - expression shifts from calm to distressed\nPhoebe Buffay: black long-sleeved top - black pants - long blonde hair - smiling while playing guitar\nChandler Bing: dark-colored hoodie - dark pants - brown hair - relaxed, listening expression\nJoey Tribbiani: light-colored shirt - dark pants - brown hair - expression shifts from relaxed to concerned\nRoss Geller: light-colored shirt - dark pants - brown hair - expression shifts from relaxed to concerned\nRachel Green: green jacket - dark pants - brown hair - expression shifts from relaxed to concerned\nMonica Geller: dark-colored sweater - dark pants - dark hair - expression shifts from relaxed to concerned\n\n### **ACTIONS AND INTERACTIONS:**\nAn unidentified pregnant woman sits on a couch, visibly distressed and clutching her stomach, while an unidentified man in a dark sweater gestures animatedly and then stands to help her. They exit the waiting room together. Later, the group gathers in the waiting room, where Phoebe Buffay sits on a couch playing an acoustic guitar and singing. Chandler Bing and Joey Tribbiani sit nearby, listening. Ross Geller, Rachel Green, and Monica Geller stand or sit around the room, reacting to Phoebe's performance. The group appears engaged and amused by the music.\n\n### **OBJECTS AND PROPS:**\n- Acoustic guitar: light-colored wood (being played by Phoebe Buffay)\n- Wooden coffee table: center of room\n- Couches: multiple, light-colored fabric\n- Wall-mounted bulletin board: with papers and notices\n- Phone booth: visible on wall\n- Sign: \"OB/GYN Waiting Room\" (on door)\n- Window: with vertical blinds, showing city lights outside\n\n### **DIALOGUE CONTEXT:**\nPhoebe Buffay sings a folk song about parenting to the group. The conversation has a lighthearted, humorous tone, with Phoebe appearing cheerful and animated while singing, and the listeners reacting with smiles and amusement. The song's lyrics about parenting challenges are met with laughter and playful responses from the group.\n\n### **TEMPORAL NOTES:**\nUnidentified pregnant woman stands up and walks toward the OB/GYN waiting room door with the unidentified man.\nPhoebe Buffay begins playing guitar and singing.\nChandler Bing and Joey Tribbiani shift their positions to sit closer to the couch where Phoebe is playing.\nRoss Geller, Rachel Green, and Monica Geller move around the room to find seats or stand near the group.",
    "subtitles": "- Celtics. - Celtics? Ha! They couldn't hit a boat if... Wait. They suck, all right? Shut up. You know, it's a rebuilding year. You... - Aah! Aah! - Oh. Aah. Uh, let me get the father. Hey! We need a father over here! We need a father! There's no father. Oh. Oh. Oh, sorry. Oh, that's okay. I'm fine. I'm... - Oh! - Oh, uh... Okay. All right. Uh, right this way. All the other pregnant women seem to be going in here. Okay. [PLAYING FOLK MUSIC] [SINGING] They're tiny and chubby And so sweet to touch But soon they'll grow up And resent you so much Now they're yelling at you And you don't know why And you cry and you cry and you cry - Thanks, Ross. - Yeah. I'm paying you to stop.",
    "episode": "1x23 - The One With The Birth",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:58.279",
    "end_chunk": "00:05:00.841"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in a hospital setting, primarily in waiting rooms and a hospital room, transitioning from nighttime to daytime and back to evening/nighttime.\n\n**KEY CHARACTERS**\n- **Ross Geller:** Appears concerned throughout, involved in discussions about the birth.\n- **Monica Geller:** Appears animated and concerned, engaged in conversations.\n- **Rachel Green:** Exhibits concern, then animated joy and engagement. Has a brief conversation about her own pregnancy.\n- **Chandler Bing:** Appears relaxed, amused, and later attentive.\n- **Joey Tribbiani:** Starts surprised and relaxed, then becomes concerned and later amused.\n- **Phoebe Buffay:** Enters concerned, later provides entertainment by playing guitar.\n- **Carol:** Appears in a hospital room, smiling and laughing during interaction.\n- **Dr. Franzblau:** A professional doctor interacting with Ross and Rachel.\n- **Unidentified pregnant woman:** Experiences distress in the waiting room.\n\n**MERGED NARRATIVE SUMMARY**\nThe group, including Ross, Monica, Rachel, Chandler, Joey, and Phoebe, are gathered in a hospital waiting room at night, experiencing a tense atmosphere as they await news. Ross and Monica are discussing the situation with concern, while Rachel also expresses worry. Joey and Phoebe arrive, also appearing surprised and concerned. The scene shifts to a hospital room where Ross is speaking with Dr. Franzblau about a baby's birth, while Rachel is interacting with Carol, who is smiling. Later, in a hospital waiting room, Rachel discusses her own pregnancy with a doctor. Joey is seen sleeping, then wakes up to watch a basketball game and interact with another woman. Meanwhile, in another part of the waiting room, an unidentified pregnant woman experiences distress, receiving help from a man before they leave. The group reconvenes, and Phoebe lightens the mood by playing and singing a folk song about parenting, which the others, including Ross, Rachel, Monica, Chandler, and Joey, find amusing and engaging.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Anticipation and Relief:** The initial tension of waiting for a birth shifts to more relaxed and even humorous moments.\n*   **Emotional Support:** The friends are present for each other and offer support in various ways, from shared concern to lighthearted entertainment.\n*   **Life Events:** The narrative touches on the birth of a baby, Rachel's pregnancy, and the emotional experiences associated with these.\n*   **Friendship Dynamics:** The group's interactions highlight their close bond, as they navigate stressful and joyous moments together.\n*   **Transition to Levity:** The scene transitions from a tense waiting period to moments of relief and amusement, particularly with Phoebe's musical interlude."
}