{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with natural light from windows.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated\nRachel Green: light-colored top - dark pants - long, wavy brown hair - smiling\nPhoebe Buffay: dark top - dark pants - curly blonde hair - smiling\nChandler Bing: light-colored shirt - dark pants - short, brown hair - relaxed\nJoey Tribbiani: light-colored shirt - dark pants - short, brown hair - smiling\nRoss Geller: dark vest over white shirt - dark pants - short, dark hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered around a central table, engaged in conversation. Monica gestures animatedly while speaking, Rachel smiles and listens, Phoebe leans forward with interest, Chandler sits back with arms crossed, Joey leans in with a smile, and Ross appears serious and focused on the discussion.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Wooden table (center of frame)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a coworker with Monica. The conversation has a casual tone, with Ross appearing serious and Monica animatedly responding. The others listen attentively, with Rachel smiling and Joey leaning in.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "[CAR HORNS HONKING] There's nothing to tell. It's just some guy I work with. Come on. You're going out with a guy. There's gotta be something wrong with him. So does he have a hump and a hair piece?",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:47.881",
    "end_chunk": "00:00:59.933"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: light-colored jacket - white top - dark, shoulder-length hair - animated\nRachel Green: denim jacket - light-colored top - long, blonde hair - focused\nRoss Geller: white shirt - dark polo shirt - dark, short hair - relaxed\nChandler Bing: dark leather jacket - dark pants - dark, medium-length hair - serious\nJoey Tribbiani: dark leather jacket - dark pants - dark, medium-length hair - relaxed\nPhoebe Buffay: light-colored top - dark pants - blonde, shoulder-length hair - concerned\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits on the couch, gesturing expressively while speaking to Rachel, who holds a coffee mug and nods occasionally. Ross leans back on the couch, talking animatedly with his hands. Chandler sits in a green armchair, listening intently and occasionally gesturing. Joey sits on a separate couch, holding a coffee mug and looking on. Phoebe sits at a table, writing in a notebook while listening to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table and in hands)\n- Orange couch (center of frame)\n- Wooden coffee table (with magazines and papers)\n- Green armchair (Chandler sitting in)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a recent dream involving a phone call from her mother with Rachel. The conversation has a casual tone, with Monica appearing animated and Rachel reacting by listening intently. Ross and Chandler are also engaged in the conversation, with Ross appearing relaxed and Chandler serious.\n\n### **TEMPORAL NOTES:**\nScene begins with all characters seated\nRoss stands up and walks toward the counter\nChandler stands up and walks toward the counter\nJoey sets down mug",
    "subtitles": "Wait. Does he eat chalk? I don't want her to go through what I went through with Carl. Oh. Okay, everybody relax. This is not even a date. It's just two people going out to dinner and not having sex. Sounds like a date to me. I'm back in high school, in the middle of the cafeteria... ...and I realize I'm totally naked. - Oh, yeah. - I've had that dream. Then I look down and I realize there is a phone... ...there. - Instead of... - That's right! MONICA: That one, I've never had. PHOEBE: No. All of a sudden, the phone starts to ring. And it turns out it's my mother. Which is very, very weird because she never calls me. Hi. This guy says \"hello,\" I wanna kill myself.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:02.395",
    "end_chunk": "00:02:01.954"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with decorative wall art and a visible coffee bar.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark leather jacket - blue jeans - dark, medium-length hair - relaxed, smiling\nMonica Geller: light-colored jacket - white top - dark, shoulder-length hair - animated, gesturing\nRoss Geller: dark blue jacket over red shirt - light-colored pants - dark, short hair - serious, gesturing\nPhoebe Buffay: denim jacket - dark pants - blonde, long straight hair - concerned, listening\nChandler Bing: dark jacket over white shirt - dark pants - dark, medium-length hair - relaxed, smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller enters the scene holding an umbrella and a coffee mug, walking toward the couch where he sits down. Monica Geller is seated on the couch, gesturing animatedly while speaking to Ross. Phoebe Buffay sits beside Ross, listening intently and occasionally gesturing. Joey Tribbiani is seated in a green armchair, holding a blue mug and smiling. Chandler Bing is seated on the couch, leaning back with arms crossed, observing the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with magazines and papers)\n- Brick wall decor (background)\n- Umbrella (held by Ross)\n- Blue mug (held by Joey)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses Carol moving out with Monica Geller. The conversation has a tense tone, with Ross appearing serious and Monica animatedly reacting. Phoebe Buffay listens with concern, while Joey Tribbiani and Chandler Bing observe the interaction with relaxed expressions.\n\n### **TEMPORAL NOTES:**\nRoss Geller enters the frame and sits down on the couch.\nMonica Geller gestures while speaking to Ross.\nPhoebe Buffay sits beside Ross and listens.\nJoey Tribbiani holds and drinks from his mug throughout.\nChandler Bing leans back in his chair, observing the conversation.",
    "subtitles": "This guy says \"hello,\" I wanna kill myself. Are you okay, sweetie? I feel like someone grabbed my small intestine, pulled it out of my mouth... ...and tied it around my neck. - Cookie? Carol moved her stuff out today. PHOEBE & JOEY: Oh. - Let me get you some coffee. - Thanks. Ew. Unh. No. No, don't! Stop cleansing my aura. Just leave my aura alone, okay? I'll be fine. All right? Really. I hope she'll be very happy. - No, you don't. - No, I don't. To hell with her. She left me! And you never knew she was a lesbian. No! Okay? Why does everyone keep fixating on that? She didn't know. How should I know? Sometimes I wish I was a lesbian.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:58.785",
    "end_chunk": "00:02:59.261"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: light-colored jacket - beige pants - dark, shoulder-length hair - animated\nRoss Geller: dark blue jacket over red shirt - white pants - short, dark hair - serious\nRachel Green: denim vest over patterned top - light-colored pants - long, blonde hair - smiling\nChandler Bing: light-colored shirt with dark vest - dark pants - short, brown hair - relaxed\nJoey Tribbiani: dark leather jacket - blue jeans - dark, medium-length hair - smiling\nPhoebe Buffay: light-colored top - dark pants - long, blonde hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green enters wearing a white wedding dress and veil, surprising the group. Monica Geller approaches her, smiling and gesturing warmly. Ross Geller sits on the couch holding a yellow mug, looking at Rachel with a concerned expression. Chandler Bing sits in a green armchair, holding a blue mug and gesturing as he speaks. Joey Tribbiani sits on a bar stool, reading a magazine. Phoebe Buffay sits on the couch, looking at Rachel with a smile. The group reacts to Rachel's appearance, with Monica comforting her and the others looking on.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table and in hands)\n- Orange couch (center of frame)\n- Wooden table with newspapers and magazines\n- Bar stools (in foreground)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses wanting to be married again and having a million dollars with Monica Geller. The conversation has a casual, joking tone, with Rachel appearing excited and Monica reacting with concern. The group listens, with Ross Geller looking serious and Chandler Bing smiling.\n\n### **TEMPORAL NOTES:**\nRachel Green enters the scene wearing a wedding dress\nMonica Geller approaches Rachel Green\nRoss Geller looks at Rachel Green with a concerned expression\nChandler Bing gestures while speaking\nJoey Tribbiani sits on a bar stool reading a magazine\nPhoebe Buffay sits on the couch looking at Rachel Green",
    "subtitles": "Did I say that out loud? All right, Ross. Look, you're feeling a lot of pain right now. You're angry. You're hurting. Can I tell you what the answer is? Strip joints! Come on, you're single. Have some hormones. See, but I don't want to be single, okay? I just wanna be married again. And I just want a million dollars! Rachel? Oh, God, Monica! Hi! Thank God! I went to your building and this guy with a hammer said... ...that you might be here, and you are. - Can I get you some coffee? - Decaf. Okay, everybody, this is Rachel, another Lincoln High survivor. This is everybody. This is Chandler and Phoebe... ...and Joey. And remember my brother, Ross? - Sure! - Hey. - Hi. - Oh, God.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00004",
    "start_chunk": "00:03:00.889",
    "end_chunk": "00:04:00.739"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nRachel Green: white wedding dress - veil with floral headpiece - long, brown hair down - expression: animated, concerned\nRoss Geller: dark blue jacket over red shirt - light-colored pants - dark, short hair - expression: serious, attentive\nMonica Geller: light-colored jacket over white shirt - beige pants - dark, shoulder-length hair - expression: concerned, engaged\nPhoebe Buffay: denim jacket - long, blonde hair - expression: concerned, listening intently\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green sits on the orange couch, gesturing expressively while speaking to Ross Geller, who sits beside her holding a yellow mug. Monica Geller and Phoebe Buffay sit nearby, listening intently with concerned expressions. Ross Geller occasionally gestures with his hands as he listens to Rachel.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: yellow (held by Rachel), dark (on table)\n- Orange couch (center of frame)\n- Wooden tables and chairs (background)\n- Brick wall decor (background)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses her wedding-day anxiety with Ross Geller, expressing her confusion and discomfort about her feelings toward her fiancé Barry. The conversation has a tense, serious tone, with Rachel appearing distressed and Ross reacting with concern. Monica and Phoebe listen with worried expressions.\n\n### **TEMPORAL NOTES:**\nNone observed — all characters remain seated throughout the clip.",
    "subtitles": "- Hi. - Oh, God. [SIGHS] So you wanna tell us now, or are we waiting for four wet bridesmaids? Oh, God! Well, it started about a half-hour before the wedding. I was in this room with all the presents... ...and I was looking at this gravy boat. This really gorgeous Limoges gravy boat. When all of a sudden... Sweet 'N Low? - I realized... ...I was more turned on by this gravy boat than by Barry. Then I got really freaked out, and that's when it hit me: How much Barry looks like Mr. Potato Head. You know, I mean, I always knew he looked familiar, but... Anyway, I just had to get out of there, and I started wondering: \"Why am I doing this?\" And \"Who am I doing this for?\" Anyway, I just didn't know where to go, and I know you and I have drifted apart... ...but you're the only person I know in the city.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:58.821",
    "end_chunk": "00:05:02.718"
  },
  "summary": "**SCENE OVERVIEW**  \nAll moments take place consecutively inside Central Perk, the friends’ downtown coffee shop, during a single late‑morning/early‑afternoon sitting. The lighting remains warm and natural throughout; no location change occurs, but the focus shifts from a general group chat to more intimate one‑on‑one exchanges as characters arrive, stand, and sit again.\n\n**KEY CHARACTERS**  \n- **Monica Geller** – animated, often the conversational catalyst; becomes concerned when Rachel appears.  \n- **Rachel Green** – initially upbeat, later frantic and anxious in a white wedding dress; expresses doubts about her impending marriage.  \n- **Ross Geller** – serious, supportive; dealing with his recent breakup with Carol and trying to help Rachel.  \n- **Chandler Bing** – relaxed, occasionally serious; observes the group dynamics.  \n- **Joey Tribbiani** – laid‑back, mostly a background presence, sipping coffee.  \n- **Phoebe Buffay** – attentive and concerned, listening to the emotional exchanges.\n\n**MERGED NARRATIVE SUMMARY**  \nThe six friends are gathered around the orange couch at Central Perk, chatting about everyday topics. Ross brings up a coworker issue while Monica animatedly shares a bizarre dream about a phone call from her mother, prompting light‑hearted banter from the group. The conversation drifts as Ross, still reeling from his recent split with Carol, mentions that she’s moving out, a revelation that adds a tense undercurrent. As the friends continue their coffee‑filled chatter, Rachel bursts in wearing a full white wedding dress and veil, having just fled her own wedding. Monica rushes to comfort her, while Ross watches with a worried expression and Chandler offers a supportive smile. Rachel collapses onto the couch and, between sips of coffee, confesses her panic and confusion about marrying Barry, revealing deep anxiety and lingering feelings. Monica and Phoebe sit close, listening intently, while Joey and Chandler remain relaxed observers. The scene ends with the group clustered around Rachel, the mood shifting from casual camaraderie to earnest, empathetic support.\n\n**IMPORTANT CONTEXT OR THEMES**  \n- **Relationship developments**: Ross’s recent breakup with Carol is introduced; Rachel’s sudden abandonment of her wedding signals a major personal crisis.  \n- **Emotional tone**: Starts light and comedic, becomes increasingly tense and vulnerable as Rachel’s distress surfaces.  \n- **Plot setup/payoff**: Rachel’s arrival in a wedding dress foreshadows the series‑long arc of her transition from a runaway bride to a central member of the friend group; Ross’s breakup sets up his later romantic storyline with Rachel.  \n- **Scene transitions**: No physical location change—only shifts in focus from group banter to intimate, one‑on‑one conversations, marking the emotional pivot of the episode.  \n- **Character dynamics**: Monica emerges as the empathetic “big sister,” Ross as the concerned confidant, while Chandler and Joey provide steady, low‑key support; Phoebe’s attentive listening underscores her role as the caring friend."
}