{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, bright natural light from windows\nThe room features purple walls, a colorful patterned couch, a wooden TV stand, and a blue kitchen area visible in the background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: white wedding dress - veil with floral headpiece - long, brown hair down - expression shifts from concerned to animated\nMonica Geller: white t-shirt - beige overalls - dark, shoulder-length hair - expression animated, gesturing\nRoss Geller: red jacket - light-colored pants - dark, short hair - expression serious, then amused\nChandler Bing: white shirt - dark pants - dark, medium-length hair - expression amused, then laughing\nJoey Tribbiani: black leather jacket - dark pants - dark, medium-length hair - expression amused, then laughing\nPhoebe Buffay: light-colored top - dark pants - blonde, shoulder-length hair - expression concerned, then amused\n\n### **ACTIONS AND INTERACTIONS:**\nRachel, dressed in a wedding gown, stands in the kitchen area holding a phone, appearing distressed as she speaks. Monica sits on the couch, gesturing emphatically while talking to Rachel. Ross, Chandler, and Joey sit on the couch, watching Rachel with amused expressions. Chandler and Joey laugh and clap when Ross suggests pushing Rachel down the stairs. Rachel walks away from the kitchen area, still on the phone, looking upset.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: yellow (held by Rachel), various colors (on table)\n- Television: Sony brand, displaying a French soap opera\n- Patterned couch: colorful, central in frame\n- Wooden TV stand: with decorative items\n- Blue kitchen cabinets: visible in background\n- Fruit bowl: red bowl with bananas and apples\n- Mountain Dew cans: on coffee table\n- Decorative items: framed pictures, plants, posters on walls\n\n### **DIALOGUE CONTEXT:**\nRachel discusses her wedding plans with Monica, expressing distress about not being invited to her own wedding. The group watches a French soap opera on TV, reacting with amusement to the plot. The conversation has a humorous, lighthearted tone, with Rachel appearing distressed and the others reacting with laughter and playful suggestions.\n\n### **TEMPORAL NOTES:**\nRachel moves from sitting on the couch to standing in the kitchen area\nRoss stands up and walks toward the kitchen area\nChandler and Joey laugh and clap\nRachel walks away from the kitchen area, still on the phone",
    "subtitles": "...but you're the only person I know in the city. Who wasn't invited to the wedding. Oh, I was kind of hoping that wouldn't be an issue. [SPEAKING IN SPANISH ON TV] I'm guessing he bought her the big pipe organ... ...and she's really not happy about it. Daddy, I just... I can't marry him. I'm sorry. I just don't love him. Well, it matters to me. CHANDLER: She should not be wearing those pants. I say push her down the stairs. ALL: Push her down the stairs! Push her down the stairs! [ALL CHEER AND APPLAUD] Come on, Daddy, listen to me! It's like all of my life, everyone's always told me, \"You're a shoe!",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:59.882",
    "end_chunk": "00:06:01.985"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen and living room — daytime, bright natural light from windows\n\n### **CHARACTERS PRESENT:**\nRachel Green: white wedding dress - veil with large bow - long, brown hair - animated, expressive\nRoss Geller: red button-up shirt over dark t-shirt - dark pants - short, dark hair - concerned, listening\nMonica Geller: white t-shirt with suspenders - beige pants - dark, shoulder-length hair - concerned, gesturing\nPhoebe Buffay: denim jacket over dark top - long, blonde hair - surprised, leaning forward\nJoey Tribbiani: dark jacket over light shirt - dark pants - short, dark hair - relaxed, sitting\nChandler Bing: dark jacket over white t-shirt - dark pants - short, dark hair - relaxed, sitting\n\n### **ACTIONS AND INTERACTIONS:**\nRachel, dressed in a wedding gown and veil, stands in the kitchen holding a phone, speaking animatedly while gesturing. Ross stands nearby, holding a glass of juice, listening with a concerned expression. Monica sits on the couch, gesturing as she speaks to Rachel. Phoebe leans forward from the couch, looking surprised. Joey and Chandler sit on the couch, watching the interaction.\n\n### **OBJECTS AND PROPS:**\n- White wedding dress (Rachel)\n- Veil with large bow (Rachel)\n- Phone (Rachel)\n- Glass of juice (Ross)\n- Red button-up shirt (Ross)\n- White t-shirt with suspenders (Monica)\n- Denim jacket (Phoebe)\n- Couch with colorful patterned cover (center)\n- Kitchen counter with blue cabinets\n- Refrigerator (white)\n- Microwave (black)\n- Various kitchen items on shelves\n\n### **DIALOGUE CONTEXT:**\nRachel discusses her desire to be a purse or hat instead of a shoe, expressing her frustration with being told she's a shoe. The conversation has a humorous, slightly tense tone, with Rachel appearing animated and frustrated, while Ross and Monica react with concern and surprise.\n\n### **TEMPORAL NOTES:**\nRachel moves from standing in the kitchen to sitting on the couch.\nRoss moves from standing near the refrigerator to sitting on the couch.\nPhoebe leans forward from the couch to look at Rachel.\nJoey and Chandler remain seated on the couch throughout.",
    "subtitles": "It's like all of my life, everyone's always told me, \"You're a shoe! You're a shoe! You're a shoe! You're a shoe!\" Then today I stopped and said, \"What if I don't wanna be a shoe? What if I wanna be a purse? You know? Or a hat?\" I don't want you to buy me a hat, I am a hat. It's a metaphor, Daddy! You can see where he'd have trouble. Look, Daddy, it's my life. Well, maybe I'll just stay here with Monica. I guess we've established she's staying with Monica. Well, maybe that's my decision. Well, maybe I don't need your money. Wait! Wait! I said maybe! Okay. Just breathe, that's it. Just try to think of nice, calm things. [SINGING] Raindrops on roses And whiskers on kittens",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:57.440",
    "end_chunk": "00:07:02.879"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and window light.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored denim jacket - dark pants - long blonde hair - concerned expression\nRachel Green: white off-the-shoulder top - pearl necklace - brown shoulder-length hair - distressed, covering face\nMonica Geller: white ribbed shirt - brown overalls - dark shoulder-length hair - concerned, leaning over Rachel\nChandler Bing: dark leather jacket - dark pants - dark hair - animated, gesturing while speaking\nJoey Tribbiani: red button-up shirt - dark pants - dark hair - holding a drink, standing near Monica\nRoss Geller: red shirt - dark pants - dark hair - standing near doorway, holding a drink\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, visibly upset and covering her face with her hands. Monica kneels beside her, offering comfort and speaking to her. Phoebe leans over the couch, gesturing and talking to Rachel. Chandler enters from the kitchen, holding a sandwich, and gestures animatedly while speaking to the group. Joey stands near Monica, holding a drink, and listens to the conversation. Ross enters from the doorway, holding a drink, and joins the group. The group is gathered around Rachel, who remains seated and distressed, while the others react with concern and conversation.\n\n### **OBJECTS AND PROPS:**\n- White tulle dress (on couch)\n- Wooden coffee table (with magazines)\n- Orange couch (center of frame)\n- Blue kitchen cabinets (visible in background)\n- Lamp (on side table)\n- Brick wall decor (background)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses independence and the idea of having a roommate with Rachel, who is visibly upset. The conversation has a concerned tone, with Monica appearing empathetic and Rachel reacting by covering her face. Chandler and Joey are engaged in the conversation, with Chandler gesturing animatedly and Joey listening. Ross joins the conversation, holding a drink, and appears to be listening to the group.\n\n### **TEMPORAL NOTES:**\nPhoebe enters frame from the left side\nChandler enters from the kitchen area\nRoss enters from the doorway\nRachel covers her face with her hands\nMonica leans over Rachel to comfort her\nChandler gestures while speaking to the group\nJoey stands near Monica, holding a drink\nRoss stands near the doorway, holding a drink",
    "subtitles": "[SINGING] Raindrops on roses And whiskers on kittens Doorbells and sleigh bells And something with mittens La la la something With string I'm all better now. I helped. MONICA: Look, this is probably for the best, you know? Independence. Taking control of your life. And, hey, if you need anything, you can always come to Joey. Me and Chandler live right across the hall. And he's away a lot. Joey, stop hitting on her. It's her wedding day. What? Like there's a rule or something? [INTERCOM BUZZES] Please don't do that again. It's a horrible sound. PAUL: Uh, it's Paul. - Buzz him in. - Who's Paul? - Paul, the wine guy, Paul? Maybe. Wait a minute. Your \"not a real date\" is with Paul, the wine guy? - He finally asked you out? - Yes. Ooh. This is a \"Dear Diary\" moment.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:59.001",
    "end_chunk": "00:07:58.768"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling and animated\nRoss Geller: red button-up shirt over dark t-shirt - light-colored pants - dark, short hair - serious expression\nRachel Green: white off-the-shoulder lace dress - pearl necklace - long, brown hair - concerned expression\nChandler Bing: dark-colored jacket over white t-shirt - dark pants - dark, medium-length hair - smiling\nJoey Tribbiani: black leather jacket - light-colored pants - dark, medium-length hair - smiling\nPhoebe Buffay: denim overalls over patterned shirt - long, blonde hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green sits on the couch, looking up at Ross Geller as he speaks, then turns to leave the room. Ross Geller stands near the doorway, gesturing as he talks to Rachel. Monica Geller stands near the kitchen counter, smiling as she interacts with the group. Chandler Bing and Joey Tribbiani stand together near the kitchen, smiling and laughing. Phoebe Buffay stands near the refrigerator, holding a small object and looking at Rachel. Ross Geller walks toward the kitchen area, holding a glass, while Rachel Green remains seated on the couch.\n\n### **OBJECTS AND PROPS:**\n- Coffee table: wooden, with magazines and a bowl\n- Couch: patterned, with colorful blankets\n- Refrigerator: white, with magnets and notes\n- Kitchen counter: blue, with various items and hanging pots\n- Door: purple, with a gold-framed mirror\n- Wine glass: clear, held by Ross Geller\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses canceling a trip with Rachel Green, who is concerned about the situation. The conversation has a casual tone, with Ross appearing serious and Rachel looking worried. Monica Geller and the others react with amusement and concern, as seen by their expressions and body language.\n\n### **TEMPORAL NOTES:**\nRachel Green walks toward the door and exits the room.\nRoss Geller walks toward the kitchen area.\nPhoebe Buffay moves to stand near the refrigerator.",
    "subtitles": "Rach, wait, I can cancel. Please, no. Go, I'll be fine. Ross, are you okay? I mean, do you want me to stay? That'd be good. - Really? - No, go on! It's Paul, the wine guy. [KNOCKING ON DOOR] MONICA: Hi, come in. Paul, this is... ...everybody. Everybody, this is Paul. JOEY: Paul, the wine guy. - Wine guy. - I didn't catch your name. Paul, was it? - Okay. Sit down. Two seconds. - Okay. [MOUTHING] Ooh, I just pulled out four eyelashes. That can't be good. So, Rachel, what are you up to tonight? Well, I was supposed to be headed for Aruba on my honeymoon... ...so, nothing. Right. You're not even getting your honeymoon. God. No, no. Although, Aruba. Heh. This time of year? Eh. Talk about your...",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00009",
    "start_chunk": "00:08:00.313",
    "end_chunk": "00:09:01.957"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, natural window light mixed with indoor lighting. The space is cluttered with furniture assembly materials and tools.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: red button-up shirt - dark blue t-shirt underneath - dark, short hair - expression shifts from focused to animated\nRachel Green: white off-the-shoulder dress - pearl necklace - long, brown, wavy hair - expression shifts from concerned to annoyed\nChandler Bing: dark leather jacket - dark shirt underneath - dark, medium-length hair - expression: relaxed, smiling\nJoey Tribbiani: white short-sleeved shirt with dark vest - blue jeans - dark, medium-length hair - expression: animated, talking\nPhoebe Buffay: denim vest over a patterned top - long, blonde, straight hair - expression: confused, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nRoss stands in the kitchen area holding a bottle, talking to Rachel who is seated at a table. Chandler and Joey enter from the background, standing near the refrigerator. Phoebe enters from the right, holding a tool, and begins talking to Ross. Ross then moves to the living room area where Chandler and Joey are assembling furniture, crouching down to examine a wooden frame and blueprints. Joey and Chandler stand near the furniture, discussing the assembly while Ross remains seated on the floor.\n\n### **OBJECTS AND PROPS:**\n- Wooden furniture frame: light-colored (on floor)\n- Blueprints: white paper (held by Ross)\n- Tools: hammer, screwdriver (on floor)\n- Lamp: yellow patterned shade (on floor)\n- Refrigerator: white (in background)\n- Poster: \"The Speed Racer Show\" (on wall)\n- Potted plant: green (in corner)\n- Boxes: cardboard (on floor)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses furniture assembly with Chandler and Joey, who are helping him. The conversation has a casual, slightly humorous tone, with Ross appearing focused and Chandler smiling. Rachel reacts with annoyance to Ross’s actions, while Phoebe appears confused and gestures while talking to Ross.\n\n### **TEMPORAL NOTES:**\nRachel moves from seated to standing and walks toward the kitchen area.\nPhoebe enters the frame from the right side.\nRoss moves from the kitchen area to the living room floor.\nChandler and Joey shift positions while assembling furniture.",
    "subtitles": "Talk about your... ...big lizards. Anyway, if you don't feel like being alone tonight... ...Joey and Chandler are helping me with my furniture. Yes, and we're very excited about it. Actually, thanks, but I'm just gonna hang out here tonight. - It's been a long day. - Oh, sure. Okay. Sure. Hey, Pheebs, you wanna help? Oh, I wish I could, but I don't want to. I'm supposed to attach a bracket-y thing to the side things... ...using a bunch of these little worm guys. I have no bracket-y thing, I see no worm guys whatsoever... ...and I cannot feel my legs. What's this? I have no idea. - Done with the bookcase. - All finished.",
    "episode": "1x01 - The One Where Monica Gets A Roommate ",
    "chunk": "chunk_00010",
    "start_chunk": "00:08:59.372",
    "end_chunk": "00:10:01.558"
  },
  "summary": "**SCENE OVERVIEW**\nThe primary setting is Monica's apartment living room, with transitions to the kitchen area. The scenes take place during the daytime, transitioning to evening and back to daytime.\n\n**KEY CHARACTERS**\n*   **Rachel Green:** Distressed and seeking comfort, initially in her wedding dress, later upset about her life.\n*   **Monica Geller:** Empathetic host, trying to comfort Rachel and discussing independence.\n*   **Ross Geller:** Initially amused, later serious, discussing canceling a trip with Rachel.\n*   **Chandler Bing:** Amused and humorous, participating in lighthearted banter and furniture assembly.\n*   **Joey Tribbiani:** Amused and supportive, participating in banter and furniture assembly.\n*   **Phoebe Buffay:** Concerned and surprised, offering comfort and later confused by furniture assembly.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Monica's apartment where a distressed Rachel, still in her wedding dress, confides in Monica about her wedding plans while the others watch, offering playful, humorous commentary. As Rachel becomes more upset, the group rallies around her, with Monica offering comfort and discussing the idea of independence and having a roommate. Later, Ross discusses canceling a trip with Rachel, who appears concerned. The scene then shifts to the group helping Ross assemble furniture, engaging in casual, humorous banter.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Initial establishment of the core group dynamic; Ross and Rachel's relationship is hinted at with a canceled trip, showing a developing connection and potential conflict.\n*   **Emotional Tone:** The tone shifts from distressed and humorous as Rachel expresses her wedding day woes, to empathetic and concerned as the friends support her, and finally to casual and humorous during the furniture assembly.\n*   **Plot Setup or Payoff:** Rachel's distress and decision to leave her wedding sets up her needing a place to stay, leading to the central theme of her becoming Monica's roommate. The French soap opera viewing serves as lighthearted, comedic relief.\n*   **Notable Transitions between Locations or Conversations:** The narrative moves seamlessly between Rachel's personal crisis and the group's comedic interactions, culminating in the practical task of furniture assembly, highlighting the various facets of their friendships. Rachel's decision to leave her wedding is the pivotal moment that drives the narrative forward."
}