{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with lamps and decorative wall art visible.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored jacket - dark shirt - short, dark hair - concerned/animated expression\nRachel Green: white long-sleeved shirt - blue jeans - shoulder-length brown hair - serious/engaged expression\nMonica Geller: dark-colored short-sleeved top - dark pants - dark, shoulder-length hair - animated, expressive\nChandler Bing: dark shirt - light-colored pants - short, dark hair - relaxed, smiling\nPhoebe Buffay: dark top - patterned pants - long, curly blonde hair - animated, gesturing\nJoey Tribbiani: dark sweater - grey pants - medium-length brown hair - excited, smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Rachel sit on a low bench, engaged in conversation with Monica, who gestures expressively while speaking. Chandler enters from the hallway, walks toward the group, and joins the conversation. Phoebe stands behind the group, gesturing animatedly as she speaks. Joey enters from the kitchen area holding a phone, then walks toward Ross, who is holding a bottle, and they begin talking. The group is gathered in the living room, with Monica seated in a chair and the others either sitting or standing around her.\n\n### **OBJECTS AND PROPS:**\n- Bottle: dark-colored (held by Ross)\n- Phone: white (held by Joey)\n- Wooden coffee table (",
    "subtitles": "One might wonder. A glass is on the table. There's no coaster. It's a cold drink. It's a hot day. Beads of condensation are inching their way closer to the wood... Stop it! Oh, my God! It's true. Who am I? Monica, you're Mom. [MIMICS STABBING SOUND FROM \"PSYCHO\"] JOEY: Uh-huh? Oh, my God! Okay. Okay, I'll be there. That was my agent. My agent has just gotten me a job in the new Al Pacino movie! CHANDLER: Whoa! That's great! What's the part? Can you believe this? Al Pacino! This guy's why I became an actor. \"I'm out of order? You're out of order! This whole courtroom's out of order!\"",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00011",
    "start_chunk": "00:09:58.097",
    "end_chunk": "00:10:59.991"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smiling, animated\nRoss Geller: dark-colored shirt - light-colored pants - short, dark hair - serious, concerned\nRachel Green: white long-sleeved shirt with red cross - light-colored jeans - shoulder-length brown hair - concerned, arms crossed\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - concerned, gesturing\nJoey Tribbiani: dark-colored shirt - light-colored pants - short, dark hair - serious, then smiling\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smiling, animated\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Joey are standing in the kitchen area, animatedly talking and gesturing. Monica, Rachel, and Ross are standing nearby, watching and reacting with concern and surprise. Joey holds a bottle of soda, while Chandler holds a white object. The group appears engaged in a lively conversation, with Chandler and Joey being the main speakers.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, with photos and magnets on door\n- Wooden table: in kitchen area\n- Blue cabinets: in kitchen background\n- Orange couch: in living room area\n- Posters: on purple walls, including one with \"Jouets\" text\n- Flower arrangement: on table near",
    "subtitles": "Seriously, what's the part? \"Just when I thought I was out, they pull me back in!\" Come on. Seriously, Joey, what's the part? [MUMBLES] You're, you're... What? I'm his butt double, okay? I play Al Pacino's butt. All right? He goes into the shower, and then... ...I'm his butt. Oh, my God! Come on, you guys. This is a real movie, and Al Pacino's in it and that's big! Oh, no, it's terrific. After all your years of struggling... ...you've finally been able to crack your way into show business. Okay, fine. Make jokes, I don't care. This is a big break for me! You're right. It is. So are you gonna invite us all to the big opening?",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00012",
    "start_chunk": "00:11:01.035",
    "end_chunk": "00:12:00.468"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored turtleneck sweater - dark pants - dark, short hair - expression: animated, talking\nChandler Bing: light-colored jacket over blue shirt - light-colored pants - dark, medium-length hair - expression: initially neutral, then amused\nRachel Green: white t-shirt - plaid shorts - blonde, shoulder-length hair tied back - expression: concerned, then smiling\nMonica Geller: red robe over grey tank top - dark pants - dark, shoulder-length hair in a ponytail - expression: concerned, then amused\nJoey Tribbiani: dark-colored robe - dark pants - dark, medium-length hair - expression: initially surprised, then amused\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler stand in the kitchen area, talking and gesturing. Monica enters from the hallway, holding papers, and confronts Chandler, who is now in a dark robe and appears to be hiding his face. Rachel enters from the living room, wearing a white t-shirt and plaid shorts, and approaches the refrigerator. Monica follows her into the kitchen, and Rachel opens the refrigerator door while Monica watches. Chandler remains in the hallway, still covering his face with his hands.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, with photos and magnets on the door\n",
    "subtitles": "So are you gonna invite us all to the big opening? [KNOCK ON DOOR] - I need to borrow some moisturizer. - For what? What do you think? Today's the big day! Okay, go into the bathroom. Use whatever you want. Just don't ever tell me what you did in there. JOEY: Thank you. - Joey's mom's on the phone. - He's in the bathroom. - You don't wanna go in there! - Come on, we're roommates. [CHANDLER YELLS] My eyes! My eyes! MONICA: I warned you. Who is being loud? Oh, that would be Monica. Can I borrow some things? I wanna make Aurora breakfast. You got the whole night, huh? Well, I only have 20 minutes until Ethan, so... Do I sense a bit of resentment? No, no, no. No resentment. Believe me...",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00013",
    "start_chunk": "00:11:57.633",
    "end_chunk": "00:13:00.695"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — daytime, natural window light with warm interior lighting.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored t-shirt - plaid skirt - hair in a bun - expression: focused, then slightly amused\nMonica Geller: dark-colored robe - plaid pajama pants - hair tied back - expression: animated, gesturing\nChandler Bing: dark-colored robe - light-colored t-shirt - hair medium-length, styled - expression: animated, talking\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands at the table, pouring a drink and then sits down. Monica, in her robe, gestures while talking to Chandler, who is also in a robe and holding groceries. Chandler moves toward the door, interacting with Monica as he prepares to leave. The scene cuts to a behind-the-scenes shot where Chandler, now in a dark velvet robe, is on set, speaking to crew members.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, covered in magnets and photos\n- Wooden table: center of frame, with a glass and a book on it\n- Blue shelves: filled with dishes and kitchen items\n- Camera equipment: visible in behind-the-scenes shot\n- Ladder: in background of behind-the-scenes shot\n\n### **DIALOGUE CONTEXT:**\nChandler discusses a relationship moment with Monica, mentioning a key memory with Aurora. Monica reacts with animated gestures, possibly teasing or joking. The conversation has a casual, slightly humorous tone, with Chandler",
    "subtitles": "No, no, no. No resentment. Believe me... ...it's worth it, okay? In a relationship, you have these key moments... ...you'll remember for the rest of your life. Well, every single second is like that with Aurora. And I've just wasted 35 of them talking to you. So, uh, Monica, can you help me with the door? Um, Chandler, you know, the old Monica would remind you... ...to scrub that Teflon pan with a plastic brush. But I'm not gonna do that. DIRECTOR: Damn it! Hire the girl. Okay, everybody ready? Uh, listen, I just wanna thank you for this great opportunity. Lose the robe. Me? That would work. Right. Okay. Losing the robe! Okay, and the robe is lost. Everybody, I would like to get this in one take.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:57.610",
    "end_chunk": "00:14:00.088"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nFilm set - daytime, artificial studio lighting\nThe scene is shot behind the camera, showing a shower stall with tiled walls and crew members operating equipment.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: shirtless - dark hair - smiling/animated\nUnidentified person: dark shirt - dark hair - serious expression\nUnidentified person: light-colored shirt - dark hair - serious expression\nUnidentified person: brown jacket - dark hair - focused\nUnidentified person: white shirt, beige sweater vest - bald, gray beard - focused\n\n### **ACTIONS AND INTERACTIONS:**\nJoey Tribbiani is shirtless in a shower stall, washing himself and gesturing expressively while speaking. Crew members are visible operating a large film camera and observing the scene. The camera cuts to a shot of Joey and a woman in bed, holding hands and smiling at each other.\n\n### **OBJECTS AND PROPS:**\nFilm camera: large, professional model (in foreground)\nShower stall: white tiled walls\nLadder: wooden, orange and white stripes (left side)\nBoxes: stacked cardboard (background)\nBed: covered with light-colored striped sheets\nBracelet: gold-colored (on woman's wrist)\n\n### **DIALOGUE CONTEXT:**\nJoey Tribbiani discusses his performance in the shower scene with the director and crew. The conversation has a joking tone, with Joey appearing animated and the crew reacting with focused attention. The director comments on Joey's acting, suggesting the character's \"butt\" should be angry, implying a humorous interpretation of the scene.\n\n### **TEMPORAL NOTES:**\nJoey Tribbiani enters the shower stall\nJoey",
    "subtitles": "Everybody, I would like to get this in one take. Let's roll it. Water's working. And action! And cut! Butt guy, what are you doing? I'm showering. No, that was clenching. Well, the way I see it, the guy's upset here, you know? His wife's dead, his brother's missing. I think his butt would be angry here. I think his butt would like to get the shot before lunch. Once again, rolling. Water working. And action! And cut! What was that? I was going for quiet desperation. But if you have to ask... God, I love these fingers. Thank you. No, actually, I meant my fingers.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:57.294",
    "end_chunk": "00:15:01.232"
  },
  "summary": "**SCENE OVERVIEW**\nThe scene takes place in Monica's apartment living room and kitchen over an evening, transitioning to a film set during the daytime for a behind-the-scenes segment.\n\n**KEY CHARACTERS**\n- Monica Geller: Host and participant in conversations, shifts from animated to concerned and then amused.\n- Ross Geller: Engaged in conversations, appears concerned and animated.\n- Rachel Green: Also engaged, showing concern and amusement.\n- Chandler Bing: Joins conversations, appears relaxed, amused, and later animated while discussing personal matters and interacting with crew.\n- Joey Tribbiani: Initially excited and later seen in a shower scene on a film set, discussing his performance.\n\n**MERGED NARRATIVE SUMMARY**\nThe group is gathered in Monica's apartment living room, engaged in lively and animated conversations. Joey enters with a phone, and Ross is holding a bottle, as the group discusses something that elicits concern and surprise from some members. The focus shifts to a conversation between Chandler and Joey in the kitchen area, with Monica, Rachel, and Ross observing. Later, Monica confronts Chandler, who is in a robe and appears to be hiding his face, while Rachel enters and opens the refrigerator. Chandler is seen talking to Monica about a relationship memory, and then the scene transitions to a film set. On the set, Joey Tribbiani is filmed in a shower stall, discussing his performance with the director, who makes a humorous suggestion about his character's \"butt\" being angry. The scene briefly shows Joey and a woman in bed, holding hands.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Dynamics:** Initial conversations seem to involve the group, with later focus on Chandler and Monica's discussion of a relationship memory, and a brief glimpse of Joey's romantic interaction.\n*   **Emotional Tone:** The initial apartment scenes show a mix of animation, concern, and surprise, evolving to amusement. The film set scenes are more focused on the professional context of filming, with a humorous undertone regarding Joey's acting.\n*   **Plot Setup:** The name of the episode, \"The One with the Butt,\" is directly alluded to in the dialogue context from the film set.\n*   **Notable Transitions:** A clear shift occurs from the apartment setting to the behind-the-scenes filming of Joey's shower scene on a separate set."
}