{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA dimly lit theater or rehearsal room — nighttime, artificial stage lighting with spotlights.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - smiling\nRoss Geller: light-colored shirt - dark pants - short, dark hair - serious\nRachel Green: black top - dark pants - long, wavy brown hair - smiling\nChandler Bing: dark shirt - dark pants - short, brown hair - smiling\nPhoebe Buffay: black jacket - light-colored top - long, blonde hair - animated\nJoey Tribbiani: light-colored shirt - dark pants - short, dark hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nThe group sits in a semi-circle, holding blue scripts, watching a performance. Rachel and Monica are seated in the front row, smiling and reacting to the show. Phoebe, seated behind Rachel, gestures animatedly with her hands while speaking. Ross and Chandler sit beside Monica, looking on with expressions of amusement and mild concern. The scene cuts to a stage where a man in a suit is performing a dramatic monologue with a woman reclining in a leather chair. The group watches intently, their expressions shifting from amusement to surprise as the performance unfolds.\n\n### **OBJECTS AND PROPS:**\n- Blue scripts: held by characters (in hands)\n- Leather chair: occupied by reclining woman on stage\n- Wooden chairs: for audience seating\n- Framed portrait: on wall behind stage\n- Dark-colored stage lighting: illuminating the performance area\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the performance with the group. The conversation has a humorous and slightly tense tone, with Ross appearing serious and the others reacting with amusement and surprise. The group is clearly engaged and entertained by the show.\n\n### **TEMPORAL NOTES:**\nScene begins with the group seated and watching the performance.\nThe camera cuts to the stage where the performance is taking place.\nThe group's expressions shift from amusement to surprise as the performance continues.\nThe scene ends with the group still watching the performance.",
    "subtitles": "Oh, look, look! There's Joey's picture! This is so exciting! You can spot someone who's never seen his plays. Notice, no fear. No sense of impending doom. The exclamation point scares me. It's not just Freud, it's Freud! ROSS: Shh. Magic is about to happen! JOEY [IN GERMAN ACCENT]: Well, Eva... ...we've done some excellent work here. And I would have to say... ...your problem is quite clear. [ZANY PIANO MUSIC PLAYS] [SINGING] All you want is a dinkle What you envy's a schwang A thing through which you can tinkle To play with or simply let hang",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:06.548",
    "end_chunk": "00:00:52.885"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nA dimly lit, theatrical rehearsal room with brick walls and wooden chairs. The scene transitions to a dark, outdoor fountain area at night, then back to the rehearsal room.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - serious\nChandler Bing: light-colored shirt - dark pants - short, brown hair - serious\nJoey Tribbiani: light-colored shirt - dark pants - dark, medium-length hair - smiling\nPhoebe Buffay: dark top - dark pants - dark, curly hair - smiling\nRoss Geller: dark-colored sweater - dark pants - dark, medium-length hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered in a rehearsal room, initially seated and watching a performance. They stand up and applaud as the performance ends. They then gather together, talking and laughing. Chandler leans back in his chair with arms crossed, smirking at the conversation. Joey enters from the kitchen area holding a sandwich and sits at the table.\n\n### **OBJECTS AND PROPS:**\n- Wooden chairs (arranged in rows)\n- Brick wall decor (background)\n- Coffee mugs (on table)\n- Sandwich (in Joey's hand)\n- Theater stage (visible in background)\n\n### **DIALOGUE CONTEXT:**\nThe group discusses a performance they just watched. The conversation has a casual tone, with Chandler appearing smirking and Joey reacting by laughing. The group seems to be enjoying the performance and each other's company.\n\n### **TEMPORAL NOTES:**\n- The group transitions from seated to standing and applauding\n- Joey enters the frame from the kitchen area\n- Chandler leans back in his chair with arms crossed\n- Joey sits at the table",
    "subtitles": "[AUDIENCE CHEERS] [ZANY PIANO MUSIC PLAYING] [ALL GROAN] I feel violated. Did anybody else feel like peeling their skin off... ...to have something else to do?",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:39.933",
    "end_chunk": "00:01:59.451"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nA dimly lit rehearsal room or theater space — evening, artificial stage lighting with spotlights. The background features a dark brick wall and rows of folding chairs.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - unclear lower clothing - dark, short hair - concerned expression\nChandler Bing: light-colored plaid shirt - blue jeans - brown, medium-length hair - animated expression\nRachel Green: dark-colored dress - unclear lower clothing - brown, shoulder-length hair - smiling expression\nMonica Geller: light-colored sleeveless top - unclear lower clothing - dark, shoulder-length hair - serious expression\nPhoebe Buffay: dark-colored jacket - unclear lower clothing - blonde, long curly hair - expressive, talking\nJoey Tribbiani: dark-colored shirt - unclear lower clothing - dark, medium-length hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is seated in a semi-circle, engaged in a conversation. Chandler is animatedly talking and gesturing, while Ross looks on with a concerned expression. Rachel stands and speaks, holding a blue object, while Monica and Phoebe listen and react. Joey is seated, appearing relaxed and observant. The group appears to be discussing a social situation involving Ross and a woman.\n\n### **OBJECTS AND PROPS:**\n- Blue object (possibly a microphone or prop) held by Rachel\n- Folding",
    "subtitles": "Ross, 10:00. Is it? It feels like 2. No, 10:00! There's a beautiful woman at 8, 9, 10:00! ROSS: Hello! She's amazing! She makes the women I dream about look like short, fat, bald men. Go over to her. She's not with anyone. And what would my opening line be? Excuse me... [BABBLES] Come on, she's a person. You can do it. Could she be more out of my league? Ross, back me up. He could never get a woman like that in a million years. But you always see these beautiful women with these \"nothing\" guys. You could be one of those guys. - You could do that. - You think? RACHEL: Absolutely! I can't believe I'm even considering this. - I'm very aware of my tongue. - Come on. Here goes.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00003",
    "start_chunk": "00:02:00.120",
    "end_chunk": "00:02:57.676"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nA theater backstage area — evening, dim ambient lighting with spotlights\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored plaid shirt - blue jeans - dark, medium-length hair - animated, expressive\nRoss Geller: dark-colored sweater - light-colored pants - dark, short hair - surprised, then smiling\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling, engaged\nMonica Geller: light-colored top - dark pants - dark, shoulder-length hair - smiling, animated\nPhoebe Buffay: dark top - dark pants - dark, curly hair - smiling, engaged\nJoey Tribbiani: light-colored striped shirt - brown pants - dark, medium-length hair - animated, smiling\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing stands and gestures animatedly while talking to a woman with curly hair, who smiles and responds. Ross Geller looks up in surprise as Chandler moves around. Monica, Rachel, and Phoebe stand nearby, smiling and reacting to the conversation. Joey Tribbiani enters the scene, wearing a striped shirt and suspenders, and joins the group, gesturing as he speaks. The group appears to be in a lively, social conversation, with Chandler and Joey being the",
    "subtitles": "Yes? Hi. Um... Ahem. Okay, next word would be... ...uh, Chandler. Chandler is my name and, uh... [CLEARS THROAT] Hi! Yes, you said that. Yes! Yes, I did. But what I didn't say... What I wanted to say was, uh... ...would you like to go out with me? Thank you. Good night. Chandler? PHOEBE: There he is! ROSS: I didn't know you could dance! RACHEL: You were in a play! What'd you think? ROSS: I didn't know you could dance! RACHEL: You were in a play! Come on, it wasn't that bad. I was the lead. It was better than the troll thing. At least you got to see my head. RACHEL: You're right. ROSS: We saw your head. She said yes! She said yes! MONICA: Wow! Awful play, man! Whoa! Her name's Aurora. She's Italian and she pronounces my name \"Chandler.\"",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00004",
    "start_chunk": "00:03:02.932",
    "end_chunk": "00:04:03.575"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm interior lighting with decorative lamps and brick walls.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored plaid shirt - dark pants - dark, medium-length hair - animated, gesturing while speaking\nRoss Geller: striped shirt with suspenders - light-colored pants - dark, short hair - serious, listening\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - smiling, holding a red bag\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling, holding a blue object\nPhoebe Buffay: dark top - dark pants - blonde, long, curly hair - smiling, holding a blue object\nJoey Tribbiani: dark jacket over light shirt - light-colored pants - dark, medium-length hair - relaxed, seated\n\n### **ACTIONS AND INTERACTIONS:**\nChandler stands and gestures animatedly while speaking to Ross, who listens with a serious expression. Monica and Rachel stand nearby, smiling and holding blue objects. Phoebe stands beside them, also smiling. Joey sits in a chair, relaxed, observing the group. The group appears to be engaged in a lively conversation, with Chandler as the main speaker.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tables)\n- Orange couch (center of frame)\n- Wooden tables (with mugs and magazines)\n- Brick wall decor (background",
    "subtitles": "Her name's Aurora. She's Italian and she pronounces my name \"Chandler.\" I like that better. The usher gave me this to give to you. - What is it? - The Estelle Leonard Talent Agency. An agency left me its card. Maybe they wanna sign me! Based on this play? Based on this play! Hey, kids! ROSS: Hey, Chandler. No, because this line is passion, and this is just a line. I've been here seven seconds, and you haven't asked me how my date went. How was your date, Chandler? It was unbelievable! I've never met anyone like her. She's had the most amazing life! CHANDLER: She was in the Israeli army. None of the bullets hit the engine block... ...so we made it to the border. But just barely and I... I've been talking about myself all night long. I'm sorry.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:59.322",
    "end_chunk": "00:05:02.968"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in a dimly lit theater or rehearsal room, transitioning to a backstage area, and finally to the Central Perk coffee shop. The timeframe spans from evening into the night.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Initially observant and smiling, later serious.\n*   **Ross Geller:** Starts serious while watching a performance, becomes surprised, and later listens intently.\n*   **Rachel Green:** Engaged and smiling throughout, holding a blue object at one point.\n*   **Chandler Bing:** Animated and expressive, a main speaker in later conversations.\n*   **Phoebe Buffay:** Animated and smiling, actively participating in discussions.\n*   **Joey Tribbiani:** Initially smiling and entering with food, later relaxed and observant, then animated and speaking.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens with Monica, Ross, Rachel, Chandler, Phoebe, and Joey seated in a semi-circle in a dimly lit theater or rehearsal room, holding scripts and watching a dramatic performance. Their expressions shift from amusement to surprise as the show progresses. After the performance concludes, they stand and applaud, then gather to discuss it, with Chandler smirking. Joey enters with a sandwich. The group continues their animated conversation, seemingly discussing a social situation involving Ross. The scene shifts to a backstage area where Chandler is animatedly talking to a woman, with the rest of the group reacting. Joey then joins the group, also speaking animatedly. The final scene takes place in Central Perk, where Chandler continues to be the main speaker in a lively conversation with the others, including Ross who listens intently, while Monica and Rachel hold blue objects.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   The group is together experiencing entertainment (a performance) and then transitioning to social discussions.\n*   There's a developing social situation involving Ross that is a focal point of conversation.\n*   Chandler and Joey emerge as particularly animated speakers in the later parts of the sequence.\n*   The scene transitions from a performance setting to more casual social spaces (backstage, Central Perk).\n*   The emotional tone shifts from engaged observation to lively, humorous, and possibly tense conversation."
}