{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nA bedroom — evening, warm artificial lighting from lamps and window blinds.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored camisole dress - dark pants - curly brown hair - animated, expressive\nChandler Bing: white t-shirt - light-colored pants - brown, medium-length hair - concerned, then serious\n\n### **ACTIONS AND INTERACTIONS:**\nRachel and Chandler are in bed, initially holding hands and smiling. Rachel sits up, then stands, gesturing animatedly while talking to Chandler, who is sitting up in bed. Chandler responds with a concerned expression, looking at Rachel as she speaks. Rachel continues to gesture and move around the room while talking, and Chandler remains seated, listening and reacting.\n\n### **OBJECTS AND PROPS:**\n- Bed with striped comforter\n- Bookshelf with books and figurines\n- Wooden dresser with hats and framed pictures\n- Window with blinds\n- Basketball hoop (on wall)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses a situation involving multiple men with Chandler. The conversation has a tense, serious tone, with Rachel appearing animated and concerned, and Chandler reacting by looking worried and listening intently.\n\n### **TEMPORAL NOTES:**\nRachel stands up from the bed\nChandler sits up in bed\nRachel moves around the room while talking\nChandler remains seated throughout",
    "subtitles": "No, actually, I meant my fingers. Look at them. Look at how happy they are. - Oh, my God, I'm late! - Oh, no, no, no. - Don't go, don't go. - Okay, okay. - I have to. - Look, she's leaving. I'm sorry. He'll be waiting for me. I thought you talked to Rick. It's not Rick. Ethan? He gets the whole day with you! No, it's Andrew. I know there'll be many moments... ...when I'll regret asking the following question, but... And Andrew is? He's... new. So you're not completely fulfilled by Rick, Ethan and myself? No, that's not exactly what I was... Most women would kill... ...for three guys like us. So, what do you want? You.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:58.689",
    "end_chunk": "00:16:00.166"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nA bedroom — evening, warm ambient lighting from windows with blinds.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: light-colored t-shirt - light-colored shorts - dark, medium-length, wavy hair - animated, expressive\nUnidentified person: dark-colored floral-patterned tank top - unclear lower clothing - dark, curly, shoulder-length hair - concerned, engaged\n\n### **ACTIONS AND INTERACTIONS:**\nJoey and the unidentified person are sitting on a bed, engaged in an intense conversation. Joey gestures with his hands while speaking, appearing animated and passionate. The unidentified person listens intently, occasionally responding with hand gestures and facial expressions that convey concern and thoughtfulness. They remain seated on the bed throughout the clip, maintaining close proximity as they talk.\n\n### **OBJECTS AND PROPS:**\n- Bed (with white sheets and blankets)\n- Bookshelf with books and figurines (behind the bed)\n- Basketball hoop (on the wall)\n- Framed poster (on the wall)\n- Window with blinds (background)\n- Radio or stereo (on the bookshelf)\n\n### **DIALOGUE CONTEXT:**\nJoey discusses emotional conflict and internal struggle with the unidentified person. The conversation has a serious, introspective tone, with Joey appearing earnest and the unidentified person reacting with concern and thoughtful engagement.\n\n### **TEMPORAL NOTES:**\nNone observed — characters remain seated on the bed throughout",
    "subtitles": "You. - You have me. - No, no. Just you. What do you mean? Lose the other guys. Like, all of them? Come on, we're great together. Why not? Why can't we just have what we have now? Why can't we just talk, laugh and make love... ...without feeling obligated to one another? Up until tonight, I thought that's what you wanted too. Well, part of me wants that... ...but it's like I'm two guys. I mean, one guy's saying, \"Shut up! This is great!\" But there's this other guy. It's the guy who wells up every time the Grinch's heart... ...grows three sizes and breaks that measuring device. He's saying, you know, \"This is too hard. Get out, get out!\" So which one of the two guys will you listen to? I have to listen to both. They don't let each other finish. Which one?",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:59.124",
    "end_chunk": "00:17:00.059"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nJoey Tribbiani's bedroom — evening, warm artificial lighting\nThe room is cluttered with personal items, including a bed with rumpled sheets, a dresser, and posters on the walls. The lighting is dim and warm, suggesting an intimate, private setting.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: light-colored t-shirt - light-colored shorts - dark, medium-length hair - smiling, animated\nUnidentified person: dark-colored tank top - unclear lower clothing - dark, curly hair - expression unclear\n\n### **ACTIONS AND INTERACTIONS:**\nJoey Tribbiani and an unidentified woman are sitting on a bed, engaged in an intimate conversation. Joey gestures with his hands as he speaks, and the woman responds while looking at him. They move closer, and Joey gently touches her face as they share a kiss. Afterward, they separate, and the woman walks away from the bed, while Joey stands up and covers his face with his hands in a gesture of frustration or exasperation.\n\n### **OBJECTS AND PROPS:**\n- Bed: with rumpled sheets and pillows (center of frame)\n- Dresser: with books and various items (behind bed)\n- Poster: \"It's a Wonderful Life\" (on wall)\n- Basketball hoop: mounted on the wall (visible in background)\n- Framed picture: of a couple (on wall)\n- Books: stacked on dresser\n\n### **DIALOGUE CONTEXT:**\nJoey Tribbiani discusses a romantic situation with the unidentified woman, possibly involving a breakup or a decision about a relationship. The conversation has a casual, slightly tense tone, with Joey appearing animated and the woman reacting with a mix of concern and amusement. The dialogue suggests a discussion about a past relationship or a choice Joey made.\n\n### **TEMPORAL NOTES:**\n- The unidentified woman walks away from the bed\n",
    "subtitles": "Which one? The second guy. I see. Call me if you change your mind. Sorry, the first guy runs the lips. Look at it this way. You dumped her! Right? I mean, this woman was... ...unbelievably sexy... ...and beautiful, intelligent, unattainable... Tell me why you did this again? ROSS: Hey! MONICA: Hey! RACHEL: Movie star! Aren't you the guy who plays the butt in the new Al Pacino movie?",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:59.018",
    "end_chunk": "00:18:03.498"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with purple walls and visible furniture.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored sweater - dark pants - dark, medium-length hair - expression shifts from serious to animated\nRoss Geller: dark shirt - blue jeans - dark, medium-length hair - expression serious, listening\nRachel Green: red turtleneck sweater - dark pants - dark, shoulder-length hair - expression animated, gesturing\nPhoebe Buffay: floral dress - dark pants - blonde, shoulder-length hair - expression concerned, listening\nJoey Tribbiani: dark turtleneck sweater - grey pants - dark, medium-length hair - expression animated, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing and Ross Geller sit on a couch, engaged in conversation. Rachel Green, wearing a red sweater, gestures emphatically while speaking to them. Joey Tribbiani sits nearby, animatedly gesturing as he talks. Phoebe Buffay listens intently from the couch. The group is gathered in a living room setting, with Chandler and Ross appearing to be the primary speakers at different points.\n\n### **OBJECTS AND PROPS:**\n- Wooden coffee table (center)\n- Patterned couch (with pillows)\n- Red telephone (on side table)\n- Decorative teapot (on side table)\n- White sneakers (on floor)\n- Lamp (on side table)\n- Refrigerator (with magnets, visible in background)\n\n### **DIALOGUE CONTEXT:**\nChandler Bing discusses being fired from a movie role for acting too much with his butt, with",
    "subtitles": "Aren't you the guy who plays the butt in the new Al Pacino movie? Nope. No? What happened, big guy? Big guy? It felt like a \"big guy\" moment. I got fired! They said I acted too much with it. I told everybody about this. Everybody will be expecting to see me. You know what? No one will be able to tell. My mom will. There's something so sweet... ...and disturbing about that. I've done nothing but crappy plays for six years... ...and I finally get my shot, and I blow it! Maybe this wasn't your shot. I think when it's your shot, you know it's your shot. Did it feel like your shot? Hard to tell. I was naked.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:59.828",
    "end_chunk": "00:19:00.054"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with lamps and indoor decor visible.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored shirt - dark pants - dark, medium-length hair - smiling, relaxed\nRoss Geller: dark-colored shirt - brown pants - dark, short hair - serious, attentive\nPhoebe Buffay: floral dress - black leggings - blonde, shoulder-length hair - animated, gesturing\nRachel Green: white t-shirt - blue jeans - brown, shoulder-length hair - concerned, listening\nJoey Tribbiani: dark-colored shirt - blue jeans - dark, medium-length hair - smiling, engaged\nMonica Geller: red turtleneck sweater - blue jeans - dark, shoulder-length hair - smiling, expressive\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Ross sit on a couch, engaged in conversation, with Chandler gesturing. Phoebe sits beside Joey, animatedly talking to him while Rachel listens from behind. Monica enters the room, smiling and gesturing as she walks toward the group. Joey and Phoebe embrace briefly before she sits down. Monica stands near the doorway, reacting to the conversation with expressive hand gestures.\n\n### **OBJECTS AND PROPS:**\n- Wooden coffee table (center)\n- Patterned couch (with red and white cushions)\n- Lamp (on side table)\n- Potted plants (in background)\n- Magazine (on coffee table)\n- Vase with flowers (near doorway)\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses a topic with Joey, who appears excited",
    "subtitles": "Hard to tell. I was naked. I don't think this was your shot. I don't even think you just get one shot. I really believe big things are gonna happen for you. I do. You've gotta keep thinking about the day that some kid will go... ...\"I got the part! I'm gonna be Joey Tribbiani's ass!\" You think? That's so nice. Oh, come here. I'm sorry, Joey. I'm gonna go to bed, guys. ROSS: Good night. RACHEL: You're gonna leave your shoes out here? Uh-huh. Really? Just casually strewn about... ...in that reckless, haphazard manner? It doesn't matter. I'll get them tomorrow. Or not! Whenever. She is a kook.",
    "episode": "1x06 - The One with the Butt",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:57.469",
    "end_chunk": "00:19:59.655"
  },
  "summary": "**SCENE OVERVIEW**\nThe events unfold in the evening, beginning in a bedroom and transitioning to Monica's apartment living room. The lighting is consistently warm and artificial, suggesting an indoor setting.\n\n**KEY CHARACTERS**\n*   **Rachel Green:** Animated and expressive, concerned about a situation involving multiple men.\n*   **Chandler Bing:** Initially concerned, then serious, and later animated and relaxed. He is involved in a conversation about a movie role.\n*   **Joey Tribbiani:** Animated, passionate, and earnest, discussing internal struggles and a romantic situation.\n*   **Ross Geller:** Serious and attentive, participating in conversations.\n*   **Phoebe Buffay:** Concerned, animated, and expressive, listening and gesturing.\n*   **Monica Geller:** Smiling and expressive, joining the group.\n*   **Unidentified Person (Female):** Engaged and concerned, having an intimate conversation with Joey.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative begins with Rachel expressing concern to Chandler in a bedroom about a situation involving multiple men, her animation and gestures highlighting her animated state. Meanwhile, in another part of the apartment, Joey is engaged in an earnest and intense conversation with an unidentified woman, discussing emotional conflict and internal struggles. This intimate talk culminates in a kiss, after which the woman departs, leaving Joey in a state of frustration. The scene then shifts to Monica's apartment living room where a group discussion is underway. Chandler recounts being fired from a movie role for being too theatrical with his butt. The group, including Rachel, Ross, Joey, and Phoebe, actively participates in the conversation, with Joey and Phoebe also sharing a brief embrace before Monica enters, joining the lively discussion.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** An intimate moment occurs between Joey and an unidentified woman, leading to a kiss and subsequent frustration for Joey.\n*   **Emotional Tone:** The overall tone shifts from tense and serious discussions involving Rachel and Chandler, to introspective and earnest conversations with Joey, and finally to a more lighthearted and animated group discussion about Chandler's firing.\n*   **Plot Setup or Payoff:** The episode title, \"The One with the Butt,\" is directly referenced by Chandler's reason for being fired from a movie role.\n*   **Notable Transitions:** The primary transition is from a bedroom setting where individual conversations take place to Monica's living room where the group gathers for a shared discussion."
}