{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and indoor decor.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored sleeveless dress - hair styled in a bun - expression: engaged, smiling\nChandler Bing: dark-colored sweater - dark pants - hair: dark, medium length - expression: amused, leaning forward\nJoey Tribbiani: blue shirt - light-colored pants - hair: dark, medium length - expression: animated, smiling\nMonica Geller: dark-colored hoodie over black sports bra - black pants - hair: dark, tied back - expression: animated, holding a drink bottle\nRoss Geller: dark-colored shirt - dark pants - hair: dark, medium length - expression: serious, listening\n\n### **ACTIONS AND INTERACTIONS:**\nMonica enters the room holding a drink bottle and speaks animatedly to the group. Rachel sits on the couch, holding a magazine and reacting to the conversation. Chandler and Joey sit nearby, leaning forward and smiling as they listen. Ross sits on the couch, appearing serious as he listens. Monica gestures with her free hand while speaking, and the group reacts with smiles and laughter.\n\n### **OBJECTS AND PROPS:**\n- Magazine: dark cover (held by Rachel)\n- Drink bottle: clear plastic with label (held by Monica)\n- Coffee table: wooden, with magazines and a bottle on it\n- Couch: white with red and white cushions\n- Lamp: woven shade (",
    "subtitles": "That is so sweet, you guys. ROSS: Hey, Mon. RACHEL: Mon. Mon, Ethan called again. Mon? ALL: Mon! - What? - Ethan called again. Oh. - You're not seeing him anymore? - No. You know, sometimes just things don't work out. And this has nothing to do with the fact that he needs a note to get out of gym? I didn't say any... I did not say anything, I swear. He stopped by. JOEY: Next time you talk to him... ...could you ask him which one the strongest Power Ranger is? [MONICA LAUGHING] Oh, my life is just so amusing. Heh, heh. Can we drop it now? Sorry. Sorry. It's morphing time. - Stegosaurus! - Tyrannosaurus! [GUYS YELLING]",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00016",
    "start_chunk": "00:15:00.733",
    "end_chunk": "00:16:00.792"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nThe Friends apartment living room — daytime, warm ambient lighting with natural light from windows.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sports bra and jacket - black leggings - dark hair tied back - smiling and animated\nRoss Geller: dark-colored polo shirt with grey sleeves - light-colored pants - dark hair - serious expression\nRachel Green: dark-colored sleeveless top - dark pants - brown hair - relaxed, listening\nChandler Bing: dark-colored polo shirt - light-colored pants - dark hair - smiling\nPhoebe Buffay: black beaded top - orange skirt - long blonde hair - animated, gesturing\nJoey Tribbiani: dark-colored shirt - light-colored pants - dark hair - relaxed, listening\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe stands near the doorway, gesturing as she speaks to Ross, who is seated and responds with hand gestures. Monica enters from the left, holding a drink bottle, and walks toward the group. Rachel sits on the couch, holding a magazine, while Chandler sits beside her, smiling. Joey enters from the kitchen area and joins the conversation. Phoebe moves to the kitchen counter, puts on an orange jacket, and continues talking to Ross, who stands near the refrigerator. The group remains seated or standing in the living room, engaged in",
    "subtitles": "[GUYS YELLING] Ooh. Oh, I gotta go. Whoa. Ooh, head rush. Oh. One more and then I have to go. Cool. Ha, ha. Where you going? Oh, I got a birthday party with some work people. Work people? - Nobody told me. - No, I know. That's part of the whole, you know, them-not-liking-you extravaganza. Know what? I don't get this. A month ago, these people were my friends. Just because I'm in charge, doesn't mean I'm a different person. Well, then you should come tonight, just hang out with them. Let them see what a great guy you still are. - You think I should? - I really do, yeah. - Okay. Okay. PHOEBE: Okay. Oh, but, um, could we not go together? I don't wanna be the geek who invited the boss, you know? CHANDLER: I think last night was great.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:58.791",
    "end_chunk": "00:17:00.393"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nAn office with large windows overlooking a city skyline — daytime, bright natural light.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored top - patterned skirt - long blonde hair - animated expression\nChandler Bing: dark suit - patterned tie - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe stands and gestures while talking to Chandler, who is seated and listens. She then sits at the desk, continuing to talk and gesture with her hands. Chandler remains seated, looking at her with a serious expression.\n\n### **OBJECTS AND PROPS:**\n- Coffee mug: dark-colored (on desk)\n- Desk: black, cluttered with papers and office supplies\n- Computer monitor: white (on desk)\n- Potted plant: green (near desk)\n- Window: large, with vertical blinds\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses her new system for handling beeper calls with Chandler. The conversation has a casual tone, with Phoebe appearing animated and Chandler reacting with a serious expression.\n\n### **TEMPORAL NOTES:**\nPhoebe moves",
    "subtitles": "CHANDLER: I think last night was great. You know, the karaoke thing? Tracy and I doing \"Ebony and lvory\"? - Mm-hm. - Ha, ha. You were great. But they still made fun of you. - What? - Now you're more like Mr. Caring-Boss. Mr. \"I'm-One-of-You\"-Boss. Mr. \"I-Wanna-Be-Your-Buddy\"- Boss-Man-Bing. Then I don't get it. Well, you know what, Chandler? I think you just gotta face it. You're, like, the guy in the big office, you know? You're the one that hires them and fires them. - They still say you're a great boss. - They do? Uh-huh. But they're not your friends anymore. - But I just want to... - No, but you can't. - But I just want... - Ah-ah. [BEEPER BEEPING] Aren't you gonna...? Oh, Carol and I have a new system. If she punches in \"911,\" it means she's having a baby. - Otherwise, I just ignore it. - What about Andre?",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:58.892",
    "end_chunk": "00:18:00.870"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with neon signs visible\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored suit jacket - striped shirt - patterned tie - dark hair - animated expression\nMonica Geller: dark-colored shirt - light-colored cardigan - dark hair tied back - serious expression\nRachel Green: dark sleeveless top - patterned skirt - long brown hair - concerned expression\nChandler Bing: light-colored jacket - black shirt - brown hair - surprised expression\nJoey Tribbiani: dark shirt - light-colored jacket - brown hair - smiling expression\nUnidentified person: dark shirt - dark pants - dark hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on the orange couch, gesturing animatedly while speaking. Monica stands near the table, looking down then up at Ross. Rachel stands near the couch, gesturing with her hands as she speaks to Ross. Chandler sits on the couch, looking at Monica and then at Ross. Joey enters the scene and sits down next to Monica, smiling and talking to her. Ross continues to gesture while speaking, looking between Monica and Rachel.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden coffee table (with magazines)\n- Bar stools (in background)\n- Brick wall decor (background)\n-",
    "subtitles": "- Otherwise, I just ignore it. - What about Andre? This morning he got a call from what I think was our cousin Nathan. And frankly, it was a little more than I needed to know. Hey. That was gonna be my opener. Hey, did you guys check out those new hand dryers in the bathroom? - I thought that was just a rumor. RACHEL: True story. All right, look, I gotta tell you something. I'm not 17. I only said that so you'd think I was cute and vulnerable. I'm actually 30. I have a wife. I have a job. I'm your congressman. Monica, this is ridiculous. We are great together. We can talk, we make each other laugh. And the sex. Oh, man. Okay, I have no frame of reference, but I thought that was great. - It was. - Then what's the problem? Ethan, it's, um...",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:57.618",
    "end_chunk": "00:18:59.011"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with visible interior decor.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored polo shirt - jeans - dark, shoulder-length hair - animated expression\nChandler Bing: light-colored jacket over dark shirt - dark pants - short, brown hair - concerned expression\nRoss Geller: dark suit - patterned tie - dark hair - serious expression\nRachel Green: dark-colored dress - patterned skirt - long, blonde hair - smiling expression\nJoey Tribbiani: dark-colored shirt - dark pants - short, dark hair - relaxed expression\nPhoebe Buffay: light-colored top - patterned skirt - long, blonde hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits on the couch, gesturing expressively while speaking to Chandler, who leans forward, listening intently. Ross, Rachel, Joey, and Phoebe enter the scene from the background, standing near the bar area and observing the conversation. Chandler briefly touches Monica’s face as she speaks, then they both turn to look at the others who have entered. The group appears to be engaged in a casual, animated discussion.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center of frame)\n- Bar counter (background)\n- Coffee mugs (on counter)\n- Framed artwork (on wall)\n- Potted plant (near doorway)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a personal topic with Chandler, expressing concern and emotion. The",
    "subtitles": "It's icky. Icky? You're actually gonna throw this away because it's icky? Look, this isn't easy for me either. I wish things were different. If you were a few years older or I was a few years younger... ...or we lived in biblical times... ...I could really... - No, don't say it. - Love you. - Are your hands still wet? - They're moist. - Yeah, right? Ahem. - Let's dry them again. Or, like, \"Could these margaritas be any stronger?\" - Hey, Chandler. - Hello, Mr. Bing. Loved your Stevie Wonder last night. Thanks. Listen, about the weekly numbers, I'm gonna need them on my desk... ...by 9:00. SANTOS: Sure. - No problem.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00020",
    "start_chunk": "00:19:00.973",
    "end_chunk": "00:19:59.989"
  },
  "summary": "**SCENE OVERVIEW**\nThe scene begins in Monica's apartment living room in the evening and transitions to the same apartment during the daytime. It then shifts to an office setting and concludes in the Central Perk coffee shop, also during the daytime.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Animated, emotional, discussing a personal topic.\n*   **Chandler Bing:** Amused, serious, concerned, listening intently.\n*   **Rachel Green:** Engaged, smiling, concerned, listening.\n*   **Joey Tribbiani:** Animated, smiling, relaxed, engaged in conversation.\n*   **Ross Geller:** Serious, animated, listening, speaking.\n*   **Phoebe Buffay:** Animated, gesturing, discussing a system.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Monica's apartment where Monica, Rachel, Chandler, Joey, and Ross are gathered, engaging in animated conversation and laughter. Monica enters with a drink, her gestures and the group's reactions indicating a lively discussion. The scene transitions to the same apartment the next day, with Phoebe joining the group. Phoebe gestures animatedly while speaking to Ross, then later discusses her new beeper call system with Chandler in an office setting, where Chandler appears serious while she is animated. The group then reconvenes at the Central Perk coffee shop. Ross is animatedly speaking on the couch, with Monica, Rachel, Chandler, Joey, and Phoebe around. Monica and Chandler are seen in a focused, personal discussion on the couch, with Chandler showing concern and Monica expressing emotion. The others join and observe this conversation.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Shifting Locations:** The narrative moves from a domestic setting (Monica's apartment) to a workplace (office) and finally to a social hub (Central Perk), indicating different phases of the characters' day and interactions.\n*   **Conversational Dynamics:** The core of the interactions revolves around conversations, ranging from casual group discussions and animated exchanges to more focused and emotional one-on-one or small group talks.\n*   **Character Emotional States:** Characters are depicted with a range of emotions from amusement and engagement to seriousness and concern, highlighting developing relationships and plot points.\n*   **Specific Story Threads:** Phoebe's system for handling beeper calls and a personal discussion between Monica and Chandler are highlighted as specific conversational topics."
}