{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored dress - dark pants - blonde, shoulder-length hair - relaxed, sleeping\nRoss Geller: light-colored striped shirt - dark pants - dark hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands over Rachel Green, who is sleeping on the couch. He gently covers her with a colorful crocheted blanket, then walks away to put on his suit jacket. He returns, looking down at her with a concerned expression.\n\n### **OBJECTS AND PROPS:**\n- Crocheted blanket: multicolored (on couch)\n- Couch: white, patterned fabric (center of frame)\n- Lamp: lit, on side table\n- Refrigerator: blue, with magnets (background)\n- Coffee table: wooden, with magazines\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses work plans with colleagues in an office hallway, mentioning names like Gerston and Petrie. The conversation has a casual tone, with Ross appearing animated while speaking. The scene cuts to Ross in his apartment, where he is concerned about Rachel sleeping on the couch.\n\n### **TEMPORAL NOTES:**\nRachel Green transitions from sitting to sleeping on the couch.\nRoss Geller walks away from the couch and returns after putting on his jacket.\nRoss Geller stands over Rachel Green, looking down at her.",
    "subtitles": "You have to give them something, you know? Okay, that was Gerston, Santos, and who's the guy with the mustache? - Petrie. - Petrie. Right, right, okay. Well, some people are gonna be working... ...this weekend. [MUSIC PLAYING ON TV] [MOANING] RACHEL: Oh, that's nice. [MOANING] Ross.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00021",
    "start_chunk": "00:20:02.492",
    "end_chunk": "00:20:53.876"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting with visible kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: white t-shirt under black overalls - brown, shoulder-length hair - concerned expression\nRoss Geller: grey suit jacket over striped shirt with patterned tie - dark pants - short, dark hair - animated expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller enters the living room and approaches Rachel Green, who is asleep on the couch. He wakes her gently, then sits beside her and begins talking animatedly while gesturing with his hands. Rachel sits up, looks at Ross with a concerned expression, and listens as he speaks. Ross then stands up and gestures toward the kitchen area as he continues talking.\n\n### **OBJECTS AND PROPS:**\n- Crocheted blanket: multicolored (on couch)\n- Lamp: lit, beige shade (on side table)\n- Coffee table: wooden, with magazines on top\n- Refrigerator: blue, with magnets and notes (visible in kitchen area)\n- Framed photos: on shelves and walls\n- Orange couch: with red and white striped cushions\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses having a baby with Rachel Green. The conversation has a tense, serious tone, with Ross appearing animated and Rachel reacting with concern. Ross is visibly stressed and excited, while",
    "subtitles": "- Ross? - I'm here. You are? Uh... Ahem. [STAMMERS] We were just... - Wow. - What? [BEEPER BEEPING] Heh. Great. Now I'm having a baby. - What? - Oh! - No. I'm having... I'm having a baby! - Oh. Oh! - Oh, my God. - I'm having a...! - The phone, the phone! - The phone. I don't have the phone. Aah! - Ross? - I'm hurt. Monica, let's go. Come on, now, people. Woman in labor. - Hey, Ross, look what I got going here. - Yeah, save it for the cab, okay? What are you doing? We're going to a hospital. What, so I can't look nice? There might be doctors there. - Joey, get out of the fridge. JOEY: All right, all right.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00022",
    "start_chunk": "00:21:02.552",
    "end_chunk": "00:22:00.109"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nApartment hallway — evening, warm artificial lighting from wall sconces\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored shirt - dark suit jacket - dark, short hair - concerned expression\nRachel Green: dark-colored zip-up jacket - dark pants - shoulder-length brown hair - serious expression\nJoey Tribbiani: purple t-shirt - dark blue hoodie - dark, medium-length hair - smiling expression\nUnidentified person: dark-colored top - dark pants - dark, short hair - neutral expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands near a doorway, gesturing and speaking to Rachel Green, who holds a phone and listens with a serious expression. Joey Tribbiani stands nearby, holding a sandwich and smiling. An unidentified person stands beside Joey, also holding a sandwich. Ross Geller then turns and walks toward the hallway, gesturing as he speaks. Rachel Green follows him, still holding her phone. Joey Tribbiani and the unidentified person remain standing near the doorway, watching Ross and Rachel.\n\n### **OBJECTS AND PROPS:**\n- Sandwiches: held by Joey Tribbiani and the unidentified person\n- Phone: held by Rachel Green\n- Doorway: green door with gold numbers\n- Wall sconces: providing warm lighting\n- Recessed lighting: visible in the hallway\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses something with Rachel Green, who appears serious and listens intently. The conversation has a tense tone, with Ross Geller appearing concerned and Rachel Green reacting by holding her phone and listening.\n\n### **TEMPORAL NOTES:**\nRoss Geller walks toward the hallway and gestures as he speaks.\nRachel Green follows Ross Geller.\nJoey Tribbiani and the unidentified person remain standing near the doorway.",
    "subtitles": "- Joey, get out of the fridge. JOEY: All right, all right. - What is that? - For the ride. - Yeah, like in a cab you... - Save it. - Okay, hating this. - Monica, come on, now. Let's go. Baby coming. God. [CRYING] I can't believe it. I'm gonna be an aunt. - Oh, that's... - I'm gonna have a nephew. Oh, that's nice. Get out. - Come on. - Let's go, come on. RACHEL: Okay. Okay. JOEY: All right, all right, I'm going, I'm going. - Here we go. Here we go. - Rossy. Rossy. [ALL CHATTERING]",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00023",
    "start_chunk": "00:21:56.732",
    "end_chunk": "00:22:32.933"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes take place in Monica's apartment living room and a nearby apartment hallway during the evening. The setting remains consistent, with warm, artificial lighting.\n\n**KEY CHARACTERS**\n*   **Ross Geller:** Appears concerned and animated, discussing significant personal matters.\n*   **Rachel Green:** Initially sleeping, she wakes up to a serious conversation with Ross and appears concerned and intent.\n\n**MERGED NARRATIVE SUMMARY**\nIn Monica's apartment living room, Ross Geller watches over a sleeping Rachel Green, gently covering her with a blanket. He later wakes her to have a tense and animated conversation about having a baby, visibly stressed and excited. The discussion shifts to a hallway where Ross is still gesturing and speaking to a serious Rachel, who holds her phone. Joey Tribbiani and an unidentified person are present, observing as Rachel follows Ross down the hallway.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** A significant and potentially life-altering conversation about having a baby is initiated between Ross and Rachel, marked by serious emotional undertones.\n*   **Emotional Tone:** The overall emotional tone is tense and serious, particularly during the conversation about the baby, with Ross exhibiting stress and excitement, and Rachel showing concern.\n*   **Plot Setup:** The discussion about having a baby clearly sets up future plot developments related to this significant life decision.\n*   **Notable Transitions:** The narrative transitions from a quiet moment of Ross observing a sleeping Rachel to an intense, personal conversation, and then moves to a hallway setting where the conversation continues with Rachel following Ross."
}