{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored shirt - brown overalls - dark, shoulder-length hair - smiling, animated\nRoss Geller: dark-colored shirt - dark pants - dark, short hair - relaxed, smiling\nRachel Green: light-colored top - patterned pants - long, light brown hair - smiling, engaged\nChandler Bing: plaid shirt - blue jeans - dark, medium-length hair - smiling, relaxed\nPhoebe Buffay: light-colored top - dark pants - blonde, shoulder-length hair - smiling, engaged\nJoey Tribbiani: dark shirt - dark pants - dark, medium-length hair - smiling, relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits on the couch, gesturing expressively while speaking to Ross, who leans back with an arm around her shoulder. Rachel sits beside Monica, smiling and listening. Chandler sits in a green armchair, holding a magazine and smiling as he listens to the conversation. Phoebe sits on the couch, smiling and engaged in the conversation. Joey sits at the table, holding a coffee mug and smiling as he listens.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden coffee table (center)\n- Bar stools (behind counter)\n- Magazine (in Chandler's hands)\n- Coffee pot (on table)\n- Flower arrangement (on table)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a dream she had with Ross, who laughs and jokes about it. The conversation has a lighthearted, joking tone, with Monica appearing animated and Ross reacting with amusement. Rachel and Chandler listen with smiles, indicating they are enjoying the conversation.\n\n### **TEMPORAL NOTES:**\nNone observed",
    "subtitles": "MONICA: Tell him. Please tell him. - Tell him. - Shut up. - Tell me what? MONICA: You won't even look at him. - Oh, come on, tell me. I could use another reason why women won't look at me. All right, all right, all right. Last night, I had a dream... ...that, um, you and I were, uh... Doing it on this table. - Wow. - Excellent dream score. Why...? Why would you dream that? More importantly, was I any good? Well, you were pretty damned good. Ha, ha. Interesting, because in my dreams, I'm surprisingly inadequate. Well, last night, you seemed to know your way around the table. [ROSS CHUCKLES] I love it when we share. CHANDLER: You okay there?",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:02.127",
    "end_chunk": "00:01:00.934"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting. The iconic \"Central Perk\" sign is visible above the window.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark plaid shirt - blue jeans - dark, short hair - smiling and gesturing while talking\nRachel Green: blue shirt - pink skirt - shoulder-length brown hair - smiling, holding a coffee pot\nChandler Bing: dark shirt - dark pants - dark, short hair - looking down, then at Ross\nJoey Tribbiani: dark shirt - dark pants - dark, short hair - standing near the counter, looking at Ross\nUnidentified person: light blue shirt - light-colored pants - dark hair - standing near the counter, looking at Ross\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller is seated in a green armchair, animatedly talking and gesturing with his hands. Rachel Green stands beside him, holding a coffee pot and smiling. Chandler Bing stands nearby, looking down and then at Ross. Joey Tribbiani stands near the counter, looking at Ross. An unidentified person stands near the counter, looking at Ross.\n\n### **OBJECTS AND PROPS:**\nCoffee mugs: various colors (on table)\nGreen armchair (where Ross is seated)\nCoffee pot (held by Rachel Green)\nCounter (with various items)\nMenu board (behind counter)\nFloral arrangements (on tables)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses having sex in someone else's dream with Chandler Bing. The conversation has a casual tone, with Ross appearing animated and Chandler Bing looking concerned. The unidentified person and Joey Tribbiani are listening to the conversation.\n\n### **TEMPORAL NOTES:**\nRoss Geller stands up from his chair and walks toward the counter.\nChandler Bing walks toward the counter.\nJoey Tribbiani walks toward the counter.\nThe unidentified person walks toward the counter.",
    "subtitles": "CHANDLER: You okay there? I can't believe you two had sex in her dream. I'm sorry. It was a one-time thing. I was very drunk, and it was someone else's subconscious.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00002",
    "start_chunk": "00:00:59.893",
    "end_chunk": "00:01:10.527"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with neon signs visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored shirt - light-colored skirt - long, blonde hair - smiling/animated\nPhoebe Buffay: dark-colored patterned top - dark pants - long, blonde hair - serious/concerned\nChandler Bing: dark-colored shirt - dark pants - short, dark hair - relaxed/smiling\nRoss Geller: dark-colored shirt - dark pants - short, dark hair - serious\nJoey Tribbiani: plaid shirt - blue jeans - short, dark hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green enters the coffee shop, carrying a coffee pot, and walks toward the counter. Phoebe Buffay sits on the orange couch, writing in a notebook. Chandler Bing sits on a stool, holding a pen and writing. Ross Geller sits on the couch, holding a coffee mug. Joey Tribbiani sits in a green armchair, holding a piece of paper. The group is engaged in conversation, with Rachel speaking to Phoebe and Chandler, while Ross and Joey listen.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table and in hands)\n- Orange couch (center of frame)\n- Wooden table (with magazines and papers)\n- Bar stools (around counter)\n- Neon signs (visible",
    "subtitles": "- Hello, Rachel. - Ugh. Get off. Ooh. Oh, give me. Can you see me operating a drill press? I don't know. What are you wearing? Pheebs, why would you want to operate a drill press? Just for some short-term work. You know, till I get back some of my massage clients. Pirates again? No. Nothing like that. I'm just such a dummy. I taught this \"Massage Yourself at Home\" workshop. And they are. Hey, hey, Chan, she could work for you. Thanks, Joey. That's a good idea. What? I could. I could do it. What is it? Well, my secretary's gonna be out. She's having one of her boobs reduced. It's a whole big boob story. I could be a secretary. Well, I don't know if it's your kind of thing... ...because, uh, it involves a lot of being normal...",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00003",
    "start_chunk": "00:02:00.703",
    "end_chunk": "00:03:01.555"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with visible neon signs and brick walls.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored shirt - dark pants - dark, styled hair - animated, expressive\nMonica Geller: dark-colored sweater - jeans - dark, tied-back hair - serious, focused\nRachel Green: blue shirt - pink skirt - brown, shoulder-length hair - relaxed, listening\nPhoebe Buffay: patterned dress - light-colored top - blonde, long hair - smiling, engaged\nRoss Geller: plaid shirt - blue jeans - dark, short hair - concerned, gesturing\nJoey Tribbiani: dark sweater - light pants - dark, short hair - smiling, relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nChandler sits on the couch holding a green mug, talking animatedly and gesturing with his hands. Monica stands near the bar, talking to Ross who is seated and gesturing back. Rachel and Phoebe sit on the couch, listening to the conversation. Joey sits at a table, smiling and holding a mug. Ross holds a small object and speaks while gesturing. The group is engaged in a lively discussion, with Chandler and Monica being",
    "subtitles": "...because, uh, it involves a lot of being normal... ...ahem, for a large portion of the day. I could do that. [BEEPER BEEPING] - What are you playing with? - It's my new beeper. Why the hell does a paleontologist need a beeper for? Is it, like, for dinosaur emergencies? \"Help, come quick! They're still extinct!\" [CHANDLER LAUGHS] No, it's for when Carol goes into labor. She can get me wherever I am. All she has to do is dial 55-JIMBO. A cool phone number and a possible name for the kid. - I'll see you guys later. - Off to see young Ethan? Thank you. How young is young Ethan? Young? He's our age. When we were? - Okay, he's a senior in college. - College? JOEY: Ooh. - Whoa. And this man-child has no problem with how old you are? No, of course not. It's not even an issue... ...because I told him I was 22.",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:58.803",
    "end_chunk": "00:04:00.405"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica's apartment office — daytime, bright natural light from large windows\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored shirt - dark pants - dark, styled hair - smiling\nPhoebe Buffay: dark-colored vest over light shirt - dark pants - blonde, long hair - smiling\nUnidentified person: dark-colored jacket - dark pants - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler sits at his desk, smiling and gesturing as he talks to Phoebe, who is seated across from him. Phoebe holds a small object and laughs while talking to Chandler. She then stands up, picks up a phone, and begins talking on it while Chandler watches her with a concerned expression. She ends the call and sits back down, continuing the conversation with Chandler.\n\n### **OBJECTS AND PROPS:**\n- Desk: dark-colored, with papers, a phone, and a computer monitor\n- Chair: light-colored, behind the desk\n- Computer monitor: white, on desk\n- Phone: black, being used by Phoebe\n- Plant: green, in corner of room\n- Painting: abstract, on wall behind desk\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses a phone call with Chandler, who appears concerned about the conversation. The tone is casual and slightly tense, with Phoebe appearing animated and Chandler reacting",
    "subtitles": "...because I told him I was 22. - What? - What? - Oh, I can't pass for 22? - Well, maybe 25, 26. - I am 26. - There you go. [PHONE RINGING] Can you hear that? Yeah. Ha, ha. That'll stop when you pick up the phone. Oh. Ha, ha. - Okay. Ooh, I'm on. - Okay. [IN MELLOW VOICE] Mr. Bing's office. No, I'm sorry, he's in a meeting right now. I'm not in a meeting. I'm right... Will he know what this is in reference to? And he has your number? All right, I'll see that he gets the message. Bye-bye. - What? - [IN NORMAL VOICE] Ross says hi. Ah. This is so fun. All right, what do we do now?",
    "episode": "1x22 - The One with the Ick Factor",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:58.488",
    "end_chunk": "00:05:00.674"
  },
  "summary": "**SCENE OVERVIEW**\nThe events primarily take place in the Central Perk coffee shop during the daytime, with a shift to Monica's apartment office at the end.\n\n**KEY CHARACTERS**\nMonica Geller: Initially animated and discussing a dream, later serious and focused on a conversation.\nRoss Geller: Initially relaxed and joking, later animated and concerned while discussing a dream.\nRachel Green: Smiling and engaged in conversations.\nChandler Bing: Initially relaxed and smiling, later animated and concerned.\nPhoebe Buffay: Smiling and engaged, later serious and concerned.\nJoey Tribbiani: Relaxed and listening.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Central Perk with Monica, Ross, Rachel, Chandler, Phoebe, and Joey engaged in lighthearted conversation. Monica shares a dream with Ross, who jokes about it, while the others listen with amusement. The conversation then shifts to Ross discussing having sex in someone else's dream, with Ross animatedly explaining and Chandler appearing concerned. Later, the group continues their discussion at Central Perk, with Chandler and Monica being particularly animated. The scene then transitions to Monica's apartment office, where Chandler and Phoebe are talking. Phoebe receives a phone call that causes her to become serious, and Chandler appears concerned about the content of her conversation.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Initial lighthearted interactions among the group.\n*   **Emotional Tone:** Starts light and humorous, shifting to concern and tension, particularly around Ross's dream and Phoebe's phone call.\n*   **Plot Setup or Payoff:** Ross's dream discussion sets up a potentially humorous or awkward situation. Phoebe's concerned phone call hints at future plot developments.\n*   **Notable Transitions Between Locations or Conversations:** A clear shift from the communal setting of Central Perk to the more intimate setting of Monica's apartment office. The focus of the conversation also shifts from general chatter to more specific, potentially problematic topics."
}