{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and brick wall decor.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored top under dark cardigan - long, light brown hair, partially tied back - expression shifts from serious to concerned\nRoss Geller: dark-colored knit sweater - dark pants - short, dark hair - expression animated, then concerned\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair tied back - expression concerned\nPhoebe Buffay: dark-colored top - long, blonde hair - expression concerned\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Rachel are initially seated facing each other, engaged in a serious conversation. Ross stands up and gestures while speaking, then embraces Rachel, who leans into him. The scene shifts to Monica and Phoebe seated at a table, eating from a tray. Ross enters the room, and all four characters gather together, standing and talking. Ross continues to speak animatedly while the others listen with concerned expressions.\n\n### **OBJECTS AND PROPS:**\n- Aluminum tray with food (on table)\n- Water bottle (on table)\n- Lamp (on table)\n- Refrigerator (with magnets)\n- Brick wall (background)\n- Wooden shelves (with decor)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the idea of Rachel swearing off guys with the group. The conversation has a serious tone, with Ross appearing animated and concerned, while Rachel, Monica, and Phoebe react with concern and listen intently.\n\n### **TEMPORAL",
    "subtitles": "I'm so sick of guys. I don't want to look at another guy. I don't want to think about another guy. I don't even want to be near another guy. [RACHEL SIGHS] Huh. - Ross, you're so great. - Oh, ha, ha. MONICA: Are you all right? PHOEBE: Are you okay? Medium. Heh. - Any cookies left? - Yeah. Heh. See, Rach, um... See, I don't think swearing off guys altogether is the answer. I really don't. I think what you need is to develop a more sophisticated screening process. No. No. I just need to be by myself for a while. You know? I just gotta figure out what I want. No, no.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00021",
    "start_chunk": "00:19:59.990",
    "end_chunk": "00:21:01.175"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting with visible kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - jeans - dark, short hair - animated expression\nRachel Green: light-colored patterned dress - unclear lower clothing - shoulder-length brown hair - concerned expression\nMonica Geller: dark-colored top - unclear lower clothing - dark, shoulder-length hair - serious expression\nPhoebe Buffay: dark-colored top - unclear lower clothing - long blonde hair - concerned expression\nChandler Bing: light-colored shirt - khaki pants - dark, medium-length hair - smiling expression\nJoey Tribbiani: plaid shirt - blue jeans - dark, medium-length hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands in the kitchen area, gesturing animatedly while speaking to the group. Rachel Green, Monica Geller, and Phoebe Buffay are seated together, listening intently and reacting with concern. Ross then moves to the refrigerator, opens it, and pulls out a bottle, continuing to gesture and speak. The scene cuts to Chandler Bing and Joey Tribbiani entering from the hallway, both smiling and gesturing as they greet Ross. Ross turns to face them, looking surprised.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, with magnets and photos on door (kitchen area)\n- Vase with yellow flowers: hanging on wall (kitchen area)\n- Foosball table: black, with red and blue",
    "subtitles": "No, no. See, because not all guys out there are gonna be a Paolo. No, I know. I know. And I'm sure your little boy's not gonna grow up to be one. - What? - What? [STAMMERING] I'm having a boy? Uh, no. No. In fact, you're not having a boy. I'm having a boy. [STAMMERING] Am I having a boy? - You're having a boy. - Aah! - I'm having a boy. I'm having a boy. - Yes! - What? - What is it? I'm having a boy. I'm having a boy. Hey. [IN UNISON] We already knew that. I'm having a son. Um... Yes. And that would be a shutdown.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00022",
    "start_chunk": "00:20:59.007",
    "end_chunk": "00:22:01.652"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — late evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - unclear lower clothing - dark, short hair - expression shifts from surprised to serious\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated, smiling expression\nChandler Bing: dark-colored shirt - unclear lower clothing - dark, medium-length hair - expression shifts from concerned to relaxed\nJoey Tribbiani: plaid robe over white shirt - unclear lower clothing - dark, medium-length hair - expression shifts from serious to relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Joey are playing foosball, with Monica gesturing animatedly while speaking. Ross stands nearby, looking on with a serious expression. Chandler stands beside Joey, reacting to the conversation. Monica turns and gestures toward the door as she speaks, then turns back to the foosball table. Joey and Chandler react to Monica’s comments, with Joey appearing to be speaking or responding. The group is engaged in a lively conversation while playing the game.\n\n### **OBJECTS AND PROPS:**\nFoosball table (center of frame)\nRefrigerator (with magnets) (background)\nCouch (background)\nBulky lamp (on wall)\nBike poster (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (on wall)\nBulky lamp (",
    "subtitles": "Yes. And that would be a shutdown. [IN UNISON] Shutout! Where you guys going? Come on, one more game. - Oh. It's 2:30 in the morning. - Yeah. Get out. You guys are always hanging out in my apartment. Come on, I'll only use my left hand, huh? Come on, wussies. - All right. Okay. I gotta go. - Mm-hm. I'm going. And I'm gone. - One more game? - Oh, yeah.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00023",
    "start_chunk": "00:21:58.859",
    "end_chunk": "00:22:35.186"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment living room and kitchen area during the evening. The scene remains consistent throughout.\n\n**KEY CHARACTERS**\n- **Ross Geller:** Initially animated and concerned, then surprised.\n- **Rachel Green:** Serious and concerned.\n- **Monica Geller:** Concerned, then animated and smiling.\n- **Phoebe Buffay:** Concerned.\n- **Chandler Bing:** Smiling, then relaxed.\n- **Joey Tribbiani:** Smiling, then serious, then relaxed.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens with Ross and Rachel engaged in a serious conversation in Monica's living room, with Monica and Phoebe present and concerned. Ross animatedly discusses an idea about Rachel swearing off guys, eventually embracing her. The group then gathers together, with Ross continuing to speak earnestly to the concerned listeners. Meanwhile, Chandler and Joey arrive, greeted by Ross with surprise, and join the group. The setting shifts slightly to include the kitchen area, where Ross is still gesturing and speaking. The focus then moves to Monica and Joey playing foosball in the kitchen/living area, with Monica animatedly discussing something. Ross observes with a serious expression, while Chandler reacts to the conversation. The group is involved in a lively, ongoing discussion.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   A serious conversation between Ross and Rachel, hinting at relationship dynamics or a significant decision.\n*   The emotional tone shifts from concern to liveliness and humor as more characters join and engage in activities like playing foosball.\n*   Introduction of Chandler and Joey into the ongoing discussion, expanding the group dynamic.\n*   The scene transitions from a focused conversation involving Ross and Rachel to a more general group interaction with a lighter, more playful atmosphere."
}