{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown suede jacket - light-colored shirt - dark, short hair - smiling and animated\nUnidentified person: dark-colored turtleneck sweater - dark pants - blonde hair in ponytail - smiling and engaged\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller enters the apartment carrying a foil-covered dish and a grocery bag, greeting the unidentified person. They exchange pleasantries and share a warm hug. Ross then pulls out a small notebook or journal, reading from it while the unidentified person watches with a smile. Ross becomes animated, gesturing with his hands as he speaks, and the unidentified person reacts with expressive facial movements, including laughing and looking surprised.\n\n### **OBJECTS AND PROPS:**\n- Foil-covered dish: (held by Ross)\n- Grocery bag: white mesh (held by Ross)\n- Notebook/journal: black cover (held by Ross)\n- Lamp: white fringed shade (on side table)\n- Bookshelf: wooden, filled with various items (background)\n- Coffee maker: white (on counter)\n- Vase with sunflowers: (on counter)\n- Framed artwork: colorful (on wall)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the results of an amniocentesis with the unidentified person, who reacts with excitement and relief. The conversation has a happy, lighthearted tone, with Ross appearing enthusiastic and the unidentified person reacting by smiling and laughing. The dialogue also includes a humorous aside about a friend named Tanya, which causes Ross to groan in exasper",
    "subtitles": "Is it vegetarian? Because Susan doesn't eat meat. I'm pretty sure that it is. Yeah. So I got the results of the amnio today. Oh, tell me. Is everything? Totally and completely healthy. - Oh, that's great. That is great. - Ha, ha. Ah. Hey. When did you and Susan meet Huey Lewis? Uh, that's our friend Tanya. Of course it's your friend Tanya. Don't you wanna know about the sex? The sex? Yeah, I'm having enough trouble with the image of you and Susan together. But when you throw in Tanya... [GROANS] The sex of the baby, Ross.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:59.549",
    "end_chunk": "00:05:59.441"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown suede jacket - light-colored shirt - dark, short hair - animated\nPhoebe Buffay: dark green velvet turtleneck - dark pants - blonde, tied back in ponytail - smiling\nSusan: light-colored blazer - dark skirt - long, curly brown hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller stands and gestures animatedly while talking to Phoebe Buffay, who is seated on the couch. Susan enters the room, walks over to Phoebe, and they embrace warmly. Ross watches them, then gestures toward Susan and Phoebe as he continues talking, appearing amused and slightly exasperated.\n\n### **OBJECTS AND PROPS:**\n- Striped couch (center of frame)\n- Wooden coffee table (with various items)\n- Framed artwork on walls\n- Lamp with floral pattern (on side table)\n- Shelving unit with various items (background)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the sex of a baby with Phoebe Buffay and Susan. The conversation has a lighthearted, joking tone, with Ross appearing animated and Ph",
    "subtitles": "Oh. You know the sex of the baby? - Uh-huh. - Oh, oh, oh! - Do you want to know? - No, no, no. No, I don't want to know. Absolutely not. No, I think you shouldn't know until you look down there... ...and see, \"Oh, there it is.\" Or isn't. - Oh. Hello, Ross. - Susan. So? So did you hear? Yes, we did. Everything's A-okay. Oh, that's so cool. CAROL: It really is. Ha, ha. Do we know? - We certainly do. It's going to be a... - Hey, hey! Ho, ho! Hello? See, a guy who doesn't wanna know standing right here. Oh. Ha, ha. Uh, well, is it what we thought it would be? - Mm-hm. - Aah! What? Okay, what did we think it' was gonna be? No, no, no. I don't want to know. Don't want to know. Okay.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00007",
    "start_chunk": "00:06:00.902",
    "end_chunk": "00:07:00.794"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: brown jacket - light-colored shirt - dark, short hair - smiling\nRachel Green: dark green velvet robe - blonde hair in ponytail - smiling\nMonica Geller: light-colored blazer - dark pants - curly brown hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nRoss enters and greets Rachel, who is hugging Monica. He gestures animatedly while talking to them, then kisses Rachel on the cheek. Rachel walks away, and Monica laughs while sitting on the couch. Rachel then walks to the counter, leans over it, and appears to be talking on the phone. Later, Chandler and Joey are seated at the kitchen table eating lasagna, talking and gesturing to each other.\n\n### **OBJECTS AND PROPS:**\n- Lasagna dish (on table)\n- Bar stools (at table)\n- Television (in background)\n- Framed artwork (on wall)\n- Lamp (on side table)\n- Calendar (on wall)\n- Fruit bowl (on counter)\n- Phone (on counter)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a table purchase with Rachel and Monica. The conversation has a casual tone, with Ross appearing animated and Rachel reacting with amusement. Monica is seen laughing while seated on the couch.\n\n### **TEMPORAL NOTES:**\nRachel walks from the",
    "subtitles": "I don't want to know. Don't want to know. Okay. You know, I should probably just go. - Well, thanks for the books. - No problem. Okay. Susan. All right, who should we call first? Your folks or Deb and Rhona? [DOOR BUZZER] Hello? ROSS [OVER INTERCOM]: Uh... Never mind. I don't wanna know. Okay, so just because it was my table, I have to buy a new one? That's the rule. What rule? There's no rule. If anything, you owe me a table. - How did you get there? - I believe this piece of furniture was fine... ...until your little breakfast adventure with Angela Delveccio. You knew about that? The impressions you made in the butter... ...left little to the imagination. Okay, okay. How about if we split it? What do you mean, like, buy it together?",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:58.584",
    "end_chunk": "00:08:00.187"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and indoor decor.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored patterned shirt - dark pants - dark, medium-length hair - animated expression\nRoss Geller: light brown V-neck shirt - blue jeans - dark, medium-length hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Ross are seated at a dining table, engaged in an animated conversation while eating. Chandler gestures emphatically with his hands as he speaks, while Ross listens intently, occasionally responding. Ross stands up and walks toward the kitchen area, then returns to the table, continuing the discussion. The scene shifts to a spa setting where a woman in a red plaid shirt interacts with another woman near a massage table, and a man in a white robe enters the room.\n\n### **OBJECTS AND PROPS:**\n- Dining table (center of frame)\n- Chairs (red and brown leather)\n- Books (on shelf behind table)\n- Decorative figurine (on shelf)\n- Refrigerator (visible in kitchen area)\n- Massage table (covered with blue sheet)\n- Wicker shelves (with spa",
    "subtitles": "What do you mean, like, buy it together? Yeah. Do you think we're ready for something like that? - Why not? - Well, it's just a big commitment. I mean, what if one of us wants to move out? - Why, are you moving out? - I'm not moving out. You'd tell me if you were moving out, right? - Yes, it's just that, with my last roommate... - Oh, I know all about Kip. We bought a hibachi together, and then he ran off and got married... ...and things got pretty ugly. So let me ask you something. Was Kip a better roommate than me? Oh, don't do that. You've got a couple changes in your schedule. Your 4:00 herbal massage has been pushed back to 4:30. And Ms. Summerfield canceled her 5:30 shiatsu. Okay. Thanks. Oh. Here comes your 3:00. I don't mean to sound unprofessional, but, yum. [SPEAKING IN ITALIAN] Oh. Paolo. Hi. What are you doing here?",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:58.186",
    "end_chunk": "00:09:01.331"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nA massage room with blue walls and wicker furniture — daytime, bright natural light from a window.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: light-colored patterned top - dark vest - blonde hair in ponytail - smiling\nUnidentified person: white robe - long dark hair - expression: animated, gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay stands by a massage table, smiling and gesturing as she speaks to an unidentified person in a white robe who enters the room. The unidentified person, wearing a robe, gestures back and appears animated in conversation. Phoebe then picks up a towel and begins to drape it over the table. The scene cuts to Central Perk coffee shop, where Rachel Green, holding a coffee pot, stands over Ross Geller, who is seated and holding a mug. Monica Geller sits nearby, smiling. The group is engaged in conversation, with Rachel appearing animated and Ross looking up at her.\n\n### **OBJECTS AND PROPS:**\n- Massage table: covered with blue sheet\n- Wicker furniture: shelves and cabinet\n- Coffee mugs: various colors (on tables)\n- Coffee pot: dark-colored (held by Rachel)\n- Orange couch (Central Perk)\n- Brick wall decor (Central Perk background)\n\n###",
    "subtitles": "Oh. Paolo. Hi. What are you doing here? Uh, Rachella tell me you... ...massage? Yeah, well, Rachella's right. Yeah. [SPEAKING IN ITALIAN] Oh. Okay, I don't know what you just said, so let's just start. Uh, I am, uh... ...being naked? Um, that's really your decision. I mean, some people prefer, you know, to take off... Ooh, oops! Being naked. I can't believe you don't want to know. I mean, I could not know. I mean, if the doctor knows, and Carol knows, and Susan knows... And Monica knows. Heh. How could you? I don't even know. Carol called to thank me for the lasagna. I asked. She told me. So, what's it going to be? Whoa. Huh? Oh, great. Now he knows and I don't know. I'm sorry. I'm just excited about being an aunt.",
    "episode": "1x12 - The One with the Dozen Lasagnas",
    "chunk": "chunk_00010",
    "start_chunk": "00:08:57.745",
    "end_chunk": "00:10:00.473"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment living room during the evening, with a brief transition to a spa setting, and then back to Central Perk.\n\n**KEY CHARACTERS**\n- Ross Geller: Appears animated and engaged in conversations about an amniocentesis and a table purchase.\n- Phoebe Buffay: Present in the apartment, later seen in a spa setting.\n- Susan: Appears in the apartment and embraces Phoebe.\n- Rachel Green: Appears in the apartment, interacts with Ross and Monica, and is later seen at Central Perk.\n- Monica Geller: Present in the apartment, relaxed and laughing.\n- Chandler Bing: Seen at the apartment's dining table, engaged in conversation.\n- Joey Tribbiani: Seen at the apartment's dining table, eating lasagna.\n- Unidentified person (Chunk 1): Receives good news about an amniocentesis from Ross.\n- Unidentified person (Chunk 5): In a spa setting, conversing with Phoebe.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Monica's apartment living room in the evening. Ross arrives with a dish and a grocery bag and shares a warm greeting with an unidentified person. He reads from a notebook, discussing the results of an amniocentesis, which elicits an excited and relieved reaction from the unidentified person. A humorous mention of a friend named Tanya causes Ross to groan. Shortly after, Phoebe and Susan arrive and embrace. Ross continues to animate the conversation with Phoebe and Susan, appearing amused by their interaction. The scene then shifts to Ross greeting Rachel and Monica. He discusses purchasing a table with Rachel and Monica, who reacts with amusement. Later, Chandler and Joey are shown at the kitchen table, eating lasagna and conversing. A brief scene then shifts to a spa, where a woman interacts with another near a massage table, and a man in a robe enters. In the spa setting, Phoebe talks to an unidentified person in a robe, and the unidentified person gestures animatedly. Finally, the scene cuts to Central Perk, where Rachel is holding a coffee pot and serving Ross and Monica, who are seated and engaged in conversation.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** The warm greetings and embraces between characters (Ross and unidentified person, Susan and Phoebe, Ross and Rachel/Monica) highlight established friendships and relationships.\n*   **Emotional Tone:** The overall emotional tone is lighthearted and happy, particularly around the amniocentesis news. There's also amusement and casual conversation among the group.\n*   **Plot Setup:** The mention of an amniocentesis suggests a pregnancy storyline is being discussed. The presence of lasagna hints at a shared meal or gathering. The brief spa scene seems disconnected from the main apartment narrative but might be a character's separate activity.\n*   **Notable Transitions:** The scene transitions from Monica's apartment to a spa and then to Central Perk, indicating different character activities and locations. The conversation topics shift from medical news to everyday matters like furniture purchases and meals."
}