{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and indoor decor.\n\n### **CHARACTERS PRESENT:**\nJoey Tribbiani: dark jacket over striped shirt - blue jeans - dark, styled hair - animated expression\nPhoebe Buffay: dark dress - long blonde hair - smiling expression\nChandler Bing: dark jacket over striped shirt - blue jeans - dark, styled hair - concerned expression\nRachel Green: dark sweater - dark pants - dark, shoulder-length hair - focused expression\nMonica Geller: dark sweater - dark pants - dark, shoulder-length hair - focused expression\nUnidentified person: dark suit - dark tie - dark hair - serious expression\n\n### **ACTIONS AND INTERACTIONS:**\nJoey enters the apartment and gestures while speaking to the group seated around the table. Phoebe stands near the kitchen counter holding a mug. Chandler and Monica are seated at the table, both knitting. Rachel sits at the table, also knitting. The group appears engaged in conversation. The scene cuts to an exterior shot of a tall building, then back inside to Chandler and Monica in an office setting, where Chandler is talking animatedly to an unidentified man in a suit.\n\n### **OBJECTS AND PROPS:**\n- Knitting needles and yarn (in hands of Chandler and Monica)\n- Wooden dining table (center of frame)\n- Blue kitchen cabinets (visible in background)\n- White computer monitor (on desk in office scene)\n- Books",
    "subtitles": "Knit, good woman. Knit. Knit. [KNOCK ON DOOR] And that's the Chrysler Building right there. NINA: Oh. - Nina. - Mr. Douglas. Cool tie. She's still here. Yes. Yes, she is. Didn't I memo you on this? See, after I let her go, uh, I got a call from her psychiatrist, Dr. Flanen... ...Dr. Flanan, Dr. Flan. [CHANDLER CLEARS THROAT] And, uh, he informed me that she took the news rather badly. In fact, he, uh, mentioned the word \"frenzy.\" You're kidding. She seems so... Oh, no, no. Nina? She's: In fact, if you asked her now... ...she'd have no recollection of being fired at all. That's unbelievable.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:59.648",
    "end_chunk": "00:16:01.084"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nOffice setting — daytime, bright artificial and natural light from windows\nLiving room setting — evening, dim lighting with warm tones\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored jacket - brown vest - dark hair - serious expression\nUnidentified person: dark suit - dark tie - dark hair - serious expression\nRachel Green: white shirt - black vest - blonde, shoulder-length hair - concerned expression\nPhoebe Buffay: white shirt - black vest - curly brown hair - concerned expression\nJoey Tribbiani: camouflage jacket - red shirt - dark hair - animated expression\nUnidentified person: dark-colored top - dark hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller and an unidentified man in a suit are engaged in an intense conversation in an office, gesturing emphatically. The scene cuts to a living room where a group of people, including Rachel Green and Phoebe Buffay, are sitting on the floor and couches, holding baby dolls and reacting with concern and amusement to a television show about childbirth. Joey Tribbiani stands up holding a baby doll, interacting with Rachel Green, who laughs and gestures animatedly. The group appears to be participating in a baby shower or parenting class, with everyone holding dolls and reacting to the TV.\n\n### **OBJECTS AND PROPS:**\n- Television: black Sony brand (on stand)\n-",
    "subtitles": "That's unbelievable. And yet believable. So I decided not to fire her again... ...until I'm sure she will be of no threat to herself or others. I see. Hmm. You never really know what's going on inside a person's head. Well, I guess that's why they call it psychology, sir. NARRATOR [ON TV]: The sound Mom and Dad will never forget. For this, after all, is the miracle of birth. TEACHER: Lights, please. And that's having a baby. Next week is our final class. Susan, go deep. CAROL: It's impossible. It's just impossible. What is, honey? What that woman... ...did. I am not doing that. Heh. It'll have to stay in, that's all. Everything will be the same. - It'll just stay in. Ha, ha. - Carol, honey. Shh. - Everything will be all right. - What do you know?",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:59.917",
    "end_chunk": "00:17:01.936"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with decorative lamps and bar area visible.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light-colored jacket over dark shirt - light-colored pants - short, dark hair - concerned expression\nRachel Green: dark-colored top - dark pants - shoulder-length brown hair - concerned expression\nChandler Bing: light-colored shirt under brown vest - patterned tie - medium-length brown hair - serious expression\nUnidentified person: dark-colored top - dark pants - long, curly brown hair - concerned expression\nUnidentified person: light-colored top - dark pants - long, blonde hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on the couch holding a baby doll wrapped in a floral blanket, looking anxious as Rachel leans over him, holding his hand and speaking reassuringly. Chandler sits beside Ross, looking concerned and gesturing with his hand as he speaks. An unidentified woman with curly hair stands nearby, looking at Ross with concern. Another unidentified woman with blonde hair stands near the couch, smiling and looking at Ross. The group appears to be discussing the baby, with Rachel offering comfort to Ross.\n\n### **OBJECTS AND PROPS:**\n- Baby doll: wrapped in floral blanket (held by Ross)\n- Orange couch (center of frame)\n- Wooden table (with magazines and cups)\n- Bar stools (in background)\n- Decorative lamps (on tables)\n- Menu board",
    "subtitles": "- Everything will be all right. - What do you know? No one's saying to you, \"Hi, is that your nostril? Mind if we push this pot roast through it?\" Carol, sweetie. Cleansing breath. I know it's frightening. But big picture: The birth part is just one day... ...and when it's over, we'll all be parents for the rest of our lives. SUSAN: I mean, that's what this is all about, right? Ross? Ross. I'm gonna be a father. - This is just occurring to you? - I always knew I was having a baby. I just never realized the baby was having me. Oh, you're gonna be great. How could you say that? I can't even get Marcel to stop eating the bathmat. How will I raise a kid? You know, Ross, some scientists are now saying... ...that monkeys and babies are actually different.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:59.268",
    "end_chunk": "00:17:56.657"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with bar area visible in background.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored shirt - brown vest - dark, medium-length hair - animated expression\nRoss Geller: light-colored sweatshirt - floral blanket draped over lap - short, dark hair - serious expression\nRachel Green: dark-colored top - long, light brown hair - concerned expression\nChandler Bing: light-colored shirt - brown vest - dark, medium-length hair - animated expression\nJoey Tribbiani: plaid shirt - dark t-shirt underneath - dark, medium-length hair - serious expression\nPhoebe Buffay: dark blue sweater with white sleeves - long, blonde hair - animated expression\nUnidentified person: dark-colored dress - long, curly hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nChandler sits on the couch, gesturing animatedly while speaking to Ross, who is wrapped in a blanket and looking down. Rachel stands nearby, observing the conversation. Joey enters from the bar area, holding a mug, and walks toward the table where Phoebe is seated. Phoebe gestures with her hands as she speaks to Joey. The scene cuts to an office setting where Joey, now in a suit, stands and talks to an unidentified woman with curly hair who is standing by the door.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with magazines and m",
    "subtitles": "- Where are you going? - Out. With? Yes. All right, can I just ask you one question? Have you two, you know, like, you know? You know? Yet? Well, not that it's any of your business... ...but no, we haven't, okay? You meant sex, right? [KNOCK ON DOOR] - Do you have a sec? - Uh, sure, Nina. What's up? I don't know. For the past couple days, people have been avoiding me... ...and giving me these really strange looks. Oh, well, uh, maybe that's because... ...they're, uh, jealous of us. Maybe. But that doesn't explain why they keep taking my scissors. Uh, well, maybe that's, uh, because you're getting a big raise.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00019",
    "start_chunk": "00:18:00.037",
    "end_chunk": "00:19:02.098"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nAn office setting during the day, with vertical blinds and framed artwork on the walls. The scene transitions to a living room at night, decorated with Christmas lights and a coffee table with snacks.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark suit jacket - white shirt - patterned tie - dark, wavy hair - expression shifts from serious to animated\nRachel Green: dark-colored top - dark pants - long, wavy brown hair - smiling, engaged in conversation\nMonica Geller: dark sweater - black pants - dark, shoulder-length hair - focused, reading a magazine\nRoss Geller: dark-colored shirt - light-colored pants - short, dark hair - expression shifts from serious to amused\nPhoebe Buffay: dark top - dark pants - long, curly brown hair - animated, gesturing while speaking\nJoey Tribbiani: dark-colored shirt - light-colored pants - short, dark hair - relaxed, holding a drink bottle\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Rachel are in an office, initially standing and talking, then Chandler gestures animatedly while Rachel reacts with excitement and hugs him. The scene shifts to a living room where Monica, Ross, Chandler, Rachel, and Phoebe are seated, watching TV. Chandler and Rachel are engaged in conversation, with Chandler gesturing as he speaks. Monica reads a magazine while Ross holds a drink bottle. Phoebe is",
    "subtitles": "Uh, well, maybe that's, uh, because you're getting a big raise. - I am? - Sure. Why not? Oh, my God. You're amazing. Oh, you don't know. Helen, make sure we put through the paperwork on Miss Bookbinder's raise. HELEN [OVER INTERCOM]: Still want her psychological profile sent to personnel? - What? - Helen drinks. Will you marry me? - Well, I ended up telling her everything. - Ooh. How'd she take it? Pretty well. Except for the stapler thing. Little tip. If you're ever in a similar situation... ...never, ever leave your hand on the desk. Okay, I think I get how to do this. [SPEAKING IN SPANISH] Can we turn this off? Can we make them go away? Because I can't watch. - Okay, Pheebs, they're gone. - Okay.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:58.262",
    "end_chunk": "00:20:00.948"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes shift between Monica's apartment living room in the evening, an office setting during the day, and Central Perk coffee shop during the day.\n\n**KEY CHARACTERS**\n- **Monica Geller:** Present in her apartment and later in the living room.\n- **Chandler Bing:** Appears in Monica's apartment, an office, and Central Perk.\n- **Joey Tribbiani:** Appears in Monica's apartment, later in an office.\n- **Rachel Green:** Present in Monica's apartment, Central Perk, and an office.\n- **Phoebe Buffay:** Present in Monica's apartment, Central Perk.\n- **Ross Geller:** Appears in an office setting and Central Perk, often with a baby doll and looking anxious.\n- **Unidentified persons:** Include individuals in suits in an office, and other women in social settings.\n\n**MERGED NARRATIVE SUMMARY**\nThe narrative begins in Monica's apartment living room where a group, including Joey, Phoebe, Chandler, Rachel, and Monica, are gathered. Chandler and Monica are seen knitting, while Joey gestures and speaks. The scene then abruptly shifts to an office where Chandler is seen talking intensely with an unidentified man in a suit. Simultaneously, Ross is also shown in an intense conversation in an office. Later, back in a living room setting, Rachel, Phoebe, and others are reacting to a television program about childbirth, holding baby dolls and appearing to be part of a parenting class or baby shower. Joey is also present, interacting with Rachel. The scene transitions to Central Perk, where Ross is holding a baby doll wrapped in a floral blanket, appearing anxious. Rachel and Chandler are present, offering him comfort and support. Another unidentified woman expresses concern, while a blonde woman smiles nearby. Finally, back in an office, Chandler and Rachel share an animated conversation that ends in a hug. The scene then shifts to a living room, decorated for Christmas, where Monica, Ross, Chandler, Rachel, and Phoebe are gathered, with Monica reading a magazine and Phoebe animatedly speaking while Ross holds a drink.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Parenting and Anxiety:** Ross's anxiety surrounding a baby is a recurring theme, shown through his interactions with a baby doll and his friends' attempts to comfort him.\n*   **Shifting Scenarios:** The frequent transitions between different locations (apartment, office, coffee shop) suggest multiple storylines or quick scene changes characteristic of a sitcom.\n*   **Interpersonal Support:** The interactions between the friends, particularly Rachel and Chandler comforting Ross, highlight their supportive relationships.\n*   **Unfolding Events:** The presence of unidentified individuals in suits in office settings suggests plot points that are not fully revealed within these chunks.\n*   **Social Gatherings:** The depiction of a baby-related event and a Christmas-decorated living room indicates social gatherings and thematic elements tied to holidays."
}