{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and decorative items.\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: patterned long-sleeve top - unclear lower clothing - long blonde hair in a high ponytail - animated, expressive\nRachel Green: white t-shirt with red square - denim overalls - shoulder-length brown hair - serious, listening\nRoss Geller: dark-colored shirt - light-colored pants - short dark hair - concerned, listening\nMonica Geller: dark-colored sweater with red pattern - dark pants - dark hair - reading a book, listening\nChandler Bing: dark suit jacket - dark pants - short dark hair - concerned, listening\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe Buffay sits on the floor, gesturing animatedly while speaking to the group. Rachel Green sits on the couch, looking downcast and listening. Ross Geller sits beside her, holding a drink and looking concerned. Monica Geller sits on the couch, reading a book and listening. Chandler Bing sits on the couch, looking at Phoebe with a concerned expression.\n\n### **OBJECTS AND PROPS:**\n- Popcorn bowl: blue rimmed (on coffee table)\n- Book: \"Amadeo Modigliani\" (on coffee table)\n- Coffee table: wooden",
    "subtitles": "- Okay, Pheebs, they're gone. - Okay. - Are you all right? - Yeah. It's just, you know, this whole stupid Ursula thing. Okay, Pheebs, can I ask? So he's going out with her. Is it really so terrible? Um, yeah. I mean, I'm not saying she's evil or anything. She's just, you know, always breaking my stuff. When I was 8, I wouldn't let her have my Judy Jetson Thermos... ...so she threw it under the bus. And then there's Randy Brown... ...who was like... Have you ever had a boyfriend who was like your best friend? - No. - No. Well, but that's what he was for me. And she, you know, kind of stole him away... ...and then broke his heart. And then he wouldn't even talk to me anymore. He didn't want to be around anything that looked like either one of us. Oh, Pheebs.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00021",
    "start_chunk": "00:19:59.239",
    "end_chunk": "00:21:00.174"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm indoor lighting with visible lamps and decorative lights in the background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored shirt - denim overalls - brown, shoulder-length hair - concerned expression\nMonica Geller: dark-colored sweater - dark pants - dark, tied-back hair - animated expression\nRoss Geller: dark-colored jacket - light-colored pants - dark, short hair - serious expression\nPhoebe Buffay: plaid shirt - unclear lower clothing - blonde hair in ponytail - neutral expression\nJoey Tribbiani: dark-colored shirt - unclear pants - dark, medium-length hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, holding a bowl of popcorn and gesturing while speaking to Monica, who stands up and walks away. Monica exits the room, leaving the others seated. Phoebe enters from the hallway and stands facing Monica, who is now in the doorway. The group remains seated, listening to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Popcorn bowl: blue and white (on table)\n- Book: \"Amedeo Modigliani\" (on table)\n- Lamp: with patterned shade (on side table)\n- Fern: in large pot (corner of room)\n- Picture frame: on side table\n- Rugs: patterned (on floor)\n- Radiator: near doorway\n\n### **DIALOGUE CONTEXT:**\nRachel discusses Joey’s feelings for another woman with Monica, who is visibly upset and walks away. The conversation has a tense tone, with Rachel appearing concerned and Monica reacting by leaving the room. Phoebe enters and stands facing Monica, indicating a potential confrontation or discussion.\n\n### **TEMPORAL NOTES:**\nMonica Geller stands",
    "subtitles": "Oh, Pheebs. I mean, I know Joey's not my boyfriend or my Thermos... ...or anything, but... - You won't lose him. - You gotta talk to Joey. Yeah, okay. Come on. He doesn't know this stuff. If he knew how you felt... He's falling in love with her. Oh, please. They've been going out a week. They haven't even slept together yet. I mean, that's not serious. Okay. Oh. Okay. Oh. Oh. Yeah, um, may we help you?",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00022",
    "start_chunk": "00:20:58.840",
    "end_chunk": "00:21:52.727"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nAn apartment hallway at night, illuminated by interior lights and string lights on the exterior wall. The scene transitions to an apartment interior where a man is seated in a chair reading a newspaper.\n\n### **CHARACTERS PRESENT:**\nUnidentified person: dark-colored top - unclear lower clothing - blonde, long hair - expression unclear\nUnidentified person: dark-colored top - unclear lower clothing - blonde, long hair - expression unclear\n\n### **ACTIONS AND INTERACTIONS:**\nTwo women stand facing each other in a hallway, engaged in conversation. One woman, wearing a plaid shirt, has her arms crossed and appears to be speaking. The other woman, in a patterned top, gestures with her hands while talking. The scene cuts to an exterior view where one woman is hanging Christmas lights on a pole, while another woman watches from a window. The scene then cuts to an interior view where a man is seated in a chair reading a newspaper, looking up as someone approaches the window.\n\n### **OBJECTS AND PROPS:**\nString lights: multicolored (on exterior wall)\nLadder: metal (near pole)\nNewspaper: dark-colored (in man's hands)\nChair: brown (man is seated in it)\nWindow: glass (with black frame)\nBox: cardboard (on ground near pole)\n\n### **DIALOGUE CONTEXT:**\nThe conversation involves one woman asking the other to come inside because it's freezing, while the other woman insists she is okay and wants to take down the lights. The tone is casual and slightly tense, with the woman in the plaid shirt appearing concerned and the other woman appearing determined. The man in the chair is not involved in the conversation.\n\n### **TEMPORAL NOTES:**\nThe scene transitions from the hallway to the exterior view, then to the interior view. The woman hanging lights moves from standing to climbing the ladder. The man in the chair looks up as someone approaches the window.",
    "subtitles": "Rachel, what are you doing? It's freezing. Would you come inside? No, no, no. You wanted me to take them down... ...so I'm taking them down, okay? [RACHEL YELLS] Rachel! I'm okay. I'm okay. Mr. Heckles? Mr. Heckles, could you help me, please? See, this is just the kind of thing I was talking about.",
    "episode": "1x16 - The One with Two Parts (1)",
    "chunk": "chunk_00023",
    "start_chunk": "00:22:07.451",
    "end_chunk": "00:22:35.978"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes take place in Monica's apartment living room and a hallway transitioning to an exterior view, all during the evening/night.\n\n**KEY CHARACTERS**\n*   **Phoebe Buffay:** Animated and expressive, involved in discussions.\n*   **Rachel Green:** Concerned, acting as a listener and mediator.\n*   **Ross Geller:** Concerned, observing.\n*   **Monica Geller:** Initially listening, then upset and exiting a conversation.\n*   **Chandler Bing:** Concerned observer.\n*   **Joey Tribbiani:** Present but seemingly relaxed and uninvolved in the main conflict.\n*   **Unidentified Women:** Engaged in a conversation about lights and temperature.\n*   **Unidentified Man:** Reading a newspaper and observing.\n\n**MERGED NARRATIVE SUMMARY**\nIn Monica's apartment, a group consisting of Phoebe, Rachel, Ross, Monica, and Chandler are gathered. Phoebe is animatedly speaking, while Rachel and Ross appear concerned, listening. Rachel is discussing Joey's romantic feelings for another woman with Monica, who reacts with visible upset and leaves the room. Phoebe enters from the hallway and encounters Monica, setting up a potential confrontation. The scene then shifts to a hallway where two women are talking, one of whom is hanging multicolored Christmas lights outside in the cold. The woman hanging lights is determined, while the other woman is concerned about her being out in the freezing weather. A man is seen indoors reading a newspaper, looking up as someone approaches his window.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** A tension arises around Joey's feelings for another woman, causing distress to Monica. A separate interaction highlights concern for someone's well-being in cold weather.\n*   **Emotional Tone:** The initial scene is tense and concerned, shifting to a more casual but slightly tense interaction in the hallway and exterior.\n*   **Plot Setup:** The conversation about Joey's feelings is introduced, and Monica's reaction suggests potential future plot points. The lights conversation sets up a scenario of someone prioritizing a task over their comfort.\n*   **Notable Transitions:** The narrative transitions from the group discussion in Monica's apartment to a hallway confrontation between Phoebe and Monica, and then to an entirely different scenario with two women and a man outdoors and indoors, respectively."
}