{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen and living room — evening, warm indoor lighting with visible kitchen appliances and decor.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated\nRoss Geller: dark jacket - dark shirt - short, dark hair - serious\nRachel Green: dark-colored top - dark pants - blonde, shoulder-length hair - concerned\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smiling\nPhoebe Buffay: dark top - dark pants - blonde, shoulder-length hair - smiling\nJoey Tribbiani: dark jacket - white shirt - short, brown hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Ross are in the kitchen, with Monica gesturing while speaking to Ross, who holds a cereal box. Rachel, Chandler, and Phoebe are seated on the couch, listening to the conversation. Joey enters from the kitchen area and sits at the table. Monica and Ross continue their discussion, with Monica appearing animated and Ross looking serious.\n\n### **OBJECTS AND PROPS:**\n- Cereal box: yellow and blue (on table)\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Brick wall decor (background)\n- Kitchen appliances: microwave, refrigerator, pots and pans\n\n### **DIALOGUE CONTEXT:**\nMonica discusses her frustration with Ross about waiting for an onion tartlet, while Ross appears to be explaining his side. The conversation has a tense tone, with Monica appearing animated and Ross looking serious. Rachel, Chandler, and Phoebe are listening, with Rachel appearing concerned and Chandler smiling.\n\n### **TEMPORAL NOTES:**\nJoey enters frame from the kitchen area and sits at the table. Monica and Ross continue their conversation, with Monica gesturing expressively. Chandler leans back in his chair, smiling at the conversation.",
    "subtitles": "- No. Give me the bears. - Well, then you can't have any. - Give them to me. - This is not worth it. Oh, oh! Bears overboard. They're drowning. Hey, fellas. Grab onto a Sugar-O. Save yourselves. Help! Help! I'm drowning. Help! Help! That's it, okay? Dinner is over. - What? - \"What\"? - Why? MONICA: \"Why\"? I've waited seven years for an opportunity like this... ...and you can't even wait four and a half minutes for a stupid onion tartlet? [OVEN TIMER DINGS] Hey... What a tool. You don't want to work for a guy like that. I know. It's just... I don't know, I just thought that this was, you know, \"it.\" Look, you'll get there. You're an amazing chef. Yeah, you know all those yummy noises? I wasn't faking. [CLEARS THROAT]",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00021",
    "start_chunk": "00:19:59.031",
    "end_chunk": "00:20:58.547"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with neon signs visible\n\n### **CHARACTERS PRESENT:**\nRoss Geller: grey hoodie with Nike logo - dark pants - short, dark hair - animated expression\nChandler Bing: dark-colored sweater - dark pants - short, dark hair - smiling expression\nMonica Geller: grey blazer over white shirt - dark pants - dark, shoulder-length hair - concerned expression\nRachel Green: dark top - dark pants - long, brown hair - relaxed expression\nPhoebe Buffay: dark top - dark pants - blonde, shoulder-length hair - smiling expression\nJoey Tribbiani: dark shirt - dark pants - short, dark hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Chandler are standing at the counter, engaged in conversation while Ross prepares a drink. Monica and Rachel are seated on the couch, with Monica looking concerned and Rachel smiling. Phoebe is seated nearby, smiling. Joey is seated at a table, looking at his phone. Ross gestures animatedly while talking to Chandler, who listens and responds with a smile. Monica stands up and walks toward the couch, placing a hand on Rachel's shoulder.\n\n### **OBJECTS AND PROPS:**\nCoffee mugs: various colors (on tables)\nOrange couch (center of frame)\nBar counter with coffee-making equipment\nNeon signs: \"SERVICE\" and coffee cup design (visible in background)\nFloral arrangements (on tables and counter)\nMenu board (behind counter)\nCoffee beans and jars (on shelves behind counter)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses his recent encounter with Celia, describing it as elaborate and involving plot lines and characters, while Chandler listens and reacts with amusement. The conversation has a casual, joking tone, with Ross appearing animated and Chandler smiling. Monica and Rachel react with concern and amusement, respectively, as Ross recounts his experience.\n\n### **TEMPORAL NOTES:**\nMonica stands up and walks toward the couch\nRoss prepares a drink at the counter\nChandler leans in to listen to Ross\nJoey sits at a table, looking at his phone",
    "subtitles": "So, uh, how did it go with Celia? Oh, uh, I was unbelievable. All right, Ross. I was the James Michener of dirty talk. It was the most elaborate filth you have ever heard. I mean, there were characters, plot lines... ...themes, a motif. At one point, there were villagers. Oh, and, uh... Well, um, you know, by the time we finished with all the dirty talk... ...it was kind of late and we were both exhausted, so... - You cuddled. - Yeah, which was nice. Do you guys want to try to catch a late movie or something? Maybe, but shouldn't we wait for Chandler? Whoa. Where the hell is he? Yes, Fran, I know what time it is... ...but I'm looking at the WENUS and I'm not happy. Oh, really? Well, let me tell you something. You will care about it because I care about it. Got it? Good!",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00022",
    "start_chunk": "00:21:02.052",
    "end_chunk": "00:21:59.608"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nAn office space — daytime, artificial lighting from a desk lamp and overhead lights.\n\n### **CHARACTERS PRESENT:**\nChandler Bing: light-colored shirt - dark pants - brown, medium-length hair - expression shifts from focused to annoyed as he sits down.\n\n### **ACTIONS AND INTERACTIONS:**\nChandler Bing is initially standing, holding papers and talking on a landline phone, then sits down at his desk. The scene cuts to a massage room where Phoebe Buffay is giving a massage to a man lying face-down on a massage table. Phoebe is smiling and laughing as she works, while the man appears relaxed. The video then transitions to end credits.\n\n### **OBJECTS AND PROPS:**\n- Landline phone (held by Chandler)\n- Desk with binders and a mug\n- Massage table (blue sheet)\n- Patterned curtain (behind massage table)\n- Green lamp (on desk)\n- Artwork (abstract painting on wall)\n\n### **DIALOGUE CONTEXT:**\nThe subtitles indicate a conversation about the massage, with Phoebe laughing and the person receiving the massage reacting with surprise and discomfort. The tone is lighthearted and humorous, with Phoebe appearing amused and the recipient reacting with exaggerated expressions.\n\n### **TEMPORAL NOTES:**\nChandler Bing sits down at his desk after finishing his phone call.\nScene cuts to a massage room with Phoebe Buffay giving a massage.\nThe video transitions to end credits.",
    "subtitles": "Whoa. - How's this? - Eek! - Sorry. How about over here? - Oh! See, now, that just means it's working. - Does this hurt? - No. - How about this? - Aah! There you go. [CONTINUES YELLING] Oh, I'm gonna throw up. [CONTINUES YELLING]",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00023",
    "start_chunk": "00:22:02.612",
    "end_chunk": "00:22:38.272"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in Monica's apartment kitchen and living room during the evening. The scene then transitions to the Central Perk coffee shop, also in the evening. Finally, the scene shifts to an office space during the daytime.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Appears frustrated and concerned, particularly in relation to Ross.\n*   **Ross Geller:** Seems serious, then animated as he recounts an experience.\n*   **Rachel Green:** Shows concern and amusement.\n*   **Chandler Bing:** Appears amused and relaxed, later annoyed in an office setting.\n*   **Phoebe Buffay:** Is smiling and amused, later laughing during a massage.\n*   **Joey Tribbiani:** Is relaxed and occupied with his phone.\n*   **Unidentified man:** Receives a massage from Phoebe.\n\n**MERGED NARRATIVE SUMMARY**\nIn Monica's apartment, a tense discussion is unfolding between Monica and Ross regarding an onion tartlet, with the other friends (Rachel, Chandler, Phoebe, and Joey) observing. Joey enters and joins the group. Later, at Central Perk, Ross animatedly recounts an elaborate encounter with someone named Celia to Chandler, who is amused. Monica and Rachel are also present, reacting with concern and amusement to Ross's story. The scene then cuts to Chandler in an office, looking annoyed after finishing a phone call. Finally, Phoebe is shown giving a humorous massage to a client, who reacts with surprise and discomfort, before the video transitions to end credits.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Interpersonal Dynamics:** Initial tension between Monica and Ross contrasts with the lighthearted recounting of Ross's \"elaborate\" encounter with Celia.\n*   **Emotional Tone:** The overall tone shifts from domestic tension to amusement and humor, ending with a brief moment of annoyance for Chandler and lighthearted comedy from Phoebe's massage.\n*   **Character Activities:** The characters engage in conversations and share experiences, with individual scenes focusing on Chandler's work and Phoebe's unconventional profession.\n*   **Scene Transitions:** The narrative progresses from a home environment to a social gathering at a coffee shop, and then to separate, distinct work/activity-focused settings."
}