{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with decorative lamps and bar area visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored cardigan - patterned skirt - dark, shoulder-length hair tied up - expression: focused, slightly concerned\nMonica Geller: dark-colored top - dark pants - dark, wavy hair - expression: animated, engaged in conversation\nJoey Tribbiani: dark-colored shirt - dark pants - dark, medium-length hair - expression: relaxed, smiling\nChandler Bing: light-colored shirt - dark pants - brown, medium-length hair - expression: amused, smirking\nPhoebe Buffay: light-colored top - dark pants - blonde, shoulder-length hair - expression: animated, laughing\nRoss Geller: dark-colored shirt - dark pants - brown, short hair - expression: serious, listening\n\n### **ACTIONS AND INTERACTIONS:**\nRachel walks through the coffee shop carrying a tray with coffee mugs, interacting with customers and staff. Monica sits on the orange couch, holding a yellow mug and listening to Rachel. Joey sits at a table, smiling and looking at Monica. Chandler leans back in his chair, smirking at the conversation. Phoebe stands near the counter, laughing and gesturing. Ross stands near the bar, listening to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tray and table)\n- Orange couch (center of frame)\n- Wooden table (with mugs and plates)\n- Bar stools (near counter)\n- Decorative lamps (on tables)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses coffee orders with the barista. The conversation has a casual tone, with Rachel appearing focused and Monica animated. Joey and Chandler react with amusement, while Ross listens seriously.\n\n### **TEMPORAL NOTES:**\nRachel walks from the counter to the couch area.\nMonica sits down on the couch.\nJoey sets down his mug on the table.\nPhoebe moves from the counter to stand near the couch.",
    "subtitles": "Coffee. - Thank you. - Cappuccino. [SPEAKING IN ITALIAN] And a nice hot cider for Monica. Aw, thank you. - Rach? - Yeah? Why does my cinnamon stick have an eraser? Oh. Oh, heh. That's why. Sorry.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:03.795",
    "end_chunk": "00:00:25.983"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm interior lighting with neon signs visible.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - long, wavy brown hair - smiling\nChandler Bing: light-colored shirt - dark vest - short, brown hair - animated expression\nRoss Geller: dark shirt - dark pants - short, dark hair - serious expression\nJoey Tribbiani: light-colored shirt - dark pants - short, dark hair - smiling\nPhoebe Buffay: dark top - dark pants - long, curly blonde hair - smiling\nMonica Geller: dark top - dark pants - dark, shoulder-length hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands near the couch, gesturing and speaking animatedly to the group. Chandler sits on the couch, smiling and listening. Ross sits nearby, looking at Rachel with a serious expression. Joey stands near the bar, smiling and looking at Rachel. Phoebe sits on the couch, smiling and listening. Monica sits on the couch, smiling and listening. The group appears engaged in a lively conversation.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (center of frame)\n- Bar stools (near counter)\n- Neon signs (on walls)\n- Menu board (behind counter)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses something with the group. The conversation has a casual tone, with Rachel appearing animated and the others reacting by smiling and listening.\n\n### **TEMPORAL NOTES:**\nNone observed.",
    "subtitles": "TEDLOCK: Chandler? Miss Tedlock, you're looking lovely today. May I say that is a very flattering sleeve length on you? Yes. Well, Mr. Costilick would like you to stop by his office at the end of the day. Oh, listen, if this is about those prank memos, I had nothing to do with them. Really, nothing at all. Really. Nothing. Hey, you guys. You guys. Chandler's coming, and he says he has this incredible news. So when he gets here, let's all act like, you know... - Hey. GROUP: Hey.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:24.834",
    "end_chunk": "00:02:00.244"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with neon signs and candlelight.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored cardigan over a top - dark pants - long, wavy blonde hair - animated, smiling\nMonica Geller: dark-colored top - jeans - dark, shoulder-length hair - concerned, then smiling\nChandler Bing: dark-colored shirt under a grey jacket - dark pants - short, dark hair - serious, then smiling\nRoss Geller: blue sweater - dark pants - short, dark hair - animated, gesturing\nPhoebe Buffay: dark top - dark pants - long, dark hair - concerned, then smiling\nJoey Tribbiani: dark jacket - dark pants - short, dark hair - relaxed, smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green stands and gestures while speaking, then sits on the couch. Monica Geller sits beside her, listening and reacting. Chandler Bing stands near the couch, speaking and gesturing. Ross Geller sits at a table, gesturing as he speaks. Phoebe Buffay sits on the couch, listening. Joey Tribbiani sits at a table, smiling.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tables)\n- Orange couch (center of frame)\n- Wooden tables (with mugs and books)\n- Bar stools (at counter)\n- Neon signs (on wall)\n- Flower arrangement (on table)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses her job promotion and decision to quit with the group. The conversation has a casual tone, with Rachel appearing excited and Monica concerned. Chandler Bing listens and responds with a serious expression, while Ross Geller gestures animatedly. The group reacts with surprise and concern.\n\n### **TEMPORAL NOTES:**\nRachel Green stands up and walks to the couch.\nChandler Bing stands up and walks toward the couch.\nRoss Geller gestures with his hands while speaking.\nMonica Geller smiles and nods while listening.",
    "subtitles": "- Hey. GROUP: Hey. Never mind. But it was gonna be really good. ROSS: What's going on? RACHEL: What's up? It's a typical day at work. I'm inputting my numbers... ...and Big Al calls me into his office... ...and tells me he wants to make me processing supervisor. - That is great! - Congratulations. So I quit. BOTH: Why? Why? This was supposed to be a temp job. Yeah, Chandler, you've been there for five years. I know, but if I took it this... ...it'd be like admitting that this is what I actually do. So was it a lot more money? Doesn't matter. I just don't want to be one of those guys... ...that's in his office until 12:00 at night worrying about the WENUS. \"The WENUS\"? Weekly estimated net usage system. It's a processing term. Oh, that WENUS. So, what are you gonna do? I don't know. That's the thing. I don't know. I'm not gonna figure it out working there. Oh! I have something you can do. I have this new massage client. Steve.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:58.701",
    "end_chunk": "00:03:01.513"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — evening, warm ambient lighting with neon signs visible\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated, smiling\nPhoebe Buffay: patterned jacket over dark top - long, wavy blonde hair - expressive, talking animatedly\nChandler Bing: dark-colored shirt under grey tweed jacket - dark hair - serious, listening\n\n### **ACTIONS AND INTERACTIONS:**\nMonica and Phoebe sit on the orange couch, engaged in an animated conversation, with Phoebe gesturing with her hands while speaking. Chandler sits in a green armchair nearby, listening intently with his hands clasped. The scene shifts to a wider view showing the coffee shop's interior with other patrons and furniture.\n\n### **OBJECTS AND PROPS:**\n- Orange couch (center)\n- Green armchair (where Chandler sits)\n- Wooden tables with mugs and books\n- Brick wall decor (background)\n- Neon signs (visible in background)\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses a potential job opportunity for Chandler as a chef with Monica. The conversation has a casual, friendly tone, with Phoebe appearing enthusiastic and Monica reacting with amusement and engagement.\n\n### **TEMPORAL NOTES:**\nScene begins with Chandler standing, then transitions to him sitting in the armchair. The camera shifts to show Monica and Phoebe on the couch, then to a wider shot of the coffee shop.",
    "subtitles": "I have this new massage client. Steve. Anyway, um, he's opening up a restaurant... ...and he's looking for a head chef. Um, hi there. Hi. Oh, yeah, I know. You're a chef, I know, and I thought of you first. But, um, Chandler's the one who needs a job right now, so... Yeah, I just don't have a lot of chefing experience. Unless it's an all-toast restaurant. - Yeah. Yeah. - Well, what kind of food is he looking for? He wants to do something eclectic, so he's looking for someone... ...who can, you know, create the entire menu. - Oh, my God. - Yeah, I know. So, what do you think? Thanks, Pheeb. I just don't really see myself in a big white hat. Okay. Oh, Monica. Guess what?",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00004",
    "start_chunk": "00:02:59.262",
    "end_chunk": "00:03:51.313"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nThe Friends apartment living room — daytime, natural light from large windows — featuring a patterned couch, wooden dining table, and blue kitchen cabinets in the background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored dress over a brown top - long, light brown hair - expression shifts from concerned to animated\nChandler Bing: dark suit jacket over a white shirt with a striped tie - dark pants - short, dark hair - expression animated, gesturing\nRoss Geller: dark red sweater - light-colored pants - short, dark hair - expression concerned, then smiling\nPhoebe Buffay: dark patterned top - long, blonde hair - expression smiling, then animated\nJoey Tribbiani: dark shirt - short, dark hair - expression relaxed, smiling\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - expression serious, then animated\n\n### **ACTIONS AND INTERACTIONS:**\nChandler stands in the kitchen area, gesturing animatedly while speaking to the group. Rachel stands near the table holding a mug, listening and reacting. Ross and Phoebe sit on the couch, watching the conversation. Monica enters from the kitchen holding a water bottle and speaks to Rachel. Joey is seated at the table, smiling and listening.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Blue bowl: on table\n- Water bottle: clear plastic (held by Monica)\n- Wooden dining table (center foreground)\n- Patterned couch (center background)\n- Blue kitchen cabinets (background)\n- Yellow kettle: on stove\n\n### **DIALOGUE CONTEXT:**\nChandler discusses his career counseling appointment with the group, expressing uncertainty about his future. Rachel and Monica react with concern and amusement. The conversation has a casual, slightly humorous tone, with Chandler appearing earnest and Rachel animatedly responding. Ross and Phoebe listen with expressions of concern and amusement.\n\n### **TEMPORAL NOTES:**\nMonica enters the frame from the kitchen area\nChandler moves from the kitchen to the living room area\nRachel moves from standing near the couch to standing near the table\nPhoebe gestures with her hands while speaking to Rachel\nJoey remains seated at the table throughout the clip",
    "subtitles": "Can you see my nipples through this shirt? No, but don't worry. I'm sure they're still there. Where you going, Mr. Suit-ey Man? Well, I have an appointment to see Dr. Robert Pilman... ...career counselor-a-go-go. I added the \"a-go-go.\" Career counselor? Hey, you guys all know what you want to do. I don't. Hey, you guys in the living room all know what you want to do. You know, you have goals. You have dreams. I don't have a dream. Ah, the lesser known \"I Don't Have a Dream\" speech. Oh, I love my life. I love my life. Brian's Song. The meeting with that guy went great? So great. He showed me where the restaurant's gonna be. It's this cute little place on 10th Street. It's not too big, not too small. It's just right. Was it formerly owned by a blond woman and some bears?",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00005",
    "start_chunk": "00:04:01.741",
    "end_chunk": "00:05:01.383"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes primarily take place in the Central Perk coffee shop with a shift to the Friends apartment living room. The time of day varies from evening to daytime.\n\n**KEY CHARACTERS**\nThe main characters are Rachel, Monica, Joey, Chandler, Phoebe, and Ross, who are all friends engaged in various conversations and discussions. Their emotional states range from concerned and serious to animated and amused.\n\n**MERGED NARRATIVE SUMMARY**\nThe group of friends gathers at Central Perk for a series of conversations. Initially, Rachel is seen working and interacting with the group, who are engaged in casual conversation and showing amusement. Later, Rachel discusses a significant career decision with the group, specifically her job promotion and her decision to quit, which elicits surprise and concern. Meanwhile, Phoebe suggests a job opportunity for Chandler as a chef, which sparks amusement among the friends. The setting then shifts to the Friends apartment, where Chandler discusses his career counseling appointment and his uncertainty about his future, eliciting concern and humorous reactions from the group.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** The core of the interactions is the friends supporting each other through career decisions and personal uncertainties.\n*   **Emotional Tone:** The conversations flow from casual and humorous to more serious and concerned, reflecting the friends' deep engagement with each other's lives.\n*   **Plot Setup:** Rachel's decision to quit her job and the discussion about Chandler's career counseling set up future plot points regarding their professional lives.\n*   **Notable Transitions:** The primary transition is from the familiar setting of Central Perk to the more intimate setting of the Friends apartment, indicating a shift in the depth or focus of the conversation."
}