{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, natural light from large windows\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - dark pants - dark, short hair - serious expression\nChandler Bing: black turtleneck - dark pants - dark, styled hair - animated, gesturing\nJoey Tribbiani: red sweater - light-colored pants - dark, short hair - relaxed, arms crossed\nRachel Green: brown top - dark pants - brown, shoulder-length hair - listening, smiling\nPhoebe Buffay: patterned top - dark pants - blonde, long hair - animated, gesturing\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - focused, listening\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe stands near the kitchen counter, gesturing animatedly while speaking to Monica and Rachel, who are seated at the table. Ross and Chandler sit on the couch, with Ross listening intently and Chandler gesturing as he speaks. Monica sits at the table, holding a water bottle and listening to the conversation. Joey stands near the doorway, observing the group.\n\n### **OBJECTS AND PROPS:**\n- Blue bowl: on table\n- Water bottle: held by Monica\n- Coffee mugs: on table\n- Refrigerator: white, with magnets, in kitchen area\n- Kitchen shelves: blue, with various items\n- Couch: patterned, with pillows\n- Lamp: on side table, near couch\n\n### **DIALOGUE CONTEXT:**\nPhoebe discusses a dinner plan with Monica and Rachel, mentioning a date with a man who wants her to be present. The conversation has a casual, joking tone, with Phoebe appearing enthusiastic and Monica listening attentively. Ross and Chandler react with expressions of concern and amusement.\n\n### **TEMPORAL NOTES:**\nPhoebe moves from standing near the couch to standing near the kitchen counter\nMonica shifts her position slightly while seated at the table\nRoss leans forward slightly while listening to the conversation\nChandler gestures with his hands while speaking",
    "subtitles": "Was it formerly owned by a blond woman and some bears? So anyway, I'm cooking dinner for him Monday night. Kind of like an audition. And Phoebe, he really wants you to be here, which will be great for me. Because you can make yummy noises. - What are you gonna make? - Yummy noises. And, Monica, what are you gonna make? I don't know. I don't know. It's just gotta be so great. Oh! I know what you can make. I know. Oh, you should make that thing, you know, with the stuff. You know that thing with the stuff? Okay, I don't know. Hey, guys, anyone know a good date place in the neighborhood? Uh, how about Tony's? If you can finish a 32-ounce steak, it's free. Okay. Ahem. Hey, does anyone know a good place if you're not dating a puma? - Who are you going out with? - Oh, is this the bug lady? [AS BUG LADY] I love you, Ross. Her name is Celia. She's not a bug lady.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:58.298",
    "end_chunk": "00:06:01.526"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with natural light visible through large windows.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored sweater - unclear lower clothing - dark, short hair - concerned expression\nRachel Green: dark-colored top - unclear lower clothing - brown, shoulder-length hair - serious expression\nPhoebe Buffay: dark vest over light shirt - unclear lower clothing - dark, curly hair - animated expression\nChandler Bing: dark suit jacket over light shirt - striped tie - dark, styled hair - smiling expression\nJoey Tribbiani: dark-colored top - unclear lower clothing - dark, styled hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on the couch, talking animatedly while gesturing with his hands. Chandler enters the room, smiling, and approaches the group. Phoebe, holding a small dog, moves around the room, interacting with Ross and Chandler. Rachel sits at the table, looking at papers. Joey enters from the kitchen area and joins the group. Ross and Chandler sit on the couch, continuing their conversation while interacting with the dog.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Wooden table (center of frame)\n- Red and white checkered blanket (on couch)\n- Lamp (on side table)\n- Bookshelf (with books and decor)\n- Dog (small, black and white)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses bringing a woman named Celia to his place to meet his monkey with Chandler. The conversation has a joking tone, with Ross appearing concerned and Chandler smiling. Phoebe reacts by holding the dog and laughing, while Rachel listens attentively.\n\n### **TEMPORAL NOTES:**\nChandler enters the room from the right side.\nPhoebe moves around the room holding the dog.\nRoss and Chandler sit on the couch and continue their conversation.",
    "subtitles": "Her name is Celia. She's not a bug lady. She's curator of insects at the museum. So, what are you guys gonna do? Well, I just thought we'd go to dinner, then bring her back to my place... ...and I'd introduce her to my monkey. And he's not speaking metaphorically. - So back to your place? - Uh-huh. You thinking maybe, heh-heh? Ahem, well, I don't know, heh-heh. I'm hoping heh-heh. I'm telling you, that monkey's a chick magnet. She's gonna one look at his furry, cute little face and it'll seal the deal. - Aah! ROSS: Celia, don't worry. Celia, he's not gonna hurt you. Soothing tones, Celia, soothing tones. - Okay, I'm sorry, I'm sorry. - Aah! - Here, here. Marcel? Marcel? - I can't stand this. - He's got his claws on my... - Yeah, all right.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:59.609",
    "end_chunk": "00:06:57.374"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored top - apron - dark, shoulder-length hair - animated\nRoss Geller: dark-colored sweater - dark pants - dark, short hair - concerned\nRachel Green: dark top - jeans - brown, shoulder-length hair - serious\nChandler Bing: light-colored shirt - dark pants - brown, medium-length hair - serious\nPhoebe Buffay: dark top - jeans - dark, shoulder-length hair - concerned\nJoey Tribbiani: white shirt - dark pants - brown, medium-length hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands in the kitchen area, holding a wooden spoon and talking to Ross, who is seated at the table. Rachel sits across from Ross, looking at an open book. Chandler enters from the doorway holding a stack of papers, walks toward the group, and stands near the table. Joey enters from the doorway, holding a stack of papers, and stands near the table. Ross looks up at Monica as she speaks, then looks at Chandler as he enters. Rachel gestures with her hands while speaking to Chandler. Monica gestures with the spoon while talking to Ross. Chandler looks down at the papers he is holding. Joey looks at the group as he stands near the table.\n\n### **OBJECTS AND PROPS:**\n- Wooden table (center of frame)\n- White refrigerator (with magnets and photos)\n- Blue kitchen cabinets (background)\n- Lamp (on side table)\n- Book (open on table)\n- Wooden spoon (held by Monica)\n- Stack of papers (held by Chandler and Joey)\n- Flower arrangement (in vase on counter)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a salmon mousse recipe with Ross, who is skeptical about the dish. Chandler and Joey enter the room holding stacks of papers, and Rachel begins talking to Chandler about something. The conversation has a casual tone, with Monica appearing animated and Ross looking concerned. Chandler and Joey appear serious as they listen to the conversation.\n\n### **TEMPORAL NOTES:**\nChandler enters from the doorway and walks toward the table\nJoey enters from the doorway holding papers and stands near the table\nRoss looks up from the table to Monica as she speaks\nRachel gestures with her hands while speaking to Chandler\nMonica gestures with the wooden spoon while talking to Ross",
    "subtitles": "Okay, try this salmon mousse. - Mm. Good. MONICA: Yeah? Is it better than the other salmon mousse? It's creamier. Yeah? Well, is that better? I don't know. We're talking about whipped fish, Monica. I'm just happy I'm keeping it down, you know? God, what happened to you? Eight and a half hours of aptitude tests... ...intelligence tests, personality tests, and what do I learn? \"You're ideally suited for a career in data processing... ...for a large multi-national corporation.\" That's so great, because you already know how to do that. Can you believe it? Don't I seem like somebody who should be doing something really cool? You know, I just always pictured myself doing something...",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00008",
    "start_chunk": "00:07:05.049",
    "end_chunk": "00:08:00.479"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - unclear lower clothing - medium-length brown hair - expression shifts from concerned to amused\nMonica Geller: dark-colored shirt with white apron - unclear lower clothing - dark, shoulder-length hair - expression animated, then focused on phone call\nChandler Bing: white shirt with loosened tie - unclear lower clothing - dark, medium-length hair - expression initially serious, then confused, then annoyed\nJoey Tribbiani: dark-colored sweater - unclear lower clothing - long, wavy blonde hair - expression concerned, then speaking\nRoss Geller: dark-colored shirt - unclear lower clothing - short, dark hair - expression serious, looking down\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands near Chandler, adjusting his shirt and then offering him a small food item. Monica enters with a plate of food, hands it to Chandler, and then walks to the kitchen counter to answer the phone. Joey sits at the table, looking up as Monica talks on the phone. Ross sits at the table, holding a water bottle and looking at Monica. Chandler stands near the counter, looking at the food and then at Monica as she talks on the phone.\n\n### **OBJECTS AND PROPS:**\n- Plate of food: with small bites (held by Monica)\n- Phone: white corded phone (held by Monica)\n- Refrigerator: white, with magnets and photos (visible behind Ross)\n- Kitchen counter: blue shelves with various items (visible behind Monica)\n- Wooden table: with chairs (where Ross and Joey sit)\n- Lamp: warm lighting (visible in background)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses a job offer with a waitress named Wendy, mentioning a rate of ten dollars an hour. The conversation has a casual, slightly humorous tone, with Monica appearing focused and slightly amused while talking on the phone. Rachel reacts by looking at Chandler with concern, and Chandler appears confused and annoyed by the situation.\n\n### **TEMPORAL NOTES:**\nMonica moves from standing near Chandler to the kitchen counter to answer the phone.\nRachel moves from adjusting Chandler’s shirt to standing near the counter.\nChandler moves from standing near Rachel to standing near the counter, looking at the food.\nRoss moves from sitting at the table to standing near the refrigerator.\nJoey moves from sitting at the table to looking up at Monica.",
    "subtitles": "You know, I just always pictured myself doing something... Something. Oh, Chandler, I know, I know. Oh, hey, you can see your nipples through this shirt. [INAUDIBLE DIALOGUE] Here you go. Maybe this will cheer you up. Ooh, you know, um, I had a grape about five hours ago... ...so I better split this with you. It's supposed to be that small. It's a pre-appetizer. The French call it an amuse-bouche. Well, it is amusing. [PHONE RINGS] Hello? Oh, hi, Wendy. Yeah, 8:00. What did we say? Ten dollars an hour? Okay, great. All right, I'll see you then. Bye. Ten dollars an hour for what? I asked a waitress at work to help me out. Waitressing? Uh-oh.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:56.642",
    "end_chunk": "00:09:00.288"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - brown, shoulder-length hair - expression: concerned, then thoughtful\nMonica Geller: dark-colored shirt - white apron - dark, shoulder-length hair - expression: animated, smiling while talking\nRoss Geller: light-colored shirt - dark pants - dark, short hair - expression: serious, then concerned\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, wearing an apron, talks animatedly to Rachel while holding a water bottle, gesturing with her hands. Rachel listens, holding the bottle and looking at Monica, her expression shifting from thoughtful to concerned. Ross enters the scene holding a plate of food, looks at the two women, and then exits the frame. The scene cuts to a nighttime exterior shot of a building, then to Ross and a woman kissing intimately in a dimly lit room.\n\n### **OBJECTS AND PROPS:**\n- Water bottle: clear plastic (held by Rachel)\n- Refrigerator: white, with magnets and photos (behind Monica)\n- Lamp: lit, with a beige shade (on side table)\n- Plate: holding food (held by Ross)\n- Couch: patterned, with red and white pillows (in background)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses her amateur waitress status with Rachel, mentioning her experience waiting tables at Innsbruck in '76. The conversation has a casual, slightly humorous tone, with Monica appearing animated and Rachel reacting with concern. Ross overhears the conversation and appears serious.\n\n### **TEMPORAL NOTES:**\nRoss enters the frame holding a plate of food.\nRoss exits the frame after looking at Monica and Rachel.\nScene cuts to exterior nighttime shot.\nScene cuts to Ross and a woman kissing in a different room.",
    "subtitles": "Uh-oh. Ha, ha. Of course I thought of you. But... - But... - But, but? But, you see, it's just this night has to go just perfect, you know... ...and, well, Wendy's more of a professional waitress. Oh. I see. Yes. And I've sort of been maintaining my amateur status... ...so that I can waitress in the Olympics. You know, I don't mean to brag, but I waited tables at Innsbruck in '76. Amuse-bouche? Talk to me.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00010",
    "start_chunk": "00:08:58.871",
    "end_chunk": "00:09:59.556"
  },
  "summary": "**SCENE OVERVIEW**\nThe events unfold in Monica's apartment, primarily the living room and kitchen area. The setting shifts from daytime to evening with artificial lighting. The final moments briefly transition to an exterior nighttime shot and then a dimly lit room.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Host, involved in planning and phone calls. Initially focused, later animated and discussing her past waitressing experience.\n*   **Ross Geller:** Engaged in conversations with Chandler, later listening to Monica, and finally seen kissing an unidentified woman. Appears concerned and serious at times.\n*   **Chandler Bing:** Engaged in conversations with Ross, later involved in a situation with Rachel and food, and appearing confused and annoyed.\n*   **Rachel Green:** Interacts with Chandler and Monica, showing concern and thoughtfulness.\n*   **Joey Tribbiani:** Observes the group and later holds papers, appearing serious.\n*   **Phoebe Buffay:** Involved in early conversations about dinner plans and interacts with a dog.\n\n**MERGED NARRATIVE SUMMARY**\nThe group gathers in Monica's apartment, initially discussing dinner plans and a date. As the day transitions to evening, conversations shift to more personal matters. Ross and Chandler discuss bringing a woman to meet his monkey, while Phoebe interacts with a dog. Monica is seen discussing a salmon mousse recipe with Ross, who is skeptical, and later enters into a phone call about a potential job offer as a waitress, mentioning a low hourly rate. Rachel attempts to comfort Chandler during this interaction. Towards the end, Monica animatedly discusses her past waitressing experiences with Rachel. Ross briefly enters and exits, and the scene concludes with him kissing an unidentified woman in a different, dimly lit room.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Friendship Dynamics:** The interactions highlight the casual, supportive, and sometimes humorous relationships between the friends as they share conversations and react to each other's situations.\n*   **Monica's Job Search/Past:** Monica's phone call about a waitressing job offer at a low rate, and her later discussion with Rachel about her past waitressing experience, suggest a storyline related to her career or financial situation.\n*   **Ross's Romantic Entanglements:** Ross's early conversation with Chandler about a date and his final scene kissing another woman introduce potential romantic subplots.\n*   **Everyday Life and Humor:** The narrative weaves together everyday conversations about food, dating, and jobs with the characteristic humor of the group.\n*   **Transition to Evening:** The change in lighting and the progression of conversations mark a clear shift from daytime to evening activities within the apartment."
}