{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nAn office with a large window overlooking a city skyline — daytime, bright natural light from the window.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark suit - light-colored shirt with patterned tie - dark, short hair - smiling and animated\nRachel Green: dark-colored cardigan over dark top - reddish-brown skirt - long, wavy blonde hair - smiling and engaged\nUnidentified person: dark suit - light shirt - dark hair - serious expression (appears to be a secretary or receptionist)\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Rachel enter the office and walk toward the desk, with Ross gesturing toward the window as he speaks. Rachel stands beside him, looking out the window and reacting with surprise. Ross sits at the desk while Rachel sits in a chair across from him. A secretary enters, speaks briefly with Rachel, and exits. The scene then cuts to Monica Geller in her kitchen, talking on the phone while wearing an apron, with Rachel visible in the background.\n\n### **OBJECTS AND PROPS:**\n- Desk: black, with a computer monitor, telephone, and lamp\n- Chairs: gray, positioned around the desk\n- Window: large, with a view of city buildings\n- Potted plant: green, near the door\n- Refrigerator: white, with magnets and photos (visible in Monica’s kitchen)\n- Phone: white, held by Monica\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the office space with Rachel, highlighting the view and the size of the room. The conversation has a casual, excited tone, with Ross appearing enthusiastic and Rachel reacting with surprise and delight. The secretary briefly interrupts to speak with Rachel before leaving.\n\n### **TEMPORAL NOTES:**\nRoss and Rachel enter the office and walk toward the desk.\nRoss sits at the desk while Rachel sits across from him.\nThe secretary enters, speaks with Rachel, and exits.\nScene cuts to Monica in her kitchen talking on the phone.",
    "subtitles": "Wow. It's huge. It's so much bigger than the cubicle. Oh, this is a cube. Look at this. [GASPS] You have a window! Yes, indeedy. - With a beautiful view of... - Oh, look. That guy's peeing. Okay. That's enough of the view. All right, check this out. - Ahem. Okay, sit down here. Sit down. - Okay. Okay, this is great. This is great. - Ahem. You ready? - Yeah. Helen, could you come in here for a moment? Thank you, Helen, that'll be all. Last time I do that. I promise. Wendy, we had a deal. Yeah, you promised. Wendy. Wendy. Wendy! [GROANS]",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:57.771",
    "end_chunk": "00:16:00.750"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm indoor lighting with visible refrigerator and kitchen counter.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - white apron - dark, shoulder-length hair - animated expression\nRachel Green: white shirt - dark vest - brown hair in ponytail - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, wearing an apron and talking on the phone, gestures emphatically while Rachel, in a dark vest and white shirt, enters the room carrying a bag and puts on a brown coat. Monica continues talking on the phone as Rachel moves toward the door. Rachel exits the apartment, and Monica follows her out. Rachel returns moments later, and the two stand near the door, talking. Monica gestures toward Rachel as they converse. Rachel then opens the door to greet two visitors — a man and a woman — who enter the apartment. Monica and Rachel welcome the guests, with Monica smiling and Rachel holding a bag.\n\n### **OBJECTS AND PROPS:**\n- Refrigerator: white, with magnets and photos on the door\n- Coffee table: wooden, with a hat and bag on it\n- Vase with flowers: colorful, on a shelf near the refrigerator\n- Door: green, with a gold handle and a decorative frame above it\n- Coat: brown, worn by Rachel\n\n### **DIALOGUE CONTEXT:**\nMonica discusses needing a waitress with Rachel, who is about to leave. Rachel then returns and greets two visitors — a man and a woman — at the door. The conversation has a casual tone, with Monica appearing cheerful and Rachel reacting with a smile as she welcomes the guests.\n\n### **TEMPORAL NOTES:**\nRachel Green puts on a brown coat and exits the apartment.\nRachel Green returns to the apartment and opens the door.\nMonica Geller follows Rachel Green out of the apartment.\nRachel Green greets two visitors at the door.\nMonica Geller smiles and welcomes the visitors.",
    "subtitles": "[GROANS] Hmm, who was that? Wendy bailed. I have no waitress. That's too bad. Bye-bye. - Ten dollars an hour. - Nope. Twelve dollars an hour. Mon, I wish I could, but I've made plans to walk around. You know, Rachel, when you ran out on your wedding, I was there for you. I put a roof over your head, and if that means nothing to you... Twenty dollars an hour. Done. - Well, hello. Welcome to Monica's. - Hello. May I take your coat? - Hi, Steve. - Hello, Monica. Hello, greeter girl. - This is Rachel. - Yeah, okay. Mm, everything smells so delicious.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:59.458",
    "end_chunk": "00:17:03.271"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm indoor lighting with lamps and ambient glow from windows.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - smiling and animated\nRachel Green: white shirt with black tie - dark pants - brown hair in ponytail - serious expression\nPhoebe Buffay: dark-colored top with floral pattern - reddish-brown skirt - blonde, wavy hair - smiling and gesturing\nUnidentified person: dark jacket - dark pants - dark hair - smiling and talking\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, Rachel, and Phoebe stand together in the kitchen area, engaging in conversation while gesturing. Monica moves toward the dining table, where she pours wine into glasses. The unidentified person walks into the living room area and sits down, while Monica hands them a plate of food. Rachel and Phoebe continue talking, with Rachel appearing concerned as she speaks to Phoebe.\n\n### **OBJECTS AND PROPS:**\n- Wine bottle: dark-colored (on table)\n- Wine glasses: clear (on table)\n- Plates: blue (on table)\n- Refrigerator: white (in background)\n- Kitchen counter: blue (with various items)\n- Dining table: round, covered with white tablecloth\n- Chairs: wooden (around table)\n- Lamp: tall, with lampshade (in living room)\n\n### **DIALOGUE CONTEXT:**\nThe unidentified person discusses the delicious smell of food and the apartment, while Monica and Rachel engage in a conversation about the food. The tone is casual and friendly, with Monica appearing animated and Rachel looking concerned as she speaks to Phoebe.\n\n### **TEMPORAL NOTES:**\nMonica moves from the kitchen to the dining table\nThe unidentified person walks into the living room and sits down\nRachel and Phoebe continue talking while standing in the kitchen area",
    "subtitles": "Mm, everything smells so delicious. You know, I can't remember a time I smelled such a delicious combination of... Okay, smells. Well, it's a lovely apartment. Oh, thank you. Would you like a tour? I was just being polite, but all right. What? What's up? In the cab on the way over, Steve blazed up a doobie. What? Smoked a joint, you know? Lit a bone. Weed, hemp, ganja. Okay, okay, okay. Okay, I'm with you, Cheech. Okay. Is it dry in here? Let me get you some wine. Yeah, I think we're ready for our first course too. Okay... These are rock shrimp ravioli... ...in a cilantro ponzu sauce... - Oh. ...with just a touch of minced...",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:59.810",
    "end_chunk": "00:17:59.911"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with visible lamps and decorative items.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling and animated\nPhoebe Buffay: light-colored shirt - dark pants - blonde, shoulder-length hair - smiling, standing\nUnidentified person: dark-colored shirt - dark pants - dark hair - speaking and gesturing\n\n### **ACTIONS AND INTERACTIONS:**\nRachel sits on the couch, smiling and talking animatedly to the unidentified person, gesturing with her hands. Phoebe stands nearby, smiling and observing the interaction. The unidentified person sits on the couch, responding to Rachel while gesturing with his hands. Phoebe walks toward the kitchen area, then turns back to interact with the unidentified person.\n\n### **OBJECTS AND PROPS:**\n- Coffee table: with various items (unclear)\n- Couch: white, with patterned cushions\n- Refrigerator: white, with magnets and photos\n- Bookshelf: with books and decorative items\n- Vase: with colorful flowers\n\n### **DIALOGUE CONTEXT:**\nThe unidentified person discusses tartlets with Rachel. The conversation has a casual and humorous tone, with the unidentified person appearing animated and Rachel reacting by smiling and laughing.\n\n### **TEMPORAL NOTES:**\nPhoebe walks from the living room to the kitchen area.\nPhoebe returns to the living room and interacts with the unidentified person.",
    "subtitles": "...ginger. Well, smack my ass and call me Judy. These are fantastic. Oh, gosh. I'm so glad you liked them. Like them? I could eat a hundred of them. Oh. Well, um... That's all there is of these... ...but in about eight and a half minutes, we'll be serving some delicious tartlets. \"Tartlets\"? Heh. \"Tartlets.\" Word has lost all meaning. Excuse me. Can I help you with anything? You know, I don't know what I'm looking for.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00019",
    "start_chunk": "00:18:05.209",
    "end_chunk": "00:18:51.671"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen — evening, warm artificial lighting\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated\nUnidentified person: dark shirt - dark pants - dark hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands in the kitchen, gesturing animatedly while talking to an unidentified person who is holding a box of cereal. The unidentified person examines the cereal box, then picks up a carton of milk and shows it to Monica. Monica gestures with both hands as she speaks. The unidentified person then sits down at a dining table while Monica stands nearby, continuing to gesture and talk.\n\n### **OBJECTS AND PROPS:**\n- Cereal box: yellow (on counter)\n- Milk carton: white (in hand)\n- Dining table: white tablecloth (center)\n- Refrigerator: white (background)\n- Kitchen shelves: blue (background)\n- Wine bottle: dark (on table)\n\n### **DIALOGUE CONTEXT:**\nThe unidentified person discusses cereal and milk with Monica. The conversation has a casual tone, with the unidentified person appearing serious and Monica reacting by gesturing and speaking animatedly.\n\n### **TEMPORAL NOTES:**\nUnidentified person sits down at the table",
    "subtitles": "Oh, cool. Taco shells. You know, these are... They are like a little corn envelope, you know? You know what? You don't want to spoil your appetite. Hey. Sugar-O's. You know, if you just wait another six and a half minutes... Oh. Macaroni and cheese. We gotta make this. No, we don't. Oh, okay. Oh, sorry. Yeah, why don't you just have a seat here? Okay. Okay. Give me the Gummy Bears. Yeah, I... No. - Give them to me. - All right, we'll share. - No. Give me the bears. - Well, then you can't have any.",
    "episode": "1x15 - The One With The Stoned Guy",
    "chunk": "chunk_00020",
    "start_chunk": "00:19:08.063",
    "end_chunk": "00:20:01.532"
  },
  "summary": "**SCENE OVERVIEW**\nThe events begin in a bright, modern office overlooking a city skyline during the day. The scene then transitions to Monica's apartment, specifically her kitchen and living room, during the evening.\n\n**KEY CHARACTERS**\n*   **Ross Geller:** Enthusiastic about a new office space.\n*   **Rachel Green:** Initially surprised and delighted by the office, later appears concerned in Monica's apartment.\n*   **Monica Geller:** Hosting guests in her apartment, appears animated and cheerful.\n*   **Phoebe Buffay:** Present in Monica's apartment, participating in conversations.\n*   **Unidentified Visitor(s):** Guests in Monica's apartment, engaging in casual conversations about food and tartlets.\n\n**MERGED NARRATIVE SUMMARY**\nRoss excitedly shows Rachel a new office space with an impressive city view. They discuss the room's size and the view, with Rachel reacting with surprise and delight. A secretary briefly interrupts their conversation. The scene then shifts to Monica's apartment, where she is on the phone while Rachel prepares to leave. Rachel returns shortly after, and they greet two visitors entering the apartment. Later, Monica, Rachel, and Phoebe are in the kitchen area. Monica prepares wine and food, while an unidentified visitor joins them in the living room. Rachel appears concerned during a conversation with Phoebe. The unidentified visitor discusses tartlets with Rachel in a humorous exchange. In the kitchen, Monica and an unidentified person discuss cereal and milk.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Ross and Rachel share an excited moment discussing a new office space. Rachel's emotional state shifts from delight to concern within Monica's apartment.\n*   **Emotional Tone:** The initial scene with Ross and Rachel is casual and excited. The scenes in Monica's apartment are generally friendly and casual, with moments of concern from Rachel.\n*   **Plot Setup or Payoff:** The episode name \"The One With The Stoned Guy\" hints at potential comedic situations involving one of the unidentified visitors, though this is not explicitly shown in the provided captions. The focus is on social interactions and food.\n*   **Notable Transitions:** The primary transition is from the office setting to Monica's apartment, indicating a shift in focus from Ross and Rachel's professional lives to their social interactions. Within Monica's apartment, the focus moves between the kitchen, living room, and dining areas."
}