{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting. The group is seated around a wooden table in the center of the room, with a couch and kitchen area visible in the background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored sweater - jeans - dark hair tied up - smiling and animated\nChandler Bing: striped sweater - jeans - brown hair - smiling and gesturing\nRoss Geller: red jacket - light shirt - dark hair - serious expression\nPhoebe Buffay: light-colored floral shirt - jeans - blonde hair - smiling and holding cards\nJoey Tribbiani: dark shirt - jeans - brown hair - focused on cards\nMonica Geller: dark-colored top - jeans - dark hair - serving food and interacting\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is playing poker around a wooden table, with Rachel and Chandler engaged in conversation while holding cards. Ross, Phoebe, and Joey are also seated, focused on the game. Monica enters from the kitchen area, serving food to the group. The characters interact casually, with gestures and expressions indicating a relaxed, social atmosphere.\n\n### **OBJECTS AND PROPS:**\n- Poker cards (being held and played)\n- Glasses of beer and water (on table)\n- Plate of food (served by Monica)\n- Wooden table (center of frame)\n- Refrigerator (with magnets",
    "subtitles": "Oh, you're... All right, here we go. We've got salmon roulettes and assorted crudités. Whoa, whoa, whoa. Monica, what are you doing? This is a poker game. You can't serve food with more than one syllable. It's got to be like chips or dip or pretz... Okay, so at this point, the dealer... You know what? We got it. We got it. Let's play for real. High stakes. Big bucks. All right, now, you sure? Phoebe just threw away two jacks... ...because they didn't look happy. But I'm ready. So just deal. Okay, all right, last minute lesson. Last minute lesson. Joey. Three... ...eight. Eight, three. All right. Here we go. Damn it, damn it, damn it. I see. So then, um, you were lying. - About what? - About how good your cards were.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00006",
    "start_chunk": "00:04:59.090",
    "end_chunk": "00:06:01.026"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with lamps visible\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored long-sleeved top - dark pants - brown, shoulder-length hair tied up - expression shifts from smiling to serious\nChandler Bing: striped sweater - jeans - brown, short hair - expression: initially smiling, then serious\nRoss Geller: red jacket over light shirt - dark pants - dark, short hair - expression: focused, then animated\nPhoebe Buffay: light-colored floral shirt - dark pants - blonde, long hair - expression: animated, gesturing\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - expression: serious, concerned\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered around a wooden table playing poker, with chips and cards visible. Phoebe is animatedly talking and gesturing with her hands, while Ross and Chandler are seated, focused on the game. Monica stands near the table, looking concerned, and Rachel stands with her arms crossed, appearing displeased. Ross speaks to the group, and Monica gestures while talking to him. The group is engaged in conversation about the poker game, with Rachel and Monica appearing to be in disagreement.\n\n### **",
    "subtitles": "- About what? - About how good your cards were. Heh. I was bluffing. Aha. And what is \"bluffing\"? Is it not another word for lying? Okay, sorry to break up this party... ...but I've got résumés to fax before work tomorrow. ROSS: Whoa, whoa, whoa. - Rach, we've got to settle. Settle what? The Jamestown colony of Virginia. You see, King George is giving us the land, so... The game, Rachel. The game. You owe us money for the game. Oh, right. You know what, guys? It's their first time. Why don't we forget about the money? Hell, no. We'll pay. Okay, Monica, I had another answer all ready. And you know what? - We want a rematch. - Well, that's fine with me. Could use the money. So, basically, you get your ya-yas by taking money from all of your friends. - Yeah. - Yes, and I get my ya-yas from lkea.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00007",
    "start_chunk": "00:05:58.733",
    "end_chunk": "00:07:02.796"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and indoor decor.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: red jacket over light shirt - khaki pants - dark, short hair - serious, focused expression\nRachel Green: dark-colored sweater with white trim - black pants - brown, shoulder-length hair in a bun - concerned, arms crossed\nChandler Bing: striped sweater (brown, red, beige) - light blue jeans - dark, medium-length hair - nervous, hands clasped\nJoey Tribbiani: dark shirt with light gray panel - dark pants - dark, medium-length hair - animated, gesturing while speaking\nMonica Geller: dark-colored zip-up top - dark pants - dark, shoulder-length hair - attentive, standing near table\nPhoebe Buffay: light-colored, patterned shirt - dark pants - blonde, shoulder-length hair - listening, seated at table\n\n### **ACTIONS AND INTERACTIONS:**\nRoss stands near the table, gesturing as he speaks to Rachel and Chandler, who are standing nearby. Rachel stands with arms crossed, looking at Ross with a concerned expression. Joey sits at the table, animatedly talking and gesturing to Ross and Chandler. Monica stands behind the table, observing the group. Phoebe sits at the table, listening to the conversation. The group appears to be engaged in a tense poker game discussion, with Ross explaining his playing style.\n\n### **OBJECTS AND PROPS:**\n- Poker cards: scattered on the table\n- Red and white poker chips: on the table\n",
    "subtitles": "- Yeah. - Yes, and I get my ya-yas from lkea. You have to put them together yourself, but they cost a little less. Look, Rachel, this is poker. I play to win, all right? In order for me to win, other people have to lose. So if you're gonna play poker with me, don't expect me to be a nice guy. Okay, because once those cards are dealt... Yeah? I'm not a nice guy. All right, boys. Let's eat. Ah, did you get that from the \"I Love Rachel\" pizzeria? - You still on that? - Come on. What was with that whole Black Bart speech? \"When I play poker, I'm not a nice guy\". You're way off, pal.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00008",
    "start_chunk": "00:06:59.377",
    "end_chunk": "00:08:00.604"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with lamps and window light.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: red jacket over light shirt - khaki pants - dark, short hair - animated expression\nChandler Bing: dark-colored shirt - dark pants - brown, medium-length hair - serious expression\nJoey Tribbiani: striped sweater - light-colored pants - brown, medium-length hair - relaxed expression\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - smiling expression\nRachel Green: red sweater - jeans - dark, shoulder-length hair - smiling expression\nPhoebe Buffay: dark top - dark pants - blonde, long hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss, Chandler, and Joey stand in the living room, interacting with each other while holding bottles. Ross gestures animatedly while speaking. Chandler and Joey listen, occasionally looking at each other or Ross. The scene cuts to Monica, Rachel, and Phoebe sitting on the couch, playing cards. Monica stands and gestures while talking, Rachel smiles and looks at her cards, and Phoebe laughs while holding her cards. A capuchin monkey is seen moving around the room, climbing on furniture.\n\n### **OBJECTS AND PROPS:**\n- Bottles: dark-colored (on table)\n- Cards: playing cards (on coffee table)\n- Monkey: capuchin (on furniture)\n- Coffee table: wooden (center of frame)\n- Couch: white with red and white check",
    "subtitles": "You're way off, pal. No, I don't think so. See, Ross, because I think you love her. Uh, no. See, I might have had feelings for her at one time. Not anymore. I just... Marcel. Where are you going with that disk? You are not putting that on again. Marcel... Okay. If you press that button, you are in very, very big trouble. [THE TOKENS' \"LION SLEEPS TONIGHT\" PLAYING ON SPEAKERS] You believe what a jerk Ross was being? Yeah, I know. He can get really competitive. [LAUGHS] What? Oh. \"Hello, Kettle, this is Monica. You're black.\" Please. I am not as bad as Ross. Oh, I beg to differ. The Pictionary incident?",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00009",
    "start_chunk": "00:07:59.228",
    "end_chunk": "00:09:00.288"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated\nRachel Green: dark-colored sweater - patterned skirt - brown, shoulder-length hair - concerned\nPhoebe Buffay: black top - dark pants - blonde, long hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nMonica sits on the couch, gesturing expressively while speaking to Rachel, who holds a piece of paper and reacts with concern. Phoebe sits beside Monica, listening intently. Rachel stands up and walks toward the door, then turns back to speak with Phoebe. Monica follows her, holding the paper and appearing to explain something urgently.\n\n### **OBJECTS AND PROPS:**\n- White refrigerator (with magnets and photos) (kitchen area)\n- Wooden coffee table (center)\n- Red and white checkered pillow (on couch)\n- Vase with colorful flowers (on shelf)\n- Framed photos (on shelves and table)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses an interview at Saks Fifth Avenue with Monica and Phoebe. The conversation has a serious tone, with Rachel appearing excited and Monica looking concerned. Phoebe reacts by listening intently and",
    "subtitles": "Oh, I beg to differ. The Pictionary incident? That was not an incident. I was gesturing and the plate slipped out of my hand. Oh. - Oh! I got an interview. I got an interview. - You're kidding. Where? Where? - Saks Fifth Avenue. - Oh, Rachel. Oh, it's like the mother ship is calling you home. - Well, what's the job? - Assistant buyer. Oh! I would be shopping... ...for a living. [KNOCKING ON DOOR] Okay, look. That's Aunt Iris. This woman has been playing poker since she was 5. You've gotta listen to every word she says. - Hi. - Is Tony Randall dead? - Oh, why? - I don't think so. Well, he may be now because I think I hit him with my car. - My God. Really? - No, that's bluffing. Lesson number one. Let me tell you something. Everything you hear at a poker game is pure crap.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00010",
    "start_chunk": "00:08:56.827",
    "end_chunk": "00:10:03.393"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment living room across an evening and into daytime. The scene remains in the apartment throughout, though the focus shifts between different groups of characters and activities within the space.\n\n**KEY CHARACTERS**\n- **Monica Geller:** Host, serves food, concerned, then explains things urgently.\n- **Rachel Green:** Plays poker, appears displeased and concerned, discusses an interview.\n- **Chandler Bing:** Plays poker, animated and then serious/nervous.\n- **Ross Geller:** Plays poker, serious then animated, explains his playing style.\n- **Phoebe Buffay:** Plays poker, animated and listening, reacts with concern.\n- **Joey Tribbiani:** Plays poker, focused and animated.\n\n**MERGED NARRATIVE SUMMARY**\nThe group is gathered in Monica's apartment for a poker game. Initially, everyone is engaged and relaxed, with Monica serving food. However, the mood shifts as tensions rise during the game, particularly between Rachel and Monica, and Ross explains his poker strategy. At one point, the focus shifts to Ross, Chandler, and Joey interacting, while Monica, Rachel, and Phoebe play cards and a capuchin monkey is observed roaming the apartment. Later, the scene transitions to daytime where Monica, Rachel, and Phoebe discuss an important interview for Rachel at Saks Fifth Avenue, with Rachel holding a document and appearing concerned about the interview while Monica tries to explain something urgently.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Developing Tensions:** The poker game serves as a catalyst for underlying tensions and disagreements within the group, notably between Rachel and Monica.\n*   **Shift in Atmosphere:** The narrative moves from a casual evening social gathering with a poker game to a more serious discussion about career prospects.\n*   **Plot Setup:** The introduction of Rachel's interview at Saks Fifth Avenue sets up a significant plot point for the episode.\n*   **Unexpected Element:** The presence of a capuchin monkey adds a touch of surreal humor and a distraction from the human interactions.\n*   **Relationship Dynamics:** The interactions highlight the close friendships and differing personalities within the group, as they navigate both casual games and serious conversations."
}