{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen and living room — daytime transitioning to evening — mixed natural and artificial lighting\n\n### **CHARACTERS PRESENT:**\nPhoebe Buffay: dark-colored sweater - jeans - dark, shoulder-length hair - smiling\nRachel Green: dark-colored sweater - patterned pants - brown, shoulder-length hair - concerned\nMonica Geller: red sweater - jeans - dark, shoulder-length hair - animated\nUnidentified person: red coat - unclear lower clothing - blonde, short hair - speaking\n\n### **ACTIONS AND INTERACTIONS:**\nPhoebe, Rachel, and Monica are gathered around a wooden table, initially standing and then sitting as they interact with an unidentified woman in a red coat. The woman in the red coat gestures animatedly while speaking, then removes her coat to reveal a black and white polka-dot jacket underneath. Monica and Rachel react with expressions of surprise and concern. The scene cuts to a different apartment where Ross, Chandler, and Joey are seated around a table, with Ross standing and speaking to the group. Ross then walks away from the table, and Chandler and Joey remain seated, listening.\n\n### **OBJECTS AND PROPS:**\n- Wooden dining table (center of kitchen)\n- Refrigerator with magnets and photos (kitchen background)\n- Orange couch (living room)\n- Bookshelf with various items (living room)\n- Coffee mugs (on table)\n- Red coat (worn by unidentified person)\n- Black and white polka-dot jacket (worn by unidentified person)\n\n### **DIALOGUE CONTEXT:**\nThe unidentified woman discusses something with Phoebe and Rachel, who appear concerned.",
    "subtitles": "Everything you hear at a poker game is pure crap. - Nice earrings. - Thank you. Girls, sit down. - Um, Aunt Iris, this is Phoebe, and Rachel... - Yeah, yeah, yeah. Listen, I am parked at a meter. Let's do it. [THE TOKENS' \"LION SLEEPS TONIGHT\" PLAYING ON SPEAKERS] Ross, could we please, please, listen to anything else? All right. [MUSIC STOPS] I'm gonna pay for that tonight. [KNOCKING ON DOOR] - Hi. - Hey. Guess what, guess what, guess what. Uh, okay. The fifth dentist caved, and now they're all recommending Trident?",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00011",
    "start_chunk": "00:09:59.807",
    "end_chunk": "00:11:02.744"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting. The scene is set around a wooden dining table with characters seated or standing, and a kitchen area visible in the background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - plaid skirt - long, light brown hair - animated\nMonica Geller: dark-colored sweater - plaid skirt - dark, shoulder-length hair - expressive\nJoey Tribbiani: dark plaid shirt - dark pants - dark, medium-length hair - relaxed\nChandler Bing: grey sweater - dark pants - dark, medium-length hair - engaged\nRoss Geller: dark plaid shirt - blue jeans - dark, medium-length hair - attentive\nPhoebe Buffay: dark top - dark pants - long, blonde hair - smiling\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands at the table, gesturing animatedly while speaking to the group. Monica stands beside her, listening and reacting with expressive facial movements. Joey, Chandler, and Ross are seated around the table, listening intently. Phoebe sits at the table, smiling and observing the conversation. Rachel and Monica appear to be leading the discussion, with the others responding and engaging.\n\n### **OBJECTS AND",
    "subtitles": "Uh, okay. The fifth dentist caved, and now they're all recommending Trident? No, the interview. She loved me. She absolutely loved me. We talked for, like, two and a half hours. We have the same taste in clothes. Oh, I went to camp with her cousin. And, oh, the job is perfect. I can do this. I can do this well. GROUP: That's great. God. And she told the funniest story. Okay, great, you'll tell us and we'll laugh. Let's play poker. All right, listen, we talked about it... ...and if you don't want to play, we completely understand. Yes, yes. We can play some other game. Like, I don't know... ...Pictionary? Very funny. Very funny. I think we'd like to give poker another try. Shall we, ladies? BOTH: Yes, I think we should. Rach, do you want me to shuffle those? No, no. That's okay. You know what? I'm gonna give it a go. ROSS: All right. - All right.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00012",
    "start_chunk": "00:10:57.823",
    "end_chunk": "00:11:55.380"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment dining area — evening, warm indoor lighting with a lamp visible in the background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored plaid shirt - dark pants - dark, short hair - serious expression\nChandler Bing: dark-colored plaid shirt - dark pants - dark, medium-length hair - smiling expression\nRachel Green: dark-colored turtleneck dress - dark pants - brown, shoulder-length hair - animated expression\nPhoebe Buffay: dark-colored top - dark pants - blonde, long straight hair - smiling expression\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - concerned expression\nJoey Tribbiani: dark-colored sweater - dark pants - dark, medium-length hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered around a wooden dining table playing poker. Ross and Chandler are seated at the table, focused on the game. Rachel stands near the table, gesturing as she speaks. Monica stands near the table, holding money and looking at the group. Phoebe stands near the table, smiling and looking at the group. Joey stands near the table, looking at the group. The group is engaged in conversation, with Rachel speaking animatedly and the others listening.\n\n### **OBJECTS AND PROPS:**\n- Wooden dining table (center of frame)\n-",
    "subtitles": "So Pheebs owes 7.50. Monica, you owe $10. And, Rachel, you owe 15 big ones. Thanks for teaching us \"Crossed-eyed Mary.\" You guys, we gotta play that other way. All right, here's my 7.50, but I think you should know that this money is cursed. - What? - Oh, I cursed it. So now bad things will happen to he who spends it. That's all right, I'll take it. Bad things happen to me anyway. This way, I can break them up with a movie. So that just leaves the big Green poker machine, who owes 15. Hmm, oh, it's so typical: \"Ooh, I'm a man. Ooh, I have a penis. Ooh, I have to win money to exert my power over women.\" You know what? This is not over. We will play you again. And we will win and you will lose.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00013",
    "start_chunk": "00:12:06.600",
    "end_chunk": "00:13:01.279"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored turtleneck - plaid skirt - brown, shoulder-length hair - expression shifts from animated to serious\nMonica Geller: red sweater - jeans - dark, shoulder-length hair - expression serious, arms crossed\nRoss Geller: plaid shirt - dark pants - dark, short hair - expression concerned, seated\nChandler Bing: plaid shirt - dark pants - dark, short hair - expression serious, seated\nJoey Tribbiani: light-colored shirt - dark vest - dark, short hair - expression relaxed, seated\nPhoebe Buffay: dark sweater - jeans - dark, shoulder-length hair - expression animated, standing\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands near the table, gesturing and speaking to Monica and the others, who are seated around the table. Monica stands with arms crossed, listening. Ross and Chandler sit at the table, looking at Rachel. Joey sits at the table, looking at the group. Phoebe stands near the kitchen counter, holding a phone and speaking. Ross stands up and walks toward the refrigerator, interacting with Monica. Rachel leans on the counter,",
    "subtitles": "We will play you again. And we will win and you will lose. And you will beg and we will laugh. And we will take every last dime you have. And you will hate yourselves forever. Hmm. Kind of stepped on my point there, Mon. So you gals wanna hand over your money now? That way, we don't have to go through the formality of actually playing. No, that's fine. We'll see who has the last laugh there, monkey boy. Okay, are we done with the chitchat? Are we ready to play serious poker? Hey, you guys, look. The one-eyed jack follows me wherever I go. Right, okay. Serious poker. MONICA: Excuse me. Where are you going? Uh, to the bathroom. Do you wanna go to the bathroom or do you wanna play poker? I wanna go to the bathroom. - All right, well, I'm gonna order a pizza. - Oh, no, no, no. I'm waiting to hear from that job. And the store closes at 9, so you can eat then.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00014",
    "start_chunk": "00:12:58.194",
    "end_chunk": "00:14:02.131"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting from lamps and overhead fixtures.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - animated\nRoss Geller: light-colored shirt - dark pants - short, dark hair - serious\nRachel Green: light blue striped shirt - dark pants - brown, shoulder-length hair - focused\nChandler Bing: light-colored shirt with dark vest - jeans - short, dark hair - smiling\nPhoebe Buffay: dark-colored cardigan over light top - long, blonde hair - engaged\nJoey Tribbiani: light-colored shirt - dark pants - short, dark hair - relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is gathered around a wooden table playing poker, with beer bottles and poker chips visible. Monica and Ross are seated, dealing cards and reacting to the game. Rachel leans on a counter, looking up with a surprised expression. Phoebe and Chandler are seated, holding cards and talking. Joey stands near the table, then sits down. The group is engaged in conversation and the game, with expressions ranging from focused to amused.\n\n### **OBJECTS AND PROPS:**\n- Beer bottles: various brands (on table)\n- Poker chips: red and white (on table)\n- Playing cards: being held and dealt\n- Wooden table: central to the scene\n- Refrigerator: white, with magnets and photos (in background)\n- Blue counter: with a cash register and books (behind Rachel)\n- Flower arrangement: colorful, in a vase (on counter)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses poker with the group, making a joke about the word",
    "subtitles": "And the store closes at 9, so you can eat then. That's fine. I'll just have a Tic Tac to hold me over. All right. Cincinnati. No blinds. Everybody ante. Yes. Or no. ROSS: All right. Your money's mine, Green. Your fly's open, Geller. You guys, you know what I just realized? \"Joker\" is \"poker\" with a \"J.\" Coincidence? Hey, that's \"jo-incidence\" with a \"C.\" [CHUCKLES] - Uh, Phoebe. Phoebe... - Yeah, I'm out. I'm in.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00015",
    "start_chunk": "00:13:59.547",
    "end_chunk": "00:15:00.648"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment, transitioning from daytime to evening. The primary setting is the kitchen and living room area, with a focus on the dining table where a poker game is in progress.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Host, appears animated, concerned, and focused throughout.\n*   **Rachel Green:** Appears concerned, animated, and focused, actively participating in discussions.\n*   **Phoebe Buffay:** Appears smiling, observing, and engaged.\n*   **Ross Geller:** Appears attentive, serious, and concerned, participates in discussions and the poker game.\n*   **Chandler Bing:** Appears engaged, serious, and smiling, participates in discussions and the poker game.\n*   **Joey Tribbiani:** Appears relaxed and attentive, participates in the poker game.\n*   **Unidentified Person:** Initially present, speaks to Phoebe and Rachel, reveals a polka-dot jacket.\n\n**MERGED NARRATIVE SUMMARY**\nThe scene opens in Monica's apartment kitchen and living room, with Phoebe, Rachel, and Monica interacting with an unidentified woman wearing a red coat. The woman, who reveals a polka-dot jacket underneath, discusses something that causes Rachel and Monica to appear surprised and concerned. The scene then shifts to focus on the entire group of friends – Monica, Rachel, Phoebe, Ross, Chandler, and Joey – gathered in the apartment. They are playing poker around a wooden table, with drinks and poker chips evident. Conversations and discussions are ongoing, with Rachel and Monica appearing particularly animated. Ross and Chandler are focused on the game, while Joey is relaxed. Later, the dynamics shift slightly as Rachel speaks animatedly to Monica and the seated group, with Monica standing with her arms crossed. Ross walks towards the refrigerator, and Rachel leans on the counter. The group continues to engage in the poker game and conversation, with expressions ranging from focused to amused, and Ross makes a comment about the game.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Initial Mystery:** An unidentified woman introduces a brief, potentially significant, interaction that causes concern among Phoebe, Rachel, and Monica.\n*   **Shift to Social Gathering:** The narrative quickly transitions to a social event, a poker game among the core group of friends.\n*   **Poker Game Dynamics:** The friends are actively engaged in playing poker, indicating a relaxed, social evening with elements of competition and humor, as evidenced by the dialogue context.\n*   **Emotional Range:** Characters display a range of emotions, from concern and seriousness to amusement and animation, reflecting the unfolding interactions and the game itself.\n*   **Setting Stability:** The majority of the scene remains within Monica's apartment, with a consistent focus on the dining table area."
}