{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and kitchen area in background.\n\n### **CHARACTERS PRESENT:**\nRachel Green: light-colored striped shirt - dark pants - long, brown, wavy hair tied back - animated, smiling\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - focused, smiling\nPhoebe Buffay: dark-colored sweater - jeans - dark, shoulder-length hair - smiling, engaged\nChandler Bing: light-colored shirt - dark vest - light-colored pants - smiling, relaxed\nRoss Geller: light-colored shirt - dark pants - short, dark hair - serious, attentive\nJoey Tribbiani: dark-colored sweater - jeans - blonde, long hair - smiling, relaxed\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is seated around a wooden table playing poker, with Rachel animatedly gesturing and speaking while holding cards, Monica and Phoebe smiling and watching, Chandler and Ross leaning forward attentively, and Joey relaxed with a drink. Rachel places a red poker chip on the table, and Ross stands up briefly before returning to his seat. The group is engaged in conversation and laughter, with Rachel appearing to be the center of attention as she talks and gestures.\n\n### **OBJECTS AND PROPS:**\n- Wooden table: center of frame, with poker cards, chips, and beer bottles\n- Beer bottles: dark-colored (on table)\n- Poker chips: red, white, and blue (on table)\n- Blue vase with",
    "subtitles": "I'm in. Me too. Me too. All right. What do you got? Well, you better hop out of the shower, because I got a flush. Well, well, well. Hop back in, bucko, because I got four sixes. I got four sixes. I won. I actually won. Oh, my God. You know what? I think I'm gonna make a little Ross pile. I think that one was Ross'. And I think, oh, that one was Ross'. [SINGSONG] Well, I have got your money. And you'll never see it. And your fly's still open. I made you look. PHOEBE: I'm in. RACHEL: I couldn't be inner. PHOEBE: Monica? Monica, in or out? I hate this game.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:59.356",
    "end_chunk": "00:15:53.534"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with lamps visible\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light blue button-down shirt over red shirt - dark pants - dark, short hair - serious, focused expression\nChandler Bing: light blue button-down shirt with dark vest - dark pants - brown, medium-length hair - animated, expressive\nRachel Green: light blue button-down shirt - dark pants - brown, shoulder-length hair - focused, occasionally smiling\nPhoebe Buffay: dark-colored sweater - dark pants - dark, shoulder-length hair - serious, attentive\nJoey Tribbiani: dark-colored plaid shirt - dark pants - dark, medium-length hair - engaged, animated\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is seated around a wooden table playing poker, with chips and cards spread out. Ross and Chandler are actively engaged in the game, with Ross making bets and Chandler reacting with gestures. Rachel holds her cards and occasionally looks at others, while Phoebe and Joey are also focused on the game, interacting with each other and the others. The atmosphere is casual and competitive, with characters leaning in to talk and gesture during the game.\n\n### **OBJECTS AND PROPS:**\n- Poker chips: red, white, blue (on table)\n- Playing cards: being held and dealt (on table)\n- Beer bottles: dark-colored (on table)\n- Water bottle: clear with pink label (on table)\n",
    "subtitles": "Okay, Joey, your bet. I fold, like a cheap hooker who got hit in the stomach... ...by a fat guy with sores on his face. Oh, I'm out. - Ross? - Oh, I'm very in. - Chandler? - Couldn't be more out. Me too. Rachel? Um, I will see you and I'll raise you. What do you say? You wanna waste another buck? No, not this time. - So, what did you have? - I'm not telling. - Come on, show them to me. - No. - Show them to me. Let me see. - Get your hands out of there. You know, I've had dates like this. Boy, you really can't stand to lose, can you? Your whole face is getting red. Little veins popping out of your temple. Plus that shirt doesn't really match those pants.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00017",
    "start_chunk": "00:16:01.627",
    "end_chunk": "00:16:57.265"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nRachel Green: light blue striped button-down shirt - unclear lower clothing - brown, shoulder-length hair styled up - expression shifts from focused to concerned, then annoyed\nPhoebe Buffay: dark-colored cardigan over light top - long, straight blonde hair - expression attentive, then slightly concerned\nRoss Geller: light blue button-down shirt over red henley - dark hair - expression focused, then surprised\nChandler Bing: dark-colored shirt - dark hair - expression amused, then neutral\n\n### **ACTIONS AND INTERACTIONS:**\nRachel Green stands at the kitchen counter, handling a phone and poker chips, then begins a phone conversation while gesturing. Phoebe Buffay sits at the table, watching Rachel with a concerned expression. Ross Geller sits at the table, focused on his cards, reacting with surprise when Rachel gets on the phone. Chandler Bing sits nearby, smiling and observing the scene. Rachel ends the call and returns to the table, looking frustrated.\n\n### **OBJECTS AND PROPS:**\n- Poker cards: red and white (on table)\n- Beer bottle: brown (on table)\n- Phone: white landline (held by Rachel)\n- Coffee mugs: unclear (on table)\n- Blue kitchen counter (background)\n- Wooden table (center)\n- Refrigerator (background, with magnets)\n\n### **DIALOGUE CONTEXT:**\nRachel Green discusses a job opportunity with someone on the phone, expressing frustration and annoyance. The conversation has a tense tone, with Rachel appearing annoyed and the others reacting with concern or amusement. The phone call interrupts the poker game, causing a shift in the",
    "subtitles": "First of all, I'm not losing. [PHONE RINGS] - Just deal. - Hello? Rachel Green. [MIMICKING RACHEL] Excuse me. It's about the job. Barbara, hi. How are you? Uh-huh? No, I understand. Yeah, oh, come on. No, I'm fine. Don't be silly. Yeah. Oh, but you know, if anything else opens up, please... Hello? [SCOFFS] Hmm. Sorry, Rach. Yeah, you know, there's gonna be lots of other stuff. Yeah. Okay. Where were we? Oh. Okay.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00018",
    "start_chunk": "00:17:01.186",
    "end_chunk": "00:18:00.828"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment kitchen/living area — evening, warm artificial lighting from lamps and overhead fixtures\n\n### **CHARACTERS PRESENT:**\nRachel Green: light blue striped shirt - dark pants - brown, shoulder-length hair - focused, animated\nPhoebe Buffay: dark-colored sweater - dark pants - dark, shoulder-length hair - serious, attentive\nRoss Geller: plaid shirt over dark t-shirt - dark pants - dark, short hair - concerned, looking down\nChandler Bing: light blue shirt over red shirt - dark pants - dark, short hair - serious, looking at cards\nMonica Geller: dark-colored sweater - dark pants - dark, tied-back hair - animated, gesturing\nJoey Tribbiani: dark-colored shirt - dark pants - dark, short hair - relaxed, smiling\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is seated around a round wooden table playing poker. Rachel holds and examines her cards, gesturing with her hands as she speaks. Phoebe looks at her cards intently. Ross and Chandler are focused on their hands, with Chandler looking up and speaking. Monica gestures animatedly while talking to the group. Joey sits back, smiling, and appears to be listening to the conversation.\n\n### **OBJECTS AND PROPS:**\n- Poker cards: being held and dealt\n- Beer bottles: dark-colored bottles on table\n- Chips: red and blue poker chips on table\n-",
    "subtitles": "Where were we? Oh. Okay. Five card draw. Uh, jacks are better. Nothing wild, everybody ante. Look, Rach, we don't have to do this. Yes, we do. - All right. Check. - Check. I'm in for 50 cents. - Call. - I'm in. I see your 50 cents... ...and I raise you... ...$5. I thought, uh, it was a 50-cent limit. Well, I just lost a job, and I'd like to raise the bet 5 bucks. Does anybody have a problem with that? - Not at all. - No, no. [MONICA CLEARS THROAT] Loser? No, I fold. What do you mean, you fold? Hey, come on, what is this? I thought that, \"Once the cards are dealt, I'm not a nice guy.\"",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:58.368",
    "end_chunk": "00:19:02.807"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm lamp lighting. The scene is set around a wooden dining table with kitchen appliances and decor visible in the background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: light blue button-up shirt over red striped shirt - dark pants - short, dark hair - focused expression\nRachel Green: light blue and white striped button-up shirt - dark pants - shoulder-length brown hair, partially tied back - animated, expressive\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - serious, concerned\nChandler Bing: light blue button-up shirt under dark vest - dark pants - medium-length brown hair - serious, attentive\nJoey Tribbiani: plaid shirt - jeans - medium-length brown hair - surprised expression\nPhoebe Buffay: dark sweater with pattern - jeans - dark, shoulder-length hair - surprised expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits at the table, focused on playing poker, handling cards and chips. Rachel Green sits across from him, animatedly talking and gesturing with her hands while holding cards. Monica Geller sits nearby, looking concerned. Chandler Bing and Joey Tribbiani sit at the table, watching the game intently. Phoebe Buffay sits at the table, looking surprised. The group is engaged in a poker game, with chips and cards on the table.\n\n### **OBJECTS AND PROPS:**\n- Beer bottles: dark-colored (on table)\n- Blue glass: tall, on table\n- Poker chips: red and white (on table)\n- Cards: being held and played (on table)\n- Wooden table: central, with items on it\n- Kitchen appliances: visible in background\n- Flower arrangement: red and yellow flowers (on counter)\n\n### **DIALOGUE",
    "subtitles": "I thought that, \"Once the cards are dealt, I'm not a nice guy.\" I mean, what? Were you just full of it? [CLEARS THROAT] I'm in. - How many you want? - One. Dealer takes two. - What do you bet? - I bet $2. Okay. See your 2... ...and I raise you... ...20. - Wow. I see your 20... ...raise you 25. See your 25... ...and, uh, Monica, get my purse.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:58.387",
    "end_chunk": "00:19:59.363"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment living room and kitchen area during the evening. The scene remains consistent throughout, focusing on the group gathered around a poker table.\n\n**KEY CHARACTERS**\n*   **Rachel Green:** Initially animated and the center of attention, later becomes frustrated after a phone call.\n*   **Ross Geller:** Focused and serious during the poker game.\n*   **Monica Geller:** Appears concerned at times, especially during Rachel's phone call.\n*   **Chandler Bing:** Generally relaxed and amused, observing the interactions.\n*   **Phoebe Buffay:** Attentive and sometimes concerned, particularly during Rachel's call.\n*   **Joey Tribbiani:** Relaxed and engaged in the game.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Monica's apartment living room where Rachel, Monica, Phoebe, Chandler, Ross, and Joey are gathered around a wooden table playing poker. The atmosphere is lively and competitive, with characters engaged in conversation, laughter, and gesturing as they play. Rachel is particularly animated, seeming to be the focus of attention. The game continues with Ross and Chandler actively betting, while others observe or interact. The poker game is interrupted when Rachel takes a phone call at the kitchen counter, discussing a job opportunity. This call causes a shift in the mood, with Rachel appearing frustrated and annoyed, and the others reacting with concern or amusement. After the call, Rachel returns to the table, visibly frustrated, while the poker game and general interactions resume with varying expressions of focus, concern, and amusement among the group.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship developments:** The core interaction is a friendly, competitive poker game among the friends, highlighting their casual social dynamics.\n*   **Emotional tone:** The tone shifts from lighthearted and competitive during the poker game to tense and concerned during Rachel's phone call, and then back to a more general, albeit sometimes concerned, atmosphere.\n*   **Plot setup or payoff:** Rachel's phone call introduces a new plot element regarding a job opportunity, causing a brief disruption and revealing her frustration.\n*   **Notable transitions between locations or conversations:** The primary transition is Rachel moving to the kitchen counter for her phone call, which interrupts the poker game and shifts the focus of the group."
}