{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting from lamps and kitchen area\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored cardigan - black pants - blonde, shoulder-length hair - animated expression\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - serious expression\nRoss Geller: light-colored shirt - dark pants - dark, short hair - concerned expression\nChandler Bing: patterned shirt - light pants - dark, medium-length hair - focused expression\nJoey Tribbiani: dark shirt - jeans - dark, medium-length hair - relaxed expression\nPhoebe Buffay: dark polka-dot dress - blonde, long hair - smiling expression\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands in the living room, holding and reading papers while speaking to Ross and Chandler, who are seated on the couch. Monica and Joey are at the kitchen table, also reviewing papers from a cardboard box. Phoebe stands near the doorway, holding a paper and observing the group. Rachel gestures while talking, and Ross looks up at her, appearing to respond. Chandler remains seated, focused on his own papers. Monica leans over the table, interacting with Ross as they examine the documents.\n\n### **OBJECTS AND PROPS:**\n- Cardboard box: with papers inside (on kitchen table)\n- Coffee mugs: various colors (on table)\n- Wooden coffee table: cluttered with papers and magazines\n- Refrigerator: white, with magnets and photos (visible in kitchen)\n- Blue shelves: with kitchen items and decor (background)\n- Lamp: with striped shade (on side table)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses job résumés with Ross and Chandler. The conversation has a casual, slightly tense tone, with Rachel appearing animated and Ross looking concerned. Monica and Joey react by examining the papers, while Phoebe observes from the doorway.\n\n### **TEMPORAL NOTES:**\nPhoebe enters the frame from the right side\nRachel moves from standing to sitting on the couch\nRoss leans forward to look at Rachel while speaking\nMonica moves from standing to leaning over the table",
    "subtitles": "[ALL WHISTLING THEME FROM THE BRIDGE ON THE RIVER KWAl] Rach, we're running low on résumés over here. Do you really want a job with Popular Mechanics? Well, if you're gonna work for mechanics, those are the ones to work for. Hey, look, you guys. I'm going for anything here, okay? I can't be a waitress anymore. I mean it. I'm sick of the lousy tips. I'm sick of being called \"Excuse Me.\" Rach, did you proofread these? Uh, yeah. Why? Uh, nothing. I'm sure they'll be impressed with your excellent \"compuper\" skills. Oh, my God! Oh, do you think it's on all of them? Oh, no, I'm sure the Xerox machine caught a few.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00001",
    "start_chunk": "00:00:03.128",
    "end_chunk": "00:00:57.347"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting. The setting features the iconic green pillars, orange couches, and the \"Central Perk\" sign visible above the entrance.\n\n### **CHARACTERS PRESENT:**\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - smiling\nMonica Geller: dark-colored sweater - jeans - dark, tied-back hair - animated\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smirking\nJoey Tribbiani: red shirt - dark pants - dark, medium-length hair - smiling\nRoss Geller: dark sweater - blue jeans - dark, short hair - serious\nPhoebe Buffay: dark top - dark pants - dark, shoulder-length hair - smiling\nChandler Bing: light-colored shirt - dark pants - short, brown hair - smirking\n\n### **ACTIONS AND INTERACTIONS:**\nRachel stands near the counter, smiling and gesturing as she speaks to the group. Monica stands near the counter, holding papers and looking at them. Chandler sits on the couch, smirking and looking at Rachel. Joey sits at the table, smiling and looking at Rachel. Ross sits on the couch, looking at Monica with a serious expression. Phoebe stands near the counter, smiling and looking at Rachel. The group appears to be engaged in a lively conversation, with Rachel as the main speaker.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with coffee mugs)\n- Green pillars (background)\n- \"Central Perk\" sign (above entrance)\n\n### **DIALOGUE CONTEXT:**\nRachel discusses bringing the mail with the group. The conversation has a casual tone, with Rachel appearing animated and the others reacting by smiling or looking at her. The group seems to be enjoying their time together.\n\n### **TEMPORAL NOTES:**\nRachel moves from standing near the counter to sitting at the table. Monica moves from standing near the counter to sitting on the couch. Chandler moves from sitting on the couch to standing up and walking toward",
    "subtitles": "- Hey, guys. BOTH: Hey. Hey. Hi, ladies. Uh, can I get you anything? - Did you bring the mail? - Lots of responses. Really? Sure we have scones left.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00002",
    "start_chunk": "00:01:48.817",
    "end_chunk": "00:02:01.120"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, warm ambient lighting with natural light from windows\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - jeans - dark, shoulder-length hair - focused expression\nRachel Green: blue sweater with black collar - light-colored pants - blonde, shoulder-length hair in ponytail - attentive expression\nPhoebe Buffay: brown jacket over light shirt - dark pants - blonde, long hair tied back with scrunchie - smiling expression\nChandler Bing: dark shirt - dark pants - brown, medium-length hair - relaxed expression\nRoss Geller: red cardigan over white shirt - light-colored pants - dark, short hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica, Rachel, and Phoebe are seated on the orange couch, reviewing papers and writing notes. Chandler and Ross are seated on a separate couch, engaged in conversation. Monica stands and moves around the room, interacting with the others. Ross gestures animatedly while speaking to Chandler, who listens with a relaxed posture.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on tables)\n- Orange couch (center of frame)\n- Wooden tables with drinks and papers\n- Brick wall decor (background)\n- Menu board (behind counter)\n- Papers and pens (held by characters)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses a personal matter with Chandler, possibly related to a past relationship, while Monica, Rachel,",
    "subtitles": "Really? Sure we have scones left. Okay, read them to me. \"Dear Miss Green: Thank you for your inquiry. However...\" - We have apple cinnamon... - Okay, \"Dear Miss Green\"... Yeah. Yeah, yeah. No. - Wow. - What? Your Visa bill is huge. Give me that. You know, I can't believe you. Linda is so great. - Why won't you go out with her again? - I don't know. Is this still about her whole... ...\"The Flintstones could have really happened\" thing? It's not just that. It's just, I want someone who does something for me... ...you know, who gets my heart pounding... ...who makes me, uh... Little play things with yarn? What? Could you want her more? Who? Who? Dee, the sarcastic sister from What's Happening!!",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00003",
    "start_chunk": "00:01:58.201",
    "end_chunk": "00:02:57.050"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nCentral Perk coffee shop — daytime, natural window light and interior lighting\n\n### **CHARACTERS PRESENT:**\nChandler Bing: dark-colored shirt - dark pants - short, dark hair - smiling/relaxed\nRoss Geller: red jacket over light shirt - light-colored pants - short, dark hair - concerned/animated\nPhoebe Buffay: brown jacket over light shirt - long, blonde hair - animated\nRachel Green: dark-colored top - dark pants - dark, shoulder-length hair - serious/attentive\n\n### **ACTIONS AND INTERACTIONS:**\nChandler and Ross are seated at a table, engaged in conversation, with Chandler gesturing and Ross reacting. Phoebe sits on the orange couch, speaking animatedly and gesturing with her hands while Rachel listens. Ross stands up and walks toward the couch, interacting with Phoebe. Chandler remains seated, observing the interaction.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Orange couch (center of frame)\n- Wooden table (with items on it)\n- Bar stools (in background)\n- Vase with flowers (near window)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses poker with Chandler, who laughs. Phoebe talks about poker, questioning why women are not included in their game",
    "subtitles": "Who? Look, I am totally, totally over her, okay? - I just... Hi. - Hi. Coffee? - No, we're fine. - Okay. [CHANDLER & ROSS LAUGH] Shut up. We're not saying anything. - What? - Uh, Joey cried last night. Thank you. We were playing poker, right? There was chocolate on the three. It looked like an eight, all right? Oh, God, you should've seen him. \"Read them and weep.\" And then he did. Well, now, how come you guys have never played poker with us? Yeah, what is that? Like some kind of guy thing? Like some kind of sexist guy thing? Like, it's poker, so only guys can play? No. Women are welcome to play. Oh, okay, so then what is it? Some kind of, you know, like, some kind of, you know, like... All right, what is it? There just don't happen to be any women in our game.",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00004",
    "start_chunk": "00:03:00.138",
    "end_chunk": "00:04:02.032"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm artificial lighting with visible lamps and kitchen appliances in the background.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: red button-up shirt - white undershirt - short, dark hair - expression shifts from surprised to focused\nPhoebe Buffay: light-colored floral shirt - dark pants - blonde, shoulder-length hair - animated, gesturing while speaking\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - serious, focused expression\nChandler Bing: dark shirt with pocket detail - light-colored pants - dark, medium-length hair - relaxed, smiling\nRachel Green: blue top with black neckline - white skirt - brown, shoulder-length hair tied back - attentive, holding cards\n\n### **ACTIONS AND INTERACTIONS:**\nThe group is seated around a wooden table playing poker, holding cards and chips. Ross, in a red shirt, is actively engaged in the game, looking at his cards and interacting with others. Phoebe, wearing a floral shirt, gestures animatedly while speaking to the group. Monica, in a dark top, sits attentively, holding cards and listening. Chandler, in a dark shirt, leans back with a relaxed expression, occasionally looking at the game. Rachel,",
    "subtitles": "There just don't happen to be any women in our game. Yeah, we just don't happen to know any women that know how to play poker. Oh, please. That is such a lame excuse. I mean, it's a typical guy response. Excuse me, do any of you know how to play? [IN UNISON] No. But you could teach us. [IN UNISON] No. Okay, so now we draw cards. So I wouldn't need any, right? Because I have a straight. - Oh, good for you. - Congratulations. [MICROWAVE BEEPING] Okay, Pheebs, how many do you want? Okay, I just need two. The 10 of spades and the six of clubs. No, uh, Pheebs, you can't do that. I have the 10 of spades. Here, you want it? Thanks. Uh, no, see, uh, you can't do that. No, no. That's okay. I don't need them. I'm going for fours. Oh, you're...",
    "episode": "1x18 - The One with All the Poker",
    "chunk": "chunk_00005",
    "start_chunk": "00:03:59.822",
    "end_chunk": "00:05:00.465"
  },
  "summary": "**SCENE OVERVIEW**\nThe scenes begin in Monica's apartment living room in the evening, then transition to the Central Perk coffee shop during the daytime, and finally return to Monica's apartment living room for an evening poker game.\n\n**KEY CHARACTERS**\n- **Monica Geller:** Host, involved in various conversations and activities.\n- **Rachel Green:** Initially discussing job résumés, then engaged in conversations at Central Perk, and later playing poker.\n- **Ross Geller:** Concerned about Rachel's job search, later involved in conversations about poker and past relationships.\n- **Chandler Bing:** Participates in discussions about résumés and poker, often with a relaxed or amused demeanor.\n- **Joey Tribbiani:** Present in the initial apartment scene, then seemingly absent from Central Perk scenes before reappearing for the poker game.\n- **Phoebe Buffay:** Observes the initial résumé discussion, participates in Central Perk conversations, and joins the poker game.\n\n**MERGED NARRATIVE SUMMARY**\nThe episode opens in Monica's apartment living room with Rachel discussing her job résumés with Ross and Chandler, while Monica and Joey review papers from a box. Phoebe observes. Later, the group gathers at Central Perk. Rachel is animatedly discussing bringing mail, and the conversation shifts to the topic of poker, with Phoebe questioning why women aren't included in games. Ross and Chandler are also seen discussing poker and personal matters. The scene then shifts back to Monica's apartment where the group, now including Joey, is playing poker.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** Early scenes show concern for Rachel's job search, while later conversations at Central Perk touch upon personal matters and the dynamics of male-dominated games. The group's consistent gathering at Central Perk and Monica's apartment highlights their close friendships.\n*   **Emotional Tone:** The initial tone is casual with a hint of tension regarding Rachel's job. Conversations at Central Perk appear lively and inquisitive, particularly Phoebe's comments on poker. The poker game scene suggests a fun, competitive atmosphere.\n*   **Plot Setup:** The discussion about résumés sets up potential future plot points related to Rachel's career. The introduction of poker as a topic of conversation directly leads into the poker game that takes place later.\n*   **Notable Transitions:** The significant transition from the intimate setting of Monica's apartment to the public space of Central Perk, and then back to the apartment for a game, shows the group moving between their personal and social lives. The shift in conversation topics from résumés to poker also marks a narrative progression."
}