{
  "chunk_1": {
    "caption": "### **SCENE SETTING:**\nApartment hallway — evening, artificial lighting from wall sconces and doorways\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored shirt - dark pants - short, dark hair - concerned expression\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated expression\nRachel Green: dark-colored jacket over striped shirt - dark pants - medium-length brown hair - serious expression\nChandler Bing: dark-colored shirt with white pattern - dark pants - medium-length brown hair - serious expression\nJoey Tribbiani: dark-colored sweater - dark pants - medium-length brown hair - serious expression\nPhoebe Buffay: light-colored sweater - dark pants - blonde, shoulder-length hair - concerned expression\n\n### **ACTIONS AND INTERACTIONS:**\nRoss and Monica are seated on a couch, engaged in conversation. Monica gestures animatedly while speaking. The group then moves to the hallway, where Rachel, Phoebe, and Monica stand near apartment door 20, talking and gesturing. Chandler and Joey stand nearby, observing the conversation with serious expressions. Monica appears to be explaining something to Rachel and Phoebe, who listen intently.\n\n### **OBJECTS AND PROPS:**\n- Couch: striped cushions (center of frame)\n- Apartment doors: green with gold numbers (19 and 20 visible)\n- Wall sconces: providing lighting in hallway\n- Doorway: visible in background\n\n### **DIALOGUE CONTEXT:**\nMonica discusses the keys to the apartment with Rachel and Phoebe. The conversation has a tense tone, with Monica appearing animated and Rachel and Phoebe reacting with concern. Chandler and Joey stand nearby, listening to the discussion.\n\n### **TEMPORAL NOTES:**\nRoss and Monica move from sitting on the couch to standing in the hallway.\nRachel, Phoebe, and Monica gather near door 20.\nChandler and Joey shift their positions slightly while observing the group.",
    "subtitles": "This is... It's too weird. I feel stupid. All right, so don't do it. It's fine. You don't have to do it just because Susan does it. Hello, baby. Hello, hello. - That moment when we first saw the giant dog shadow fall over the park? But did they have to shoot him down? I mean, that was just mean. Okay, right about now the turkey should be crispy on the outside... ...and juicy on the inside. Why are we standing here? We're waiting for you to open the door. You've got the keys. No, I don't. Yes, you do. When we left, you said, \"Got the keys.\" No, I didn't. I asked, \"Got the keys?\" No, no, no. You said, \"Got the keys.\" Either of you have the keys? - The oven is on. - Oh, I've gotta get my ticket. - Wait. We have a copy of your key. - Well, then get it, get it! Hey, hey. That tone won't make me go any faster.",
    "episode": "1x09 - The One Where Underdog Gets Away",
    "chunk": "chunk_00016",
    "start_chunk": "00:14:57.021",
    "end_chunk": "00:16:01.042"
  },
  "chunk_2": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with natural light filtering through curtains.\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored shirt - dark pants - short, dark hair - expression shifts from animated to concerned\nPhoebe Buffay: brown button-up shirt - dark pants - blonde, shoulder-length hair - expression shifts from relaxed to surprised\nUnidentified person: dark-colored dress - dark hair - expression neutral (appears to be Monica Geller, but facial features do not match reference image)\n\n### **ACTIONS AND INTERACTIONS:**\nRoss sits on the couch, gesturing animatedly while speaking to Phoebe, who is lying across his lap. Phoebe reacts with surprise and then smiles as Ross continues talking. An unidentified person enters the room and approaches the couch, smiling at the interaction. Ross and Phoebe continue their conversation, with Ross pointing at Phoebe’s stomach and Phoebe responding with gestures.\n\n### **OBJECTS AND PROPS:**\n- Coffee table: wooden, with various magazines and a small box\n- Couch: striped with red, blue, and green cushions\n- Vase: with flowers, on a side table\n- Lamp: blue base, on a side table\n- Book: “The Complete Idiot’s Guide to…” (on coffee table)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses his major choice and singing to Phoebe’s stomach with Phoebe. The conversation has a playful, lighthearted tone, with Ross appearing animated and Phoebe reacting with surprise and amusement.\n\n### **TEMPORAL NOTES:**\nPhoebe enters frame from the doorway\nUnidentified person enters frame from the doorway\nRoss stands up and walks toward the couch\nPhoebe sits up on the couch\nRoss sits down on the couch\nRoss gestures with his hands while speaking\nPhoebe points at her stomach\nUnidentified person approaches the couch",
    "subtitles": "Hey, hey. That tone won't make me go any faster. - Joey. - That one will. ROSS: And everyone's telling me: \"You gotta pick a major. You gotta pick a major.\" So on a dare, I picked paleontology. And you have no idea what I'm saying, because, let's face it, you're a fetus. You're just happy you don't have gills anymore. Look, you don't have to talk to it. You can sing to it. Oh, please. I am not singing to your stomach, okay? - How's it going? ROSS: Shh, shh, shh. [SINGING] Here we come Walkin' down the street Get the funniest looks from Everyone we meet Hey, hey... - Hey, uh, did you just feel that? - I did. - Well, does it always, uh...? - No, no, that was the first. - Keep singing. Keep singing. ROSS: Oh. [SINGING] Hey, hey, you're my baby",
    "episode": "1x09 - The One Where Underdog Gets Away",
    "chunk": "chunk_00017",
    "start_chunk": "00:15:58.707",
    "end_chunk": "00:17:00.977"
  },
  "chunk_3": {
    "caption": "### **SCENE SETTING:**\nApartment hallway — nighttime, artificial hallway lighting\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored shirt - dark pants - dark, short hair - smiling\nRachel Green: dark-colored top - dark pants - shoulder-length brown hair - concerned\nPhoebe Buffay: light-colored sweater - dark pants - curly blonde hair - animated\nMonica Geller: dark-colored top - dark pants - dark, shoulder-length hair - serious\n\n### **ACTIONS AND INTERACTIONS:**\nRoss Geller sits on a couch, holding hands with Rachel Green, who is seated beside him. Phoebe Buffay leans over them, smiling and gesturing with her hand as she speaks. The scene shifts to a hallway where Ross Geller stands holding a box, while Rachel Green and Monica Geller stand nearby, engaged in a tense conversation. Rachel Green gestures emphatically while speaking to Ross Geller, who looks down at the box. Monica Geller stands with her arms crossed, observing the interaction.\n\n### **OBJECTS AND PROPS:**\n- Box: light-colored (held by Ross Geller)\n- Couch: multicolored (in living room scene)\n- Vase with flowers: colorful (on side table)\n- Statues: gray (on side table)\n- Door: green (in hallway)\n- Radiator: metal (in hallway)\n- Bookshelf: wooden (in background)\n\n### **DIALOGUE CONTEXT:**\nRoss Geller discusses the keys to an apartment with Rachel Green, who appears frustrated and gestures while speaking. The conversation has a tense tone, with Rachel Green appearing angry and Ross Geller looking downcast. Monica Geller observes the interaction with a serious expression.\n\n### **TEMPORAL NOTES:**\nScene transitions from living room to hallway\nRoss Geller moves from sitting to standing\nRachel Green moves from sitting to standing\nMonica Geller moves from standing to leaning against the wall",
    "subtitles": "[SINGING] Hey, hey, you're my baby And I can't wait to meet you When you come out I'll buy you a bagel And then we'll go to the zoo [CAROL & SUSAN SHRIEK] I felt it that time. Hey, hey, I'm your daddy I'm the one without any breasts - Nope, not that one. - Can you go any faster with that? Hey, I got one keyhole and about a zillion keys. You do the math. Why do you guys have so many keys in there anyway? For an emergency just like this. All right, listen, smirky. If it wasn't for your stupid balloon... ...I would be on a plane, watching a woman do this right now. But I'm not. I swear you said you had the keys. No. I wouldn't say I had the keys unless I had the keys. And I obviously did not have the keys. Okay, all right, that's it. Enough with the keys. No one say \"keys.\" Why would I have the keys?",
    "episode": "1x09 - The One Where Underdog Gets Away",
    "chunk": "chunk_00018",
    "start_chunk": "00:16:58.267",
    "end_chunk": "00:18:01.162"
  },
  "chunk_4": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment hallway and kitchen — evening, warm artificial lighting from wall sconces and interior lights.\n\n### **CHARACTERS PRESENT:**\nMonica Geller: dark-colored sweater - dark pants - dark, shoulder-length hair - animated, expressive\nRachel Green: dark sweater - dark pants - brown, shoulder-length hair - concerned, then distressed\nPhoebe Buffay: light-colored sweater - dark pants - blonde, shoulder-length hair - concerned, then startled\nChandler Bing: dark shirt with white pattern - dark pants - brown, medium-length hair - serious, then concerned\nJoey Tribbiani: striped sweater - blue jeans - brown, medium-length hair - concerned, then entering\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands in the hallway, gesturing wildly and speaking passionately to Rachel and Phoebe, who stand nearby with arms crossed or looking on with concern. Chandler and Joey enter from the right, holding a box, and join the group. The scene shifts to the kitchen, where smoke fills the air, and Monica, Rachel, and Phoebe react with shock and distress as they enter the smoky room. Monica continues to gesture and speak animatedly, while the others look around in confusion and concern.\n\n### **OBJECTS AND PROPS:**\n- Box: light-colored (held by Chandler)\n- Radiator: silver (in hallway)\n- Door: green (hallway)\n- Table: round, wooden (in kitchen)\n- Chairs: patterned (in kitchen)\n- Smoke: thick (filling kitchen)\n- Pie: in basket (on counter)\n- Shelves: blue (in kitchen)\n\n### **DIALOGUE CONTEXT:**\nMonica discusses the ruined Thanksgiving dinner with Rachel and Phoebe, expressing frustration that everything is burnt. The conversation has a tense, distressed tone, with Monica appearing animated and frustrated, and Rachel and Phoebe reacting with concern and shock as they enter the smoky kitchen.\n\n### **TEMPORAL NOTES:**\n- Monica moves from hallway to kitchen\n- Chandler and Joey enter from right side\n- Smoke appears in kitchen\n- Rachel and Phoebe enter kitchen from hallway\n- Monica gestures more intensely as she speaks",
    "subtitles": "Why would I have the keys? Aside from the fact that you said you did? - But I didn't. - Well, you should have. MONICA: Why? RACHEL: Because. Why? Because everything is my responsibility? Isn't it enough that I'm making Thanksgiving dinner? Everyone wants a different kind of potato, so I'm making different kinds of potatoes. You know, does anybody care what kind of potatoes I want? No, no, no! You know, just as long as Phoebe gets her peas and onions... ...and Mario gets his Tots. [SOBBING IN HIGH VOICE] It's my first Thanksgiving, and I... It's all burnt, and I can't... [SOBS] Okay, Monica, only dogs can hear you now, so... Look, the door's open. Here we go. Oh, God. - Ooh. - Oh. Well, the turkey's burnt. Potatoes are ruined. Potatoes are ruined. Potatoes are ruined. [SINGING] Here we come Walkin' down the... [ROSS HUMS]",
    "episode": "1x09 - The One Where Underdog Gets Away",
    "chunk": "chunk_00019",
    "start_chunk": "00:17:58.285",
    "end_chunk": "00:19:01.139"
  },
  "chunk_5": {
    "caption": "### **SCENE SETTING:**\nMonica’s apartment living room — evening, warm ambient lighting with smoke haze\n\n### **CHARACTERS PRESENT:**\nRoss Geller: dark-colored jacket - dark pants - short, dark hair - serious expression\nRachel Green: dark-colored sweater - dark pants - shoulder-length brown hair - concerned expression\nMonica Geller: dark-colored top - dark pants - dark, curly hair - animated expression\nChandler Bing: dark-colored sweater with white trim - dark pants - short, dark hair - surprised expression\nPhoebe Buffay: dark-colored top - dark pants - long, blonde hair - neutral expression\nJoey Tribbiani: dark-colored shirt - dark pants - short, dark hair - relaxed expression\n\n### **ACTIONS AND INTERACTIONS:**\nMonica stands in the kitchen area, gesturing animatedly while speaking to Ross and Rachel. Ross and Rachel stand near the refrigerator, looking concerned. Chandler sits on the couch, looking surprised as he listens. Phoebe sits in a chair, looking on. Joey sits on the couch, appearing relaxed. The group is engaged in a heated conversation, with Monica appearing to be the main speaker.\n\n### **OBJECTS AND PROPS:**\n- Coffee mugs: various colors (on table)\n- Wooden table (center of frame)\n- Refrigerator (against wall)\n- Couch (with patterned pillows)\n- Pumpkin decorations (on table)\n- Picture frame (on coffee table)\n\n### **DIALOGUE CONTEXT:**\nRoss discusses the Thanksgiving dinner with Monica and Rachel. The conversation has a tense tone, with Monica appearing animated and Rachel reacting with concern. Ross appears to be questioning the quality of the meal, while Monica defends her cooking.\n\n### **TEMPORAL NOTES:**\nMonica moves from the kitchen to the living room area\nRoss and Rachel shift positions slightly while standing\nChandler leans back in his chair\nPhoebe turns her head to look at the group\nJoey remains seated throughout the clip",
    "subtitles": "[ROSS HUMS] This doesn't smell like Mom's. No, it doesn't, does it? But you wanted lumps, Ross? Well, here you go, buddy. You got one. Oh, God, this is great. The plane is gone, so I guess I'm stuck here with you guys. Hey, we all had better plans, okay? This was nobody's first choice. Oh, really? So why was I busting my ass... ...to make this delicious Thanksgiving dinner?! - You call that delicious? - You be quiet! [ALL SHOUTING INDISTINCTLY] All right, stop it, stop it, stop it! Now, this feels like Thanksgiving. PHOEBE: Ew. - What? PHOEBE: Ugly Naked Guy's taking his turkey out of the oven.",
    "episode": "1x09 - The One Where Underdog Gets Away",
    "chunk": "chunk_00020",
    "start_chunk": "00:18:59.680",
    "end_chunk": "00:19:59.071"
  },
  "summary": "**SCENE OVERVIEW**\nThe events take place in Monica's apartment, primarily in the hallway and living room, over an evening. The scene transitions between these locations, with a notable shift to a smoke-filled kitchen.\n\n**KEY CHARACTERS**\n*   **Monica Geller:** Animated and initially concerned, later becomes frustrated and upset.\n*   **Rachel Green:** Concerned, then distressed and frustrated.\n*   **Ross Geller:** Concerned, then questioning and downcast.\n*   **Phoebe Buffay:** Concerned, then startled and observing.\n*   **Chandler Bing:** Observing with serious concern, later surprised.\n*   **Joey Tribbiani:** Observing, later entering with a box and relaxed.\n\n**MERGED NARRATIVE SUMMARY**\nThe group gathers in Monica's apartment, with initial discussions in the hallway and living room involving apartment keys and playful banter between Ross and Phoebe. The mood shifts to tension as Rachel expresses frustration about apartment keys with Ross, while Monica observes. The situation escalates when Monica, Rachel, and Phoebe discover their Thanksgiving dinner has been ruined and the kitchen is filled with smoke. Monica expresses extreme frustration about the burnt food. The group then reconvenes in the living room, with Monica animatedly defending her cooking to a concerned Ross and Rachel, while Chandler, Phoebe, and Joey observe.\n\n**IMPORTANT CONTEXT OR THEMES**\n*   **Relationship Developments:** The core group is present and engaged in discussions that highlight their interdependencies and varying reactions to stressful situations.\n*   **Emotional Tone:** The narrative shifts from tense discussions about practical matters (keys) to alarm and distress over a ruined Thanksgiving dinner, culminating in frustration and defensiveness regarding the cooking.\n*   **Plot Setup or Payoff:** The ruined Thanksgiving dinner becomes a central conflict, leading to heightened emotions and discussions about blame and defense.\n*   **Notable Transitions between Locations or Conversations:** The scene transitions from hallway discussions to a discovery of a smoke-filled kitchen, creating a stark visual and emotional shift, followed by a return to the living room for a tense group conversation."
}